{'rating_string': u'4.5', 'review_count': u'2,189', 'address': u'530 William Penn Place, Pittsburgh, PA 15219', 'review_list': [u'The William Penn is an iconic classic. The staff is well trained in customer interaction. The facility has been updated in the last few years, there are several restaurant/bar options and the rooms are comfortable. This is a good price performer.', u"We booked this hotel online based on the photos, and when we arrived the photos didn't even compare to the actual building. The staff was beyond professional and wonderful. The hotel itself was magnificent with all the details and elegance. The drinks were a little pricey however the place was amazing. They really go above and beyond for their guests.", u"Classy great hotel, that is rustic, yet updated. Well appointed rooms with comfortable beds, luxury linens, and updated bathrooms. Staff is excellent and there are a number of options within the property to eat. There's also a throwback bar that is worth a visit.", u"As a businessman I have stayed extensively in Pittsburgh in 2014 and also so far in 2015, mostly staying at the Fairmont down the street. I figured I'd try something new this time after a recent bad Birthday visit to the Fairmont, only 1 bad out of 30 last year, but was my birthday so it ruined the day. I...\n\n\nMore", u'Overall the hotel was beautiful, staff was friendly, and the food was good. I thought the bed was hard, but the room was clean and had plenty of space. I had plenty of room in the bathroom and loved the robe that was provided. The room was cleaned every day. The food for breakfast brought to my room was right...\n\n\nMore', u"The hotel is absolutely gorgeous. It is full of historical character which I love. There were plenty of workers outside to help as soon as we pulled up. We were greeted immediately when we walked in which was very nice and helped with directions on our way out since some roads were closed due to the St. Patrick's Day parade....\n\n\nMore", u'The hotel has an old timey feel and is in pretty good shape. It does have some flaws but the building is something like 100 years old. The staff is AWESOME except the concierge. Both times she has mis-guided me in places to go for a drink/sandwich outside of the hotel. Rooms are big enough to move around in without...\n\n\nMore', u"This hotel is absolutely gorgeous. Made a last minute decision to stay here when we got snowed in during a conference in February. Got a great price on Hotwire and couldn't have been happier. Went to the front desk and we were greeted by a very nice and professional young woman. We asked for a room upgrade and she gave...\n\n\nMore", u"This is a grand old place, not old like crappy, old like classy and distinguished, back to another era. It's a must see, must stay. The full service Starbucks in the lobby and convenient parking underground across the street is also nice.\nOne thing to be real careful about is be away from the elevator lobby, I was in room...\n\n\nMore", u'left material in safe, but when I called to see if they had found it, it was gone. Some one is enjoying my gift cards. My guess is some one from housekeeping was able to open the safe and saw the gift cards and wanted them, so they thru away averything else, because to turn them in would indicate they...\n\n\nMore'], 'title': u'Omni William Penn Hotel, Pittsburgh'}
{'rating_string': u'4.5', 'review_count': u'375', 'address': u'574 West General Robinson St, GPS use 214 instead of 574, Pittsburgh, PA 15212', 'review_list': [u'My husband and I live in the suburbs right outside of Pittsburgh. Every year we set aside a weekend to stay at a hotel in our beautiful city to enjoy all that it has to offer. We have stayed at the Sheraton in Station Square several times, at the Renaissance downtown, and the Holiday Inn on the South Side. The...\n\n\nMore', u'What a wonderful place to stay! The staff was very friendly and helpful. The room was very spacious. We had a king studio! Breakfast in the morning was a very nice variety of choices. The breakfast attendant was very thoughtful with putting out fresh hot food and providing a tray to take the food and drinks back to the room....\n\n\nMore', u'My wife and I spent one night at this Residence Inn during our recent trip to Pittsburgh. The hotel is located downtown, but was very accessible and easy to get in and out of. The staff was friendly and our room was clean and spacious. The free breakfast in the morning was very good with a varied selection of items....\n\n\nMore', u'We travel to Pittsburgh regularly to visit family and have now found what will be our regular place to stay. The room was attractive, comfortable and looked out on PNC Park and downtown. The breakfast is above average, to be sure. When we needed something fixed in the room it was handled immediately.', u'This review is very delayed but I wanted to make sure I wrote it. We came back home to a major snow storm and things have been crazy in WNY since lol. My husband and I stayed at the Residence Inn North shore the weekend of November 14th, 2014. The hotel was easy to get to and had onsite parking...\n\n\nMore', u"I travel into pittsburg for business often, and when I get a choice, I always choose this Residence Inn. Everyone is nice, breakfast is good, rooms are very large with nice kitchens, they'll do laundry and grocery shopping. Especially when you're staying for a week on business, this place is super perfect. They have a pool and gym and all...\n\n\nMore", u"I will not be the first to say that this particular hotel was by far one of the best I have ever stayed at. I booked a room for 2 days during Valentines Day. (13-15th) I made my reservation online through Marriott's site. Once my reservation was complete I contacted the manager to arrange to have flowers delivered to my...\n\n\nMore", u"Ok, I have stayed in every kind of Marriott chain there is. As far as Residence Inn is concerned, this is by far the best I've been to. They checked me in early, gave me all kinds of Pittsburgh tips, and my room is huge, clean, and the bed is comfortable. I left a tip for the cleaning staff and...\n\n\nMore", u'Booked this hotel for our trip to Pittsburgh and are very happy that we did. Location is great if you are go into the Andy Warhol museum, just a short walk down the street.\nHotel is very clean and the rooms are quite spacious.\nThe free breakfast is excellent with nice touches like make your own waffles.\nI would definitely...\n\n\nMore', u'My family and stayed here when my daughters had tickets to a show at STAGE AE. Just a block away from the concert. This hotel had a nice warm indoor pool for my youngest boy who did not go to the concert. Definitely book a suite. Plenty of room and separate bedrooms. I thought the traffic noise would bother me...\n\n\nMore'], 'title': u'Residence Inn Pittsburgh North Shore Hotel'}
{'rating_string': u'4.5', 'review_count': u'704', 'address': u'1247 Smallman Street, Pittsburgh, PA 15222', 'review_list': [u'Great hotel and location in Pittsburgh for the price upgrade it was worth it for the suite. Will definitely stay there again . Was in town for Hockey game only 15 min walk to Console. Went to Heinz History Musemn across street. Plenty of great spots to eat on Smallman Street all with in walking distance.', u'Had a great experience at this hotel. Taylor and Alexis were working the front desk at check in, and they were so pleasant and helpful. They pointed out a few nearby places to check out and asked if we needed any help with other plans for the evening. Upon entering the room I was amazed at the size! There were...\n\n\nMore', u'Room was clean. Staff friendly and helpful\nTyler was espcially helpful and always friendly\nWill use this hotel again when staying in Pittsburgh. The location is great. Free parking and within walking distance to great entertain,ent and great restaurants', u"My husbsnd and I came to town for the Maroon 5 concert and decided last minute to stay the night and go to the St. Patty's day parade and Pens game. We chose the Hampton because we had stayed here once before and because of the great location (if you are willing to walk a little in the city) to...\n\n\nMore", u'the front desk employees are the best exspecially mariea she was very friendly helpfully and professional if i had to rate her she would get an A. and taylor was great too they recommend some good restaurants', u'This hotel is in an excellant location. We arrived by train and the hotel is only 5 minutes from the station. The welcome by staff was, as always in the hotel chain, very good. Check-in was quick and we were given lots of information by the staff as where to eat etc. We were given loads of stuff as to...\n\n\nMore', u'This was an ideal location for our visit to downtown Pittsburgh. We were able to get to restaurants, clubs, and history center. The hotel service was fantastic and the staff was very complimentary to me in front of one of my clients.', u'Stayed here while attending the Garth Brooks concert. Although a bit dated, the property was very clean, staff was friendly, breakfast was good and efficient. It is conveniently located central to many city attractions. We would definitely return.', u"We recently stayed at this hotel during spring break. It was located downtown and close to everything. We were going to a Penguins hockey game and were only a couple minutes away.\nThe pool area was very nice for some family fun at the end of the day however the towels were very small and there wasn't many available. The...\n\n\nMore", u'Nice hotel close to everthing downtown. Clean and comfortable rooms. Good breakfast and nice pool area. Would have been nice to have a fridge and microwaves in the room for drinks and snacks. Free parking which is rare for a downtown hotel.'], 'title': u'Hampton Inn & Suites Pittsburgh - Downtown Hotel'}
{'rating_string': u'4.5', 'review_count': u'364', 'address': u'223 Federal Street, Pittsburgh, PA 15212', 'review_list': [u'Front desk staff were extremely pleasant and friendly when we arrived, and the facilities were clean and accessible. The room was also clean and comfortable. There was a free continental breakfast, with plenty of choices and fresh food. The seating area for breakfast did become full very quickly, though. The only downside to staying here was that there was an...\n\n\nMore', u'Visited this hotel with kids for a sports tournament. Hotel is directly across the street from baseball stadium and walking to lots of shops and restaurants. Rooms are spacious with pull out sofas and sitting areas. Free breakfast was typical. SOHO restaurant in lobby was very good. Parking is convenient but pricey. Our room was on the top floor, 3...\n\n\nMore', u'We checked into the SpringHill Suites North Shore on Friday night. The girl at the front desk was awesome....very helpful and so pleasant! She gave such a wonderful first impression to the hotel.\nWe had a beautiful suite on the 4th floor looking In out at the PNC Ball Park to our left. We were in town to catch a...\n\n\nMore', u'The 1st of 2 nights I stayed here I was put in a room that was as close to the highway as one can get without physically sleeping ON the highway. It was loud and I was woken up about 6x during my sleep. In the morning I requested a relocation of rooms and it was accommodated; however, I was...\n\n\nMore', u'We stayed here to be close to PNC Park, the location is very convenient. Hotel staff is courteous and attentive. Good food availble in the hotel! The rooms are in need an update, lots of wear and tear but overall the rooms were clean. Bathrooms are small but clean. Beds were comfortable and the halls were quiet.\nWould stay here...\n\n\nMore', u"We were in town for a Penguins game and stayed at this hotel. This hotel is directly across from PNC Park and just down the block from Heinz (which is usually why people stay here). But there's a free shuttle within a 3 mile radius but I suggest you sign up for it early. We used Uber to get to...\n\n\nMore", u'Right between a lot of bars, PNC Park and Heinz Field. Rooms were very clean and the staff was great. Expensive on game weekends....but sooooo convenient. Will definitely stay here again. Also...you can tailgate for Steeler games in the lot.', u"I had mixed feelings about my stay at SpringHill Suites North Shore. Starting with the good points, I'd say the hotel is ideally located, just across the bridge from Downtown and few blocks away from notable spots like Warhol's Museum. You really don't need a car most of the time. Plus, they provide shuttle service to the guests. Second, their...\n\n\nMore", u'Our Pittsburgh visit was an overnight stop while on a road trip from Chicago back to DC. So the most important feature for selecting a hotel was location. This North Shore property did not disappoint. It was ideally located in a quiet section right across the river from the very central Market Square of downtown Pittsburgh. Not only was the...\n\n\nMore', u"I have always been pleased with the Springhill suites that I have stayed at in the past. So it is no surprise that this particular one doesn't let me down overall. I will throw out my negative point first. I was in room 911, it was two doors down from the elevator. Now.....it's not what you think, hearing people walking...\n\n\nMore"], 'title': u'SpringHill Suites North Shore Hotel, Pittsburgh'}
{'rating_string': u'4.5', 'review_count': u'478', 'address': u'510 Market Street, at Fifth Avenue, Pittsburgh, PA 15222', 'review_list': [u'We purchased a certificate for a one night stay as part of a charity event package, and was pretty disappointed regarding the amount of blackout dates. If you are running a premium brand, why even have so many blackout dates...kind of cheesy, honestly. If you are going to give something for charity, give something of value, not rooms which you...\n\n\nMore', u'Arriving in Pittsburgh after a loooong drive, the folks at the Fairmont in Pittsburgh made us feel right at home with a warm welcome and great service. Training in this upscale chain shows in all of its employees as our needs were swiftly addressed and a room upgrade found upon realizing our room was just too small for ourselves and...\n\n\nMore', u'Easy concierge service in busy downtown Pittsburgh is appreciated. Warm welcoming lobby, friendly professional staff throughout. The lobby has floor to ceiling windows with great views and plenty of comfortable chairs to relax and enjoy the view. We looooved the Spa, Kyle was very helpful setting up three massages including a pregnancy massage for my sister-in-law. My massage with Shannon...\n\n\nMore', u"I am a bit of a hotel princess, and travel for business in high end hotels. As such, I don't tend to love, or stay in Fairmont Hotels much. So believe me when I tell you I was quite impressed with the Fairmont Pittsburgh.\nMy husband and I stayed there for two nights (we went to see a hockey game)...\n\n\nMore", u'We attending a magical wedding at this facility. The rooms all have a tremendous views of the city. This site is centrally located in the city. The location for a grand scale wedding was prime. The food and service was both top notched! The suites are modern in decor and the bathrooms with the glass showers and over sized, separate...\n\n\nMore', u'All of the rooms have a very good view of Pittsburgh. The rooms are spacious and beds very comfortable. They offer jazz most nights in the lobby and the fitness facility is one of the best ever in a hotel. Service is as expected at a Fairmont, top notch! Try for an upgrade looking at Mount Washington!', u'Had a great experience with the Fairmont in Pittsburgh. Definitely made my mid February snowy icy trip enjoyable. Location was great and we walked to a Broadway show at the Benedum Center, had fabulous room service for breakfast and walked to Market Square Primanti Bros and had a great local dining experience. Beautiful hotel, super luxe and quiet. Highly recommend.', u'Love the Hotel but was really disappointed our son was not able to use the gym because he was under 18. The location is fantastic especially if you want to walk Pittsburgh. I love that the Subway ( T ) is a block away and goes to the Heinz Field for free or anywhere downtown or South Hills for a...\n\n\nMore', u'This is the best hotel I have experienced. The room was immaculate, spacious, and extremely comfortable.\nThe staff "went beyond" in every way for my family. I look forward to returning!\nA special thank you to the staff for making our stay so enjoyable!', u'We stay at the Fairmont when we visit our son who goes to Pitt. Even though he is in Oakland, it is worth going down town to stay in a beautiful room with great views of the city. There is not a room with a bad view in the hotel. Staff is always welcoming and helpful and the bar and...\n\n\nMore'], 'title': u'Fairmont Pittsburgh Hotel'}
{'rating_string': u'4.0', 'review_count': u'69', 'address': u'300 West Station Square Drive, Pittsburgh, PA 15219', 'review_list': [u'Love staying here, the rooms are amazing, can park the car & take the ferry across or just get a cab. Tons of restaurants close by, night life & great bar. Will never stay anywhere else when visiting Pittsburgh.', u"My fiance and I booked a stay at this hotel because it was close to the convention center. With that being said, it was somewhat difficult (even using GPS) to navigate to the hotel. Once we arrived, we were advised to park in the adjacent city parking garage, where we were surprised to find the hotel parking rate was 'discounted'...\n\n\nMore", u'We had a room with a beautiful view of the river which we enjoyed very much. I was disappointed that while paying $400 a night for a room, the bathroom door hit against the toilet seat because the bathrooms are so small. Also when we checked in and walked the entire way to the other end of the hall to...\n\n\nMore', u'The Pittsburgh Sheraton is one of my favorite places to stay in Pittsburgh. The lobby is beautiful, wide-open, and has a huge glass wall that looks out to the Pittsburgh sky line. It is in a convenient location, close to public transport as well.', u'For the most part, I enjoyed my stay in this property. Check in was prompt. The room was spacious. The bathroom amenities were a nice touch. The view of downtown and the river is amazing. The property looks to have been renovated in the last few years. Hotel also provided some snacks at check in as part of their "guest...\n\n\nMore', u"Hotel was very clean, service was nice. The lobby bar and restaurant had a great ambiance. The hotel offers a shuttle that goes almost anywhere you need to be, and the driver was great! Downtown in minutes! We had an obstructed river view room and really couldn't hear the train that is near by.", u'Hotel is newly remodeled. But if you ask for a riverview room be forewarned that there is an active train track right next to the hotel. It runs day and night. Otherwise, nice hotel & did enjoy the view.', u"I've stayed here for several months and the staff is definitely the best part of my trips. Marie in the Club lounge is always friendly and the service is impeccable. Then their bellman Darryl is a pleasure and greets you every time you're walking by and always has a good story to tell. And Allen is very welcoming and efficient...\n\n\nMore", u'Booked this hotel for a great rate on priceline. The room was large, very comfortable and very nicely decorated. The king bed was super comfortable. Free internet was good, bathroom large and well decorated. The staff were friendly and helpful. Overall it was and excellent stay. Only complaint would be the high cost of parking, The most I had ever...\n\n\nMore', u"I recently stayed at this hotel on Jan 31 and Fe 6 because we were in town for an event both weekends. The hotel was exactly what we needed. It's a great location with restaurants and shopping near the facility and is convenient to downtown. The beds were comfortable, the rooms were clean, and the staff was friendly and professional....\n\n\nMore"], 'title': u'Sheraton Pittsburgh Hotel at Station Square Hotel Motel'}
{'rating_string': u'4.0', 'review_count': u'296', 'address': u'20 South Tenth Street, Pittsburgh, PA 15203', 'review_list': [u'Spent the night to enjoy the Southside nightlife. This hotel is just half a block from E. Carson Street. If you are a light sleeper, you may not want to stay here as many people were coming and going from the hotel. The parking lot is an extra $14.00 and is secure, however it is awkward to get into from...\n\n\nMore', u"Stayed here based on price and proximity to Duquesne University. It's within walking distance, although you have to climb a lot (200+) steps going over. The shuttle to the school was free, though. We got a AAA discount, too. Checked in on a Thursday and out that Saturday. Nice view of the city, the Monongahela, and Mount Washington from out...\n\n\nMore", u'The staff here goes above and beyond to take care of anything you may need. The shuttle will not only take you to the train,(which is free for pirates and steelers games from the drop off), but the will take you to the stores restaurants, whatever you need. The breakfast here is actually pretty good and if u get hungry...\n\n\nMore', u"Stayed Garth Brooks weekend. I checked in prior to the show on Friday. When I returned afterward, my key didn't work. I went to the front desk, they gave me a new key. I enter the room to find my bags missing, and someone else's bags and clothes in the room. I head back to the front desk, and a...\n\n\nMore", u"Spent a very nice weekend at this location January 23-25. Arrived late and very tired so really appreciated Rose's warm welcome and fast check-in. Next morning we were taken to the Strip District by shuttle. John, the driver was very friendly and knowledgeable. He gave us a little tour and was sweet enough to stop for us to take a...\n\n\nMore", u'I was there with a Bantam hockey team for a tournament in Pittsburgh. The hotel was very nice, and check in was easy. The staff was extremely friendly and helpful. Rooms were large and very clean. It is very close to Carson St. which has lots of restaurants and bars and Park Station. I would stay here again.', u"This HI express is located in a hot spot; the South side with lots of cool and funky restaurants and bars. It is also just a short walk from downtown. It has one of the better gyms I've seen at HI exp with cardio machines, dumbbells, med balls and a functional mobility area with ceiling high enough to jump rope....\n\n\nMore", u'The service was far better than I expected. Everyone was great, but Jay was above and beyond. The location was perfect. The beds were comfy. The room was clean. Parking was easy. There was always hot tea and coffee. Even the smell was great.', u'Everyone was very nice to us. Ms. Betty at the desk was very nice and helpful and even helped us book our next stay and talked to us about the membership clubl! The breakfast in the morning was very good and the room was clean and accommodating! Coming back May 30th for Kenny Chesney!', u"I will start off by saying i mostly stay at holiday inn's, theyre cheap, decent, and you always know what to expect (read my other reviews).\nBut this HIE is great. Clean spacious hotel in a great location. Easy to get to downtown and walking distance to carson st which is packed full of bars and restaurants. This hotel also...\n\n\nMore"], 'title': u'Holiday Inn Express Pittsburgh South Side Hotel'}
{'rating_string': u'4.5', 'review_count': u'925', 'address': u'107 6th Street, Pittsburgh, PA 15222', 'review_list': [u'We live in the suburbs of Pittsburgh and celebrated our anniversary downtown for a quick getaway. The Renaissance was the perfect choice. I am a platinum elite member with high expectations. The Renaissance exceeded them with exceptional service. The Renaissance is perfectly located and within walking distance to endless fun in the city. Great stay, and a special Thank You...\n\n\nMore', u'I checked in with Julie who greeted me with a smile, warm cookies and hot chocolate in a world of opulent old world elegance perfectly intersected with modern whimsy that only Renaissance could create.\nThis jewel of a hotel sits on the river overlooking the spectacular topography of beloved Pittsburgh surrounded by bridges, trees and homes tucked away in the...\n\n\nMore', u'very nice hotel as stated on website, no problems what so ever. very close to the benedum theater, great restaurants on the street on which the hotel was located. parking just across the street. I need 200 characters to submit this review, so now I am just filling in space.', u'I stayed here for 1 night on 3/9/15 for a last minute business trip. My room was on the 14th floor club level and it was ready when promised. Upon arrival the room was clean, neat, and tidy. The bed was comfortable and the bath room had plenty of towels. In all honesty its a nice place but the rooms...\n\n\nMore', u"When you first walk into the Lobby, you suddenly say wow on how beautiful this hotel is. In every hotel, the way you are treated is the most important to guest and the front desk staff was truly amazing. i can't remember her name, but she gave us a perfect check in experience Friday night and even walked with us...\n\n\nMore", u"My husband and I recently spent 2 night at this hotel, to celebrate his birthday. We have been here before, a few years ago. We requested a corner King-size bedroom on an upper floor, which we received. The hotel appears a bit more run down than we remember, but overall it's a lovely old building with an amazing lobby and...\n\n\nMore", u'My son and I were in town for a show at the Benedum Center and I wanted a hotel within walking distance. It was about a 5 minute walk or less and the area felt safe. The hotel was older, historic, but very well kept. The valet and service staff was great. The restaurant inside appeared nice but was an...\n\n\nMore', u"Smaller standard room than other Pittsburgh hotels I've stayed in. But loved the I room movie choices. Though expensive, they were the same as the theaters. Bed was comfortable., but not exceptional. Location was awesome. You can walk to any downtown venue-stadiums, theaters, restaurants, ice skating. Taxis easy to get for Strip area.", u'Regrettably, I only got to stay at this hotel for one night. I was in town for business and in order to get there before my client I had to fly in very early in the morning. I rarely as for an early check in but this was an extraordinary circumstance. The person at the front desk very pleasantly accommodated...\n\n\nMore', u'Beautiful hotel with very large, comfortable room. I enjoyed the room service, also. The parking is probably the best price in the city of Pittsburgh and right across the street. You can walk anywhere and getting out of the city is easy. I loved it here!'], 'title': u'Renaissance Pittsburgh Hotel'}
{'rating_string': u'4.0', 'review_count': u'376', 'address': u'260 North Shore Drive, Pittsburgh, PA 15212', 'review_list': [u'My wife and I try to stay at this hotel whenever we are in Pittsburgh. For the money you cant beat it. Staff is freaking awesome. The rooms are clean and roomy. The shuttle service is a wonderful convenience. Doesn\'t matter if its the Casino or the "Cultural district". They pick you up on time and its free. We are...\n\n\nMore', u'Great room, great desk staff, great price. Could not have been better! Came to town from Boston for a hockey game and to see the Warhol museum. Helpfull staff, indoor pool, free wifi, free computer to print tix to the game. interstate was a bit loud but for the price this is a steal', u"We spent a night here while passing through Pittsburgh. We were pleasantly surprised with the easy location, free parking, very friendly reception staff, clean and well appointed room. We had a pizza at the bar - very tasty. The only thing I wasn't keen on is that the wash basin isn't in the bathroom - more the bedroom - I'm...\n\n\nMore", u'My husband and I have stayed her a couple of times. We can down to Pittsburgh this weekend to see a show at the CLO Cabaret, and stayed the night at the Hyatt Place. Very nice room, comfy king size bed, in room fridge, large sitting area, nice size TV that can be turned to face sitting area or bed....\n\n\nMore', u'My wife, son, and I traveled to Pittsburgh to spend Thanksgiving with my brother-in-law. He lives to the west of Pittsburgh so we wanted a hotel on the north shore. We chose the Hyatt Place on the North shore. From check in to check out, our stay was wonderful. The staff were just great, very welcoming and helpful. Our room...\n\n\nMore', u'great hotel to stay at if your going to a game or just in town for a few days. Clean, rooms are nice.. Price was a little higher than I expected .. Still a good stay And I would recommend this hotel to anyone traveling to Pittsburgh', u'Stayed on Feb 7 on annual birthday trip my wife plans for me/ Front desk staff was exceptional in all aspects, Room was very clean,breakfast was good.The T station is right behind hotel,free ride to downtown,beats parking at the arena.Overall we had a wonderful stay.Will stay at the Hyatt Place again.', u'For this type of hotel, practical and no frills when traveling this is a great option.\nCheck in and out were quick, service friendly and the room was clean and had everything you need.\nA very good option on the north side of Pittsburgh.', u"I travel to Pittsburgh once per month on business and after trying numerous options, this hotel has become my go to place to stay. The staff is super friendly and check in always quick. I also prefer the breakfasts offered by Hyatt vs. other chains like Marriott. The rooms have a boutique hotel feel to them and the location can't...\n\n\nMore", u'Stayed here in the summer of 2014 to attend a concert at AE field and explore the city. The room was very clean and the staff were very friendly and helpful. The free continental breakfast was fine and were able to find things to eat both mornings we were there. The beds and the room itself was very comfortable. We...\n\n\nMore'], 'title': u'Hyatt Place Pittsburgh-North Shore Hotel'}
{'rating_string': u'4.5', 'review_count': u'174', 'address': u'2795 South Water Street, Pittsburgh, PA 15203', 'review_list': [u'I stayed here on a recommendation and could not have been happier with my stay. The room had a mini-fridge and small kitchenette area with a TV on a swivel so it could be viewed from the bed, the living area, or the kitchen. The room and bathroom were very clean. My room was facing the Hofbrau House so I...\n\n\nMore', u'We stayed one night while in town for a concert. The staff were very accommodating and the little touches were very comforting. The room was very clean and comfortable. Hotel was just a short drive to all points of interest downtown. Breakfast was delicious. Will definitely be staying again next time we are in town.', u'I found the rooms to be quiet very cool well laid out staff was excellent very friendly my only negative would be that I did not care for the breakfast unless you had an omelette. We enjoyed the walking distance to the Hofbrau house and the cheesecake factory southside works is an absolute pleasure to walk around!', u'We stayed here last weekend to visit my son who lives in Southside and were very pleased. The Hyatt House is a couple of years old but seems brand new - the room was very clean and laid out nicely with a small kitchen and living area - the TV rotated from the living area to the bed - and...\n\n\nMore', u'This was our first time in Pittsburgh and we were highly impressed with this hotel. We had come into town for the Garth Brooks concert and found that our hotel made our stay in Pittsburgh even more enjoyable. The service was great, room was clean and beautiful and the hotel shuttle took you pretty much anywhere you wanted to go....\n\n\nMore', u"I've now stayed at Hyatt House twice and will stay here from now on. I travel to Pittsburgh a few times a year and prefer to stay in the South Side. The shuttle makes the location perfect for a stay for any reason. We utilize it for drop offs all over town. The staff is super friendly and the rooms...\n\n\nMore", u'We stayed here for 3 night in December and loved it! We arrived late at night after travelling 28 hours from Australia and were very impressed. The staff we very friendly and went above and beyond to make our stay a good one. There were 5 adults and we had a two bedroom room with sofa bed. The room was...\n\n\nMore', u"This could well be the best hotel in its class that we've stayed at. The hotel is nicely located, has very courteous staff, is very functional and good value for money. It has a diverse set of restaurants at walking distance and a number of interesting shops also. It's location is reasonably proximate to the Pittsburgh universities also (CMU and...\n\n\nMore", u'I always stay in a lot of Hyatts because I find most of them to be modern ans generally very good hotels. That one was especially good.\nI got a standard room / suite and it looked great, very modern and clean, with a swivel TV that was very convenient and could be used in both the living-room and the...\n\n\nMore', u"A lot going for this hotel:\nFelt brand new - prob isn't very old b/c it's in a totally redone section of downtown PIT\nSpacious and very comfortable room- you get a kitchen where it's totally possible to cook and dine in at the breakfast bar (I didn't) and a sectional couch in the living room area.\nThere's no door...\n\n\nMore"], 'title': u'HYATT house Pittsburgh-South Side Hotel'}
{'rating_string': u'4.5', 'review_count': u'511', 'address': u'614 Pressley St, Pittsburgh, PA 15212', 'review_list': [u'My wife and I stayed at the Priory Hotel recently and had a great time. The rooms were very nice, clean, and inviting. The hotel and banquet facilities are beautiful. The lobby quaint and comfortable. We enjoyed the free limo service to local restaurants. All in all, the Priory was central to a wonderful European-Style weekend in Pittsburgh.\nConveniently located...\n\n\nMore', u'We moved to a town outside of Pittsburgh and the area was still very much new to us. On a harsh winter’s day, we were scheduled to travel aboard Amtrak’s “The Pennsylvanian” to New York City. Not wanting to risk missing the train trying to battle rush hour traffic and bad weather, I pulled up “Kayak” and searched for a...\n\n\nMore', u"My husband and I recently spent a night at The Priory Hotel and had a wonderful experience. The staff is awesome and efficient! We checked in and explored the hotel. We were fascinated with the history and architecture of the hotel. The Monk's Bar was small yet cozy and had an amazing selection of drinks, some classics and a few...\n\n\nMore", u'We go to Pittsburgh a couple of times each year for cultural activities and because we like the area very much. We were looking for a better price per night for our stay. The Priory fit the bill and then some. The staff was very friendly and accommodating. We used the shuttle service a lot to get to the cultural...\n\n\nMore', u'This was our first trip to Pittsburgh and I thought the neighborhood was a little sketchy. Very cute hotel though. Bed was a little too hard for our liking. Room was clean with a view of the side parking lot, which was nice to keep an eye on the car and to be able to remote start it this time...\n\n\nMore', u'My wife and I stayed at the Priory in January for a weekend staycation. It was a great choice.\nOur room was clean and comfortable. We also enjoyed a drink in the first floor bar - and the fireplace really warmed us up when we came in from the cold. The staff was very helpful and extremely friendly. We were...\n\n\nMore', u'lovely building, with equally lovely rooms, in a good location.\ni loved my view of the courtyard.\nfree shuttle service is the best!\nvery friendly and helpful staff.\nfireplace kept going in the lounge (in between the lobby and the bar).\ncute little deck and courtyard out back (handy for those us that still smoke!).\nbig chest of drawers, closet,...\n\n\nMore', u'The hotel (really an enhanced bed and breakfast) is nice enough although the price is rather high compared with the number of services offered. First the good: free parking and internet, relatively comfortable bed with nice linens, friendly staff, supermarket next door, free shuttle service. Now the so-so: rather dark, the carpeting in the room was clean but needed a...\n\n\nMore', u"Great old building turned into a wonderful hotel. Friendly, helpful staff took care of us as soon as we came in the door. Big, comfortable room....cute bar downstairs next to a warm fireplace....simple good breakfast in the morning. We'll stay here again.", u'We spent a night in Pittsburgh between Christmas and New Year\'s. We like "old and historical", so my husband booked a room at the Priory. We weren\'t disappointed. The room was clean and well-appointed. The bar, lounge and breakfast area were comfortable and inviting, and decorated for Christmas. The staff was helpful and friendly, especially the young lady in the...\n\n\nMore'], 'title': u'The Priory Hotel, Pittsburgh'}
{'rating_string': u'4.0', 'review_count': u'382', 'address': u'500 Mansfield Avenue, Pittsburgh, PA 15205', 'review_list': [u'Some of the best customer service from a hotel. Free NY Times, USA Today, Local News Paper. Free fresh fruit and cookies. Great places to eat on property. Great fitness room. Free shuttle to and from the airport.', u'I have traveled extensively over the last 11 years, having 170 flights and accompanying hotels in the last year. By far, The DoubleTree Green Tree has the best staff and accommodations as I have found in the Pittsburgh area. I am so satisfied with the service there, that I typically will stay there as long as I am within 2...\n\n\nMore', u'A few weeks ago I stayed at the Monroeville Doubletree. That was my normal stop. But it was so bad I decided I had to change hotels. This Green Tree hotel is nice and clean. One elevator was not working over the weekend, so that was not great. The room was extra large. Very nice breakfast buffet in the morning....\n\n\nMore', u'I was at the hotel for a site tour and arrived on Sunday evening with an associate. We had a fast and efficient check-in and then went to the Bar/restaurant for dinner which was excellent. We were in a parlor suite and the suite was comfortable and clean. I used the internet and had John Anderson on the AV staff...\n\n\nMore', u'This hotel met all my expections. The facilities were great and the staff are kind and helpful. The room rates are reasonable and amenities are of greater value than other hotels of this size and cost.', u'I had a part time job in Pittsburgh and stayed at this hotel for about five years 1-2 days a week. Absolutely superb. Great rooms and food is on par with a several star restaurant. Free breakfast with a large selection is plus.', u'The hotel itself is very lack luster, but the location is nice in relation to the downtown Pittsburgh area. When our group arrived, we were greeted by a rude front desk employee who was not interested in helping us at all. This was the only rude employee we encountered, thankfully. We had an issue with the heating in our room...\n\n\nMore', u"This hotel is nice. The open atmosphere is a welcomed upgrade compared to another chain in New York that wanted to charge $10 to have a fridge brought to my room. The linens are crisp (1000 TC),thick plush towels in the bathroom, a cafe & a restaurant,indoor heated pool,& much more. You won't regret your stay and the cookie is...\n\n\nMore", u'We were in Pittsburgh for a Garth Brooks concert February 6, 2015 and this motel was easy to find off the Interstate. Since we had concert tickets for 10:30 the motel provided shuttle service to and from the concert (what a blessing this turned out to be). Ryan and Jack knew how to get us into the concert hall and...\n\n\nMore', u"For the value, you couldn't ask for anything better. Lounge/Restaurant was nice. Breakfast (thought not included) was fabulous! Rooms were spacious; Clean; Quiet; and Comfortable. The indoor/outdoor pool and hot tub were a bonus. No sauna. Pet friendly - $50/fee but includes dogs up to 70lbs."], 'title': u'DoubleTree by Hilton Hotel Pittsburgh-Green Tree'}
{'rating_string': u'4.5', 'review_count': u'482', 'address': u'555 Trumbull Drive, Pittsburgh, PA 15205', 'review_list': [u'My family and I stayed here with our dogs while in town for a long weekend and it was the best pet friendly hotel we have ever stayed at! Everything was incredibly clean and well taken care of, staff was so nice, and the free breakfast was delicious and different each morning! We also like that the parking is free...\n\n\nMore', u"We were here for the weekend and everything was really pleasant except the bed was sooooo uncomfortable. It had no support what so ever.. It's a shame because everything else was great- the staff, maids, hot breakfast, location not too far from downtown for a really decent rate. However, because of the bed issue I will not return to this...\n\n\nMore", u'We decided to stay in this Hampton Inn because of good experience at other Hampton Inn facilities. Nevertheless, this facility does not live up to the par. The front desk staff was not very pleasant for some reason. There is no shampoo and conditioners in the room. There are three bottles of body lotion instead.', u"I stayed there on March 6th with my 2 adult children. We got in late and then ran out to WalMart because we had forgotten a few things. When we got back, close to 1:00 AM, we tried the side door with our key card. The swipe didn't work. My daughter pulled the door handle and it opened. No key...\n\n\nMore", u'Pre & Post-Op @ AGH was most comfortable, affordable and easy accessible. Front desk staff, Van driver & breakfast staff were most courteous and helpful. Room/bath/motel - well maintained, clean and generous with amenities. Quiet and comfortable.', u'I decided to stay here because of the wonderful 6 inches of snow. After securing a deal on the app Hotel Tonight-- $77 compared to the $115 the Hilton Website charged. I arrived (after hitting the pothole that was under the snow) and walked in.\nThey were having a reception and I received a free alcoholic beverage, that is a...\n\n\nMore', u'Stayed here on our way north. A bit of trouble finding the hotel because of road construction detours but found the facility to be very good. The staff are very friendly and helpful especially with restaurant recommendations. The room was very comfortable and clean. The breakfast and breakfast facility was very good. We would definitely stay here again.', u'To sleep well I need quiet or a steady white noise. The fan of the HVAC in this hotel turns on and off all night, disrupting my sleep. The temp was fine, but there was no way to fix the fan in the on position.', u"This was our second stay at this Hampton Inn and it did not disappoint. We didn't spend much time at the hotel but did enjoy our one night there. Bed was comfy. Our room wasn't ready when we checked in so they gave us the room next door. Very nice of them. I wish they had mouthwash in the bathroom...\n\n\nMore", u"Hampton Greentree was clean, well equipped with TV, microwave, frig, coffee maker. Complimentary breakfast was wonderful. Especially liked the complimentary shuttle service. Will take you to areas in downtown Pittsburgh and then pick you up. Great for concerts or sporting events. You don't have to worry about getting there and then having to park your car. This hotel was easily...\n\n\nMore"], 'title': u'Hampton Inn Pittsburgh/Greentree Hotel'}
{'rating_string': u'4.0', 'review_count': u'134', 'address': u'100 Chauvet Drive, Pittsburgh, PA 15275', 'review_list': [u"My boyfriend and I stayed here december of 2014. The value was excellent, especially since the rooms are suites. The only issue we had was that the bathtub plug didn't hold the water in the tub. However, it wasn't big enough of an issue to keep us from returning in the future.", u'We recently were taking a trip to Orlando and had a very early flight. We live one and a half hours from the airport and decided to stay near by the night before. We looked for a reasonably priced hotel close by and decided on Candlewood Suites. It is located in Robinson Town Center, so only a few miles from...\n\n\nMore', u'This hotel is a great value. Good location with comfortable amenities such as a kitchenette in your room and a "lending library" of accoutrements to make your stay more comfortable. You\'re not going to find elaborate common areas or breakfast buffets but if you\'re looking for a clean, comfortable room for good price you\'ll love this hotel.', u'Candlewood Suites was a very nice surprise!. The pricing was fantastic. The service polite and friendly. The hotel up to date style, clean, and had fitness room and store. The room was spacious, warm and included all amenities including the kitchen wear and dvd player. They allow pets for my next trip I travel with them. I will definitely be...\n\n\nMore', u"What a pleasant surprise! We stayed here 2 years ago and were pleased with the hotel. But they have redone the rooms and now they're even better. All rooms have a functional kitchen including a cooktop, full size refrigerator with ice maker, dishwasher, dishes, and cookies. You can also borrow small appliances such as a full size coffee maker, blender,...\n\n\nMore", u'Great location, about 3o min to the city. Not bad at all. Very impressed when we walked in the room. Was just expecting a bed and bathroom maybe a small tv. It had a stove, ref, microwave, dishwasher and garbage disposal, flat screen tv and everything was very clean and staff very courteous. Would definitely come back again.', u"Stayed here for one night. Nothing fancy, just a nice clean room with a kitchenette, large desk area and comfortable bed. I would stay here again. Seemed pretty quiet to me considering the parking lot was full. Just up the road in the same parking lot as Target, you'll find Bocktown Beer and Grill. Lots of craft beer on tap....\n\n\nMore", u'Nice clean hotel. Nice kitchenettes. Friendly staff. No pool or hot tub but very clean hotel. Stayed for a week and greatly enjoyed my stay. Good food around hotel. Will definitely stay there again. Family and business friendly. Quiet for the most part. Not the thickest walls bit fairly quiet', u"Stayed at this hotel for the last weekend of december 2014 and the first weekend of the new year for the Steeler's games, and could not have asked for a better experience. everything was to the highest quality possible. the staff were very friendly and more than willing to bring up any extra toiletries that we needed. I love the...\n\n\nMore", u'We\'ve stayed at many Candlewood suites and have always found them above average. This facility is certainly the exception. Several things didn\'t work in the room and the room itself was "marginally clean."\nPerhaps the worst part was the staff, especially April, the "manager." I\'m not used to getting blatant rudeness in response to an issue. April doesn\'t subscribe to...\n\n\nMore'], 'title': u'Candlewood Suites - Pittsburgh Airport Hotel'}
{'rating_string': u'4.0', 'review_count': u'960', 'address': u'One Bigelow Square, Pittsburgh, PA 15219', 'review_list': [u'We originally chose this hotel for its location downtown but once there it exceeded our expectations for great location and hospitality. The hotel was very clean and the staff very helpful including the front desk workers, retaurant workers and housekeeping staff (who were very obliging and friendly and professional). We will definitely be returning to Pittsburgh and will book our...\n\n\nMore', u"Nice hotel, up to double tree standards. sunday breakfast is completely over priced. No one stopped to explain the options so we got up and helped ourselves to buffet scrambled eggs, potatoes, and bacon. Little did we know that was $17 per person. wow!! I'd take a lesson from your Hampton Inn. better breakfast and its included in the price...\n\n\nMore", u"We had a great stay here ! Very nice staff and great clean rooms ! Close to everything , very accommodating . Went to a concert .. Walked there and to the St. Patrick 's day parade right out back doors and down one street . Great location if you want to get the T right out back door. We...\n\n\nMore", u'While the hotel room was extremely "modern" for my taste, that was the only some-what negative comment I have. The room was extremely clean and comfortable, especially the bed and bathroom. I always picture what happens in hotel rooms and in turn I don\'t want to touch anything. After a day/night there, I warmed up to the place.', u'My stay was excellent! From my e-check in to my departure, the hotel did everything I expected as a customer. I would definitely recommend a stay at this Doubletree Hotel if you plan a stay in Pittsburgh. I plan on returning with my family next time to explore the city of Pittsburgh.', u'Within easy walking distance to Consol Energy Center. Hotel is very nice but figuring out which entrance to use for the garage was difficult. We thought the drinks in the lounge were pretty expensive. Ordered a draft beer and a wine = $18.75 without tip. Not much to do within walking distance of hotel but they offer a complimentary shuttle...\n\n\nMore', u'The Hotel was in a great location to access to different parts of Pittsburgh! The Staff is great very polite and courtesy. The restaurant and the food is good. I have use this hotel on many occasion for business trips and would continue to use them for future trips!!!', u'As the Doubletree is an older property I was pleasantly surprised. My wife was there for a weekend of meetings so I tagged along. Beds were superb with great pillows and the room was very quiet. Front desk and valet car staff very good. Breakfast for the meetings was lacking yogurt and not much fruit but a lot of sweets.', u'I stayed at the Double Tree while attending a conference in Pittsburgh and had a good experience. The hotel is centrally located - walking distance to downtown shops and restaurants. Professional and friendly front desk staff gave me an upgrade of the room upon request.', u'Over all the quality of service and the facilities were outstanding. The staff was very friendly and helpful. Our room was clean and very quite. The one thing that was very surprising to ma as the fact that I had to pay to park our car while staying at this hotel. I have stayed in several other hotels in Pittsburgh...\n\n\nMore'], 'title': u'DoubleTree by Hilton Hotel & Suites Pittsburgh Downtown'}
{'rating_string': u'4.0', 'review_count': u'306', 'address': u'1000 Penn Avenue, Pittsburgh, PA 15222', 'review_list': [u"The Westin is currently being spruced up and renovation in the lobby was ongoing during our stay. However it didn't impede our activities. The hotel is a bright and fresh stake on a big convention hotel. Brittany at the front desk was extremely helpful to us. We requested a city view and got a nice view of the bridges and...\n\n\nMore", u'A nice stay at a great downtown hotel.We booked a hot rate on hotwire and got a great deal for a King Room with a view. We did not utilize the valet service but it is available. There is self parking on site and we opted to use that. The lobby is undergoing a renovation so there was alot of...\n\n\nMore', u'I was at the Westin for a conference. Coming from Saudi Arabia, I have experienced many high level hotels. Although when I was there the lobby was under construction, it in no way took away from the feel of the place. The staff was accommodating and very eager to help a first time visitor. The restaurant had A+ sushi and...\n\n\nMore', u'1) run down. The decor involved beige carpets and green wall paper. That was the Westin color scheme in the late 90s and early 2000s before they switched to grey in 2004!\n2) room smells of body odor! No doubt absorbed by the fabrics due to lack of renovation in 15 years or so\n3) breakfast is sit down and...\n\n\nMore', u'Attended a conference here last week. Nice space, well supported and laid out, great staff, very convenient to a lot of things, walk to most hotels. Good Taxi service.\nThe Plenary sessions of the conference with 1600 people had great screens and sound.', u"We stayed for one night to attend a concert and it was beautiful. Check in was sweet and I loved the fact that we had valet parking for a good price. Our toilet didn't work when we first got there but they sent a repair man up right away to solve out issues. The bed was so big and one...\n\n\nMore", u'We were in town for the Steelers vs saints football game. There are not a lot of choices for decent hotels near Heinz field. This was the best of not a lot of great options. We could walk to the game, which took about 20 minutes I felt safe walking both day and night but Pittsburgh has some work to...\n\n\nMore', u'Very nice hotel that is connected the the convention center. A lot of good places to eat within walking distance of hotel. They are remodeling the lobby area but still had a good stay. I stayed for 8 days and have no complaints. Employees are very helpful.', u'My husband and I stayed here the night of our wedding on October 18th,2013. I called many hotels but the Westin was the only hotel to seem enthusiatic about my upcoming life event. Upon arrival we were upgraded to an unbelievable sweet. It had double doors entering the room,a huge living room,full kitchen,dining to sit at least 8, a separate...\n\n\nMore', u"Upon arrival, I was greeted by Jason, a very kind front desk agent. I felt welcomed by him and he was very accommodating to the condition of my stay. He was knowledgeable about different hotel amenities and other questions I had. I believe that Jason's pleasant and welcoming attitude set the tone for my two day weekend stay which was...\n\n\nMore"], 'title': u'The Westin Convention Center Pittsburgh Hotel'}
{'rating_string': u'4.0', 'review_count': u'515', 'address': u'112 Washington Place, Pittsburgh, PA 15219', 'review_list': [u'This was one of the best hotel experiences we have had. Very helpful staff and great facility. Clean rooms. Nice pool. Would suggest adding a hot tub. Workout area was very nice. Shuttle was also helpful. Parking was a bit of an issue as our SUV would not fit in the garage so we were forced to valet park which...\n\n\nMore', u'Great hotel with easy walking distance to see the Penguins. Front desk staff and valet were very friendly. The waitress on the bar needs to smile as she was quite miserable. The room was perfect and very clean. I will recommend to all and will return.', u'Check in was a breeze; front desk was wonderful. Kiara went out of her way to ensure we knew the ins and outs of the hotel and area. We used points for one night and paid for the second night. Our reservations were merged so we did not have to check out and back in again. Thanks so much Kiara!...\n\n\nMore', u'This Marriott is very clean, great location and the staff was wonderful! Our room was nice with an awesome shower. The bed was so inviting. It was quite and a good price to park downtown. We rode the shuttle to another location which saved us money.The bar was a nice place and again great service.', u"Went to a concert in December at the Consol Energy Center & found this to be a convenient location across the street.\nI was slightly disappointed as the room as showing it's age. For being a Mariott & the price I expected a little more upscale. The room was very average, it could have been a Fairfield. The lobby area...\n\n\nMore", u"Like all marriott properties, this place is very well kept. Even though it's downtown it is fairly\nIt was a nice touch that they gave me a welcome card for extra points or a complimentary drink in the lounge.\nAlso, it's nice they serve food in the lounge until midnight.\nKeep up the good work.", u'I stayed here for a conference and liked some aspects but was very disappointed by others. All the meeting rooms were on the 2nd floor, easy to find, perfect connection to very high speed internet (this was true throughout the hotel, though I did not pay for it and am not sure if it was free because of the conference...\n\n\nMore', u'The Marriott City Center is all that you expect from a full service Marriott with attention given to friendliness and cleanliness. The night that I spent here happened to coincide with a night of two back-to-back sold-out Garth Brooks concerts and all the attendant traffic and crowds that it brought. I was impressed by how he Marriott was able to...\n\n\nMore', u'This hotel provided very well for our conference of about 250 people. The only problem was that some of the technology for presentations was not quite up to par. There were wavy screens that made the information on the Powerpoints hard to read. However, the meals (included with the conference) were good and served with dispatch. The bedrooms were spacious....\n\n\nMore', u'We stayed at the Marriott City Center while traveling for a hockey tournament. The staff was extremely helpful, polite, and accommodating. We traveled with small children, which enjoyed the nightly free hot chocolate.\nThe room we got was “no-frills”. Two double beds, a bathroom, a single serve coffee maker. We were on the 12th floor and had a good view...\n\n\nMore'], 'title': u'Marriott Pittsburgh City Center Hotel'}
{'rating_string': u'4.5', 'review_count': u'401', 'address': u'5405 Fifth Ave, Pittsburgh, PA 15232', 'review_list': [u"I loved this roomy, well appointed room! Beautiful and comfortable furnishings. Convenient location for our over night visit to Shadyside. I'm a very light sleeper, however, and being right next to the elevator was not a good thing for me. Also, parking is very, very limited and not well lit.", u"This hotel is converted apartments and the resulting charm is stunning, the pics don't do it justice. We were able to check in 2 hrs early even with the St Patricks Day crowd. The best part is that downtown Shadyside is a couple blocks away and has the most eclectic shopping and restaurant choices you could ask for. We ate...\n\n\nMore", u"This was my first experience at Shady Side, but my husbands second time there. I couldn't understand his enthusiasm for returning but once inside I got it. Well appointed throughout with comfy beds, linens and plenty of seating in the living room. The bathroom & kitchen are small but clean. Our two bedroom cost less than the other one bedroom...\n\n\nMore", u'We stayed for three nights in February 2015 while our son was auditioning at Carnegie Mellon. The location was great, about 3/4 mile from campus. We were able to walk to CMU, the Carnegie Museums, and nearby shops and restaurants (despite lots of snow and quite cold temperatures!).\nAs a family of 4, we really appreciated having the kitchen and...\n\n\nMore', u'We had to go to children\'s hospital last minute n first night stayed at a "name brand hotel" wish I would have picked Shadyside first!! It was closer than the other n we felt right at home. Never cramped n in each other\'s way n my 7yr old was ecstatic that he had his own room. The best part is...\n\n\nMore', u'My son and I had a wonderful stay at this hotel. As we were there for 4 nights we wanted a convenient location (to Universities), a comfortable two bedroom apartment with a useable kitchen and access to a laundry. This hotel had all those amenities and more - the staff were incredibly friendly and helpful and the apartment was very...\n\n\nMore', u'In town because my son was in the hospital, Tried Hotel Tonight and decided on Shadyside Inn because of the great rate and the apartment style rooms. Great location, easy access to Walnut street and Shadyside. Loved the full kitchen and the room since. Staff was very helpful and pleasant. Very good option for a room while in Pittsburgh. Price...\n\n\nMore', u'The price was very reasonable for the two bedroom suite. The property and room was clean, comfortable and contemporary. The location just two blocks from the shops and restaurants in Shadyside and on Fifth Avenue close to Oakland/Universities/Parks, etc.', u'I stayed two nights while my father had surgery at Shadyside Hospital. It was a perfect arrangement - close enough I could walk to the hospital & to a wonderful selection of shops & restaurants. The staff was extremely helpful, friendly & accommodating (the welcome bag was thoughtful!). Having a parking space provided was a plus. The apt, was clean,...\n\n\nMore', u"Even on the phone this group of people makes you want to stay in Pittsburgh as long as you can. I stayed in a suite half the price per night of anywhere I've been in two years and far nicer than where I live. Everything was plush but the nicest part of all was the pleasant and accommodating, interested and...\n\n\nMore"], 'title': u'Shadyside Inn All Suites Hotel, Pittsburgh'}
{'rating_string': u'3.5', 'review_count': u'236', 'address': u'6404 Steubenville Pike, Pittsburgh, PA 15205', 'review_list': [u"Pictures nothing like the internet!\nDusty, stains in toilet, and so small. The heater was so loud, it woke you up every time it came on. We then turned it off.\nWe were told there would be a coffee maker, and there wasn't.\nOur room was at the end of the last building, next to dumpsters.\nCareful driving in parking...\n\n\nMore", u'I had the impression that this was an upgraded Red Roof but only certain rooms are plus and you would pay more. We got a standard room which was renovated but had no coffee maker, no fridge, no hair dryer, no microwave all of which we are used to getting in other hotels for less price. The exterior of the...\n\n\nMore', u"It's been years since we have stayed at a Red Roof [for good reason] BUT we were pleasantly surprised and impressed by this new and improved motel. The rooms were clean and comfortable. The bathroom is very small but the shower is good. The staff is pleasant. Good location for access to Hwy 79. Lots of shopping nearby within walking...\n\n\nMore", u'Although it was a little hard at first to find the access to the hotel because it is set back a little from the road, once we got into our room, it was excellent. The check-in was a breeze and we drove up to our room and unloaded our bags. The beds were very comfortable and our room had a...\n\n\nMore', u'I was only in Pittsburgh for the night due to the weather diverting my flight. A friend talked with Ava at the front desk while I had to be on hold with the airline. My friend booked a room at 5pm on a snowy Saturday at a better rate than I had found online. The room appeared recently renovated, and...\n\n\nMore', u'I recently stayed in the Red Roof Inn in the Robinson Township of Pittsburgh. I thoroughly enjoyed the stay. The Staff were very friendly, The rooms were very clean, The location was great, near restaurants and stores. Over all my stay with them was very enjoyable.', u'This was a very nice hotel. Clean and quiet, with very friendly American staff. Also seemed to be one of the more reasonably priced hotels in the area. Young lady at front desk was very nice, allowed me to print my airline boarding passes on her desk computer. Restaurants nearby, only 15 minutes from airport.', u"Upon checking in the front desk clerk - Phyllis was extremely helpful. I didn't have to ask for my membership perk (only a free bottle of water but you'd be amazed how many other locations don't automatically offer it) I was asking some questions about where I could go to have a bite to eat and watch the Sunday night...\n\n\nMore", u"I have been staying here for the last 4 months for business. Everyday. That should say it all right there. Lol. I am up here for work and could stay anywhere. But for the price and convenience, it can't be beat. The staff is great and very helpful. The rooms are clean. The room is very functional with an area...\n\n\nMore", u'Anytime for business that I am in the Pittsburgh area I stay at the Red Roof Inn. I do enjoy the bedding, the availability of channels on the TV, and the bathrooms. For the price, it is more than worth it.\nI also enjoy the staff at the hotel. While there, I have met an Ava, Carolyn, and a Sharon....\n\n\nMore'], 'title': u'Red Roof PLUS+ Pittsburgh South Airport Hotel'}
{'rating_string': u'4.5', 'review_count': u'363', 'address': u'1320 Centre Ave, Pittsburgh, PA 15219', 'review_list': [u"After being given a list of hotels to choose from for my son's hockey tournament - Three Rivers Cup, I selected Cambria Suites. From the moment I was put in contact with Sharon, she took great care of us! Our team had tickets to the Penguins game so it was super convenient to walk right next door to the arena....\n\n\nMore", u"I've seen other reviews that might be low and I must say that the staff must have had an off day because everyone we came in contact with was great.\nRight off the bat though are my few complaints:\n1. Small breakfast buffet is 12 bucks when most places now offer it free. I am big on Hamptons for doing...\n\n\nMore", u'Stayed for Garth Brooks concert, it was an easy check-in even though the place was swamped with fans. Very friendly man at the front desk as well as outside when we pulled up to the parking area. When we arrived both elevators were working, then one went down but it was repaired before the evening was over. Very clean and...\n\n\nMore', u"Very disappointed in our stay. We came for a Garth concert. We just needed to check in, go to concert, go to bed, check out. What could happen, right? In our very short stay, here was our experience:\n--the person at the front desk was THE rudest service employee I've ever encountered. She was surly to the person in front...\n\n\nMore", u"Stayed here on a weekend getaway with the wife. The price was alright, and they had a hot tub. That's all we were looking for.\nKnowing what I know now, I don't think I would stay again unless I was coming to Pittsburgh for a Penguins game. The room was cozy, and the front desk staff was exceptional.\nThat being...\n\n\nMore", u"The rooms at the Cambria Suites are a perfect size and the bathrooms/showers are great. If you're going to anything at Consol, stay here. The walk is easy, but the hotel is even better. Even if there is a better deal elsewhere, it is worth the money. Solid pool/hot tub and a workout room that will do the trick for...\n\n\nMore", u'We stayed at the Cambria to see Bob Seger concert at Consol Energy Center very convenient, staff very friendly and helpful. Rooms were large, very clean and quiet. The bar and restaurant were good. It was nice we never had to leave the hotel except to see the concert. If you go to event at the Consol this is the...\n\n\nMore', u'Having seen the recommendation of a friend, and given its location adjacent the Consol Energy Center, I was willing to go outside of all my loyalty programs and try out a Cambria Suites. The rooms are top notch, the exercise/pool/hot tub areas are very nice too, and although I never needed to use them, the eating and bar area seemed...\n\n\nMore', u"The Cambria was the hotel my husband and I chose for our first Consol event. The room is nicely laid out, well appointed, clean and quiet. The convenience to Consol can't be beat and is well located for exploring the city. The staff is friendly and very helpful. I had stayed here before which impressed me and after this recent...\n\n\nMore", u"My wife and I make a trip north to watch a Penguins game and when we do, our hotel of choice is always Cambria Suites. You can't beat the convenience to the arena (right next door) and there is a Subway and TGIFridays around the corner from the hotel, offering good food at the right price. Our suite this time...\n\n\nMore"], 'title': u'Cambria Suites at Consol Energy Center Hotel, Pittsburgh'}
{'rating_string': u'5.0', 'review_count': u'34', 'address': u'620 William Penn Place, Pittsburgh, PA 15219', 'review_list': [u'We came to Pittsburgh from Los Angeles for a surgery my mom was having at UPMC Shadyside. My parents wanted to spend a few days somewhere nicer to have a little break before the operation and could not have picked a better place. From the moment we got to the Monaco, the experience could NOT have been better. They were...\n\n\nMore', u'Had a fabulous two night stay at this new hotel. Was going to stay at the Fairmont but there was a big price difference between Fairmont and Monaco so I went with the advice of another Trip Adviser reviewer and went for Monaco. So happy with our choice! I called last minute from the airport and the concierge immediately got...\n\n\nMore', u"comfortable, roomy, newer, convenient, and the team responded to requests and needs very well before and during the visit! Spent 2 nights in a corner room, and have nothing to complain or warn about. The restaurant in the basement, The Commoner, was delicious, service was very good for breakfast and in the evenings for drinks. It's quite a hopping scene...\n\n\nMore", u"My husband and I visited the Hotel Monaco Pittsburgh over the weekend for a belated celebration of my birthday. I can't say enough how much the staff did to make our stay absolutely special. We stayed in the most gorgeous suite that I would describe as luxuriously quirky. The design made a special nod to the Steelers with the use...\n\n\nMore", u'This is definitely our new place to stay in downtown Pittsburgh. The decor is absolutely beautiful. The bed was extremely comfortable. It is located right by William Penn. I would highly recommend a stay here! The room service menu is expensive, they even have options for your favorite pooch. Extremely unique!', u'What a cool place! Came here for 2 nights for business, and had a fantastic stay. Convenient to the restaurants and clients I wanted to see, valet, great art-deco rooms this place had it all.Had a breakfast meeting in the restaura nt and dinner at the bar. VERY GOOD FOOD!!', u"This is a wonderful addition to Downtown Pittsburgh and an adorable boutique hotel. Upon entering you are greeted by the valet, the doorman helps you with your luggage and the front desk immediately say hello and welcome you to the Hotel Monaco. There's some refreshing fruit water and a bicycle available to borrow in order to help you get around...\n\n\nMore", u'We had an extended stay at the new Monaco Hotel in Pittsburgh (17 nights) to celebrate a wedding anniversary and my husbands birthday.The hotel itself is a beautiful building with first class facilities in all the rooms. We initially booked into a King Corner Room but were upgraded to a King Spa Room after a small problem with our electronic...\n\n\nMore', u'We stayed here last week just one night and I have to say I think this was my favorite Kimpton hotel yet, and I have stayed in several. The staff was very helpful and friendly, the location was great and the rooms were very nice. The Commoner the restaurant downstairs was wonderful for lunch and dinner and drinks too!', u'My son and daughter in law was the first wedding held at Hotel Monaco the weekend of 2/27-2/28. The experience was exceptional. From the moment we stepped foot into the lobby, every single staff member was engaged and accommodating. The decor was funky and edgy -- perfectly suited the personality of my son and his wife. The beds were a...\n\n\nMore'], 'title': u'Hotel Monaco Pittsburgh'}
{'rating_string': u'4.0', 'review_count': u'975', 'address': u'100 Lytton Avenue, Pittsburgh, PA 15213', 'review_list': [u'A very difficult trip for us, as we were at the last stage of visiting Pittsburgh to finalize all estate details since our mom passed. We were incredibly grateful for the personalized service , from the front desk with Stacey , to the concierge floor staff, Leslie and Cynthia. We loved the concierge lounge ( except the lounge furniture could...\n\n\nMore', u'The place is nice, and clean. Housekeeping was so nice, and worked so hard! The people at the front desk were rude, but the bartender at night was amazing! I would come back to chat with him! Waited for food in the grill for an hour one morning but the manager was kind and comped us. All and all it...\n\n\nMore', u"The hotel itself is nothing special--not the newest, and rooms are fairly small. But the staff is ok, and more importantly, the location is very good--it's safer than South Oakland, and very convenient for coming home from any of the other areas of Pittsburgh.", u'Although the hotel itself is a mid-range hotel, the staff are remarkable. From the front desk to the housekeeping staff to the chef/manager (thank you Tom!) they were all friendly, supportive and professional. The free shuttle is a huge bonus and the kind drivers took us to appointments and even to great restaurants in the area. The savings from not...\n\n\nMore', u'The front desk staff, especially Stacey & Jenna, were extremely friendly, helpful & accommodating. I came to Pitt because my son was in an accident and they did everything possible to make my stay easier.', u'This Wyndham Hotel was very convenient for an appointment we had at the University Center, which was only 20 steps across a narrow street. When our appt ran a little longer than we thought (3 hrs), the front desk was very considerate in allowing us to check out later. The room was clean and comfortable (except for foam pillows) and...\n\n\nMore', u"Affordable, comfortable, good beds, nice rooms, hot water, spacious bathrooms, great breakfast, right near everything on Pitt's campus and surrounding attractions."], 'title': u'Wyndham Pittsburgh University Center Hotel'}
{'rating_string': u'4.0', 'review_count': u'401', 'address': u'3454 Forbes Avenue, Pittsburgh, PA 15213 (Formerly Wyndham Pittsburgh University Place)', 'review_list': [u'From the moment I checked in to the moment I picked up my car from the valet for the final time, everyone went out of their way to be kind and helpful. I was checked in early, readily accommodated for a late lunch (10 minutes before dining room closed - and everyone indicated it would not be a problem -...\n\n\nMore', u'This hotel is a fantastic place to stay when taking a trip to Pittsburgh. It has great service. The staff are friendly and helpful. It is also located near several points of interest. There is a lot of offer in Pittsburgh and whether you decide to go out or stay in, the Hilton provides the quality and resources needed to...\n\n\nMore', u'I have now been here twice and it is fantastic. You get more than what you expect for the price and the location is fantastic. The staff are very nice and any minor problem you have they are more than happy to help you.', u"I'm writing this review at 6am from the most uncomfortable bed I've ever been in. I've been tossing and turning all night. The bed is rock hard and is angled from side to side (room 413). I'm tempted to go sleep in my car.\n-There is no actual glasses in the room, everything was paper cups. Not a big deal,...\n\n\nMore", u'We have been traveling to Pittsburgh for the last 10 years. This was one of our best experiences. Great service and friendly staff. Helpful from the time we walked in the door. Right away they offered the free shuttle to the concert we were attending and the staff all around were excellent. From the valet parking attendants, to the front...\n\n\nMore', u"Stayed for a weekend to catch up with my daughter who goes to Pitt. It's the perfect location. We had a great experience with everyone we came in contact with! The coffee and hot chocolate were much appreciated every time we walked through the lobby!", u'Too Much to say and only 200 words to do it. Find another location if possible starting with a nearby Hampton as my recommendation. Beds needed upgrade immediately. Parking on street or valet - no other choices. Will say the person that checked me out was very helpful and caring. Only good part of the stay.', u"We've stayed at this hotel numerous times and this stay was the worst to date. Bathrooms need a good steam cleaning with fans to be made operational. Drapes in room were stained and soiled, unacceptable. One elevator was out of order upon checkout time, so we took the steps from the 5th floor. Could not control heating unit the morning...\n\n\nMore", u'The staff was very nice, but the hotel rooms have a tired feel. The beds are hard and uncomfortable-- a mattress on a piece of wood which makes noise when you move on it. Our room was on sixth floor was a bit tight with two queen beds. The hotel is close to Pitt.', u'Hilton Garden Inn on Forbes Avenue is close to everything! It is an easy walk to University of Pittsburgh, Medical Centers (2), Carnegie Museum (1 mile), plus Carnegie Mellon University. A wonderful hotel that has great staff, comfortable (but smaller) rooms, good breakfast in their restaurant. Many restaurants in walking distance from sports bars, grills, to nicer dining. Add a...\n\n\nMore'], 'title': u'Hilton Garden Inn Pittsburgh University Place Hotel'}
{'rating_string': u'4.5', 'review_count': u'244', 'address': u'134 Bakery Square Blvd, Pittsburgh, PA 15206', 'review_list': [u'Newly renovated rooms with separate shower & toilet & walk-in closet, separate desk-dresser/sofa entry area - clever and with such comfortable beds - a winner! What we enjoyed was how breakfast offered fresh blanched spinach with salsa as options to accompany scrambled eggs & 2 selections of sausages and all the others usual cereal & hot oat options. Convenient parking...\n\n\nMore', u'Here for a college tour and loved that the hotel had a van that would take you short distances. Did not have to rent a car and drive in the winter weather. Rooms are very nice, large in size and offer a seating area to spread out. Breakfast was adequate. Overall I would recommend!', u"Stayed there for a nice on a business trip, great location, close to hospital and local restaurants/gyms. Good breakfast, quiet rooms. Had problems with airport shuttle, my shuttle driver Joanna and front desk concierge Shawnie were awesome! They helped me get my luggage on the airport shuttle and on my way just in time! If I'm back in town will...\n\n\nMore", u"I had the chance to stay here last weekend. It's a really nice newer SpringHill Suites. The location is great. Super close to trader joes and restaurants. I love the access to LA Fitness. A very nice little getaway!", u"We used this hotel to accommodate out of town guests for my son's wedding. They gave us a nice group discount and were very helpful and thorough in communication and follow-through. The hotel itself was lovely with spacious rooms and also provided a nice breakfast. Lauren Marchitelli was our co\xf6rdinator and provided excellent service throughout, thank you!", u'This hotel was a great choice for our family getaway to Pittsburgh. We had a car, so getting about town was easy. Parking is $15 per day, on top of room costs. Clean, modern, spacious - everything you need for a comfortable stay. Breakfast was included and was very good - fresh food, lots of variety, some hot choices. Beds...\n\n\nMore', u'I stayed at the SpringHill Suites Pittsburgh Bakery Square with my six year old son for his first Pittsburgh Pirates game and then a next day trip to Idlewild Park.\nI stayed at this hotel using a free Marriott reward night, otherwise, I would have stayed closer to downtown. The hotel is located a few miles outside of downtown Pittsburgh,...\n\n\nMore', u"Newer hotel. Best way to explain the room...you feel like you're in an IKEA demo room. if you've been to IKEA you know what I mean. Clean, modern sinks, showers, faucets. Pocket doors offer greater room space. Room has the toilet & additional sink located separate from shower/large sink. Highly recommend!", u'Loved my stay at this new and modern hotel in Pittsburgh. Excellent location in a new development. Room was very spacious with large screen TV, refrigerator and microwave and a very nice work area at the desk. The buffet breakfast was outstanding. My only complaint and the reason I do not give them the 5 stars is that the overnight...\n\n\nMore', u'Ryan, BIG THANK YOU for your time and service! Thank you for taking the time to talk to me and to reps at Marriott Rewards! We will definitely be making future reservations there. Thank You again for your service!'], 'title': u'SpringHill Suites Pittsburgh Bakery Square Hotel'}
{'rating_string': u'4.0', 'review_count': u'53', 'address': u'875 Greentree Road, Pittsburgh, PA 15220 (Formerly BEST WESTERN Parkway Center Inn)', 'review_list': [u"This was my first time to Pitt to see the Penguins play and if I come back , this is the place to stay . From the outside ,it's not fancy but trust me on this hotel , if it wasn't for them, our trip wouldn't have been as good as it was. Our shuttle drivers Greg Gabe and Paul...\n\n\nMore", u'The weekend stay was very nice. The staff was very professional and welcomed us. We had a problem with hot water in our shower and the problem was addressed in a timely matter. Our breakfasts were great and the staff worked very hard to keep the foods available and warm.', u'Unlike some of the previous reviewers, we had a perfect experience at this hotel. Our philosophy is to save money where we can so we can take use the saved money for more trips. That means we are not looking for the "absolutely best" rated hotel in Pittsburgh, we are looking for "value" hotels. For us, this hotel is an...\n\n\nMore', u"The hotel itself isn't far from downtown. You can save a bit and stay here. Be warned though, there isn't too much close by, at least not in walking distance. The front desk staff is great. Colleen was very accommodating and offered us the chance to get into the room an hour before check in and gave us a room...\n\n\nMore", u'The hotel lobby is very nice not what you typically see from a H.I. express. The hotel has a nice indoor pool and fitness center. The free breakfast in the morning was delicious.The room was a little small but nice. The bed was very comfortable. The only complaint I have is the thermostat had a hard time regulating the heat....\n\n\nMore', u'This hotel and the staff are GREAT!!! The hotel has wonderful amenities, pool, breakfast and workout room! The staff was incredibly helpful! We wenter for a concert and they provided shuttle service! Highly recommend for you next weekend stay in Pittsburg!!!!', u'Jasmine and Eva were very helpful when we arrived. Gave us restaurant recommendations in the area, and were extremely personable. The room was nice and clean, and the bed was comfortable. Will stay here again when back in the area.', u'Staff very helpful. We booked for Steelers game. Used the shuttle service to downtown. A good brisk 20 minute walk to the stadium from where they drop you off. Room was spacious and clean. No premium channels on tv. Would of expected it for the price we paid for the room. Did not eat the breakfast because it was hot...\n\n\nMore', u"I booked a reservation because I love IHG and I'm a platinum member. After driving for 5 hours I get to the hotel and I go to check in. I only have a prepaid credit card so I only have enough for the room on my card. The front desk attendant said that I needed the amount for the room...\n\n\nMore", u'I recently stayed here for 3 days. I landed at the airport at 2pm thursday and called for a pick up. I reached the hotel and checked in. The lobby is comfortable and clean. My room was very nice and quiet. There isnt much in the area. I walked to the Giant Eagle nearby and loaded my fridge with my...\n\n\nMore'], 'title': u'Holiday Inn Express Hotel & Suites Pittsburgh West'}
{'rating_string': u'4.5', 'review_count': u'17', 'address': u'401 Holiday Drive, Pittsburgh, PA 15220 (Formerly Clarion Hotel & Conference Center)', 'review_list': [u'I stayed at the Crowne Plaza for a business trip in March and was very impressed. Upon walking in the hotel lobby is modern and spacious with a cozy feel. A business lounge, bar, and neat work space were present. After a speedy and simple check-in with Janel, I proceeded to the room which was clean and tidy. There was...\n\n\nMore', u'I came here for happy hour after work because it was being advertised in Foster Plaza. I must say the food was excellent and the bartender Will was so friendly and attentive, so that was a huge plus in my book. The decor was beautiful and you can immediately tell that the hotel is brand new. The only complaint I...\n\n\nMore', u"Came to this hotel because of a convention in the hotel. The check in was quick and easy. Staff great!!! Food at the bar/lounge outstanding (recommend shrimp flat) I can't say enough about this hotel!!! I know a review said the hotel wasn't complete but the place is beautiful. If my travels take me back to Pittsburgh I'll stay here...\n\n\nMore", u'Hotel was to be completed. When we stayed here there were light fixtures hanging off the walls. the elevators only worked sporadically. There was no heat in the lobby. The rooms were in disarray. We used Expedia and they lied and said the hotel was done. they alsi charge 35.00 dollars more per night than the hotel was charging. Overall...\n\n\nMore', u"First thing I liked about the hotel is the front lobby. The front desk person was very helpful and attentive to my requests. The room was very clean and comfortable. I would definitely recommend people to stay because it's close to the city without city prices. The restaurant staff was very accommodating as I have a gluten allergy. They were...\n\n\nMore", u"The hotel is situated perfectly for someone flying in to Pittsburgh. I was able to get downtown pretty easily and since there was a keurig in the room I didn't have to stop for coffee. Restaurant and bar was also beautiful and the food was great.", u"This hotel was evidently a run down Clarion previously. Crowne Plaza has taken it over and renovated it, but it's still nothing special.\nPROS:\nNice lobby\nFree fast wifi\nVery small sundry store on site\nRestaurant on site\nDecent towels\nClose to shopping, dining\nDecent sized rooms\nGood channel selection on television\nVery pleasant staff - good customer service\nVery...\n\n\nMore", u"We stayed at the Crowne Plaza Green Tree in early February.\nThe hotel was recently remodeled and it looked great. The hotel had a nice lobby, lounge area and updated rooms/bathrooms. Just looking at the pictures of this property as a different hotel chain, you can't help but see how much the renovations changed the hotel for the better.\nThe...\n\n\nMore", u'Right off the park way, beautiful hotel, staff is great, breakfast staff attentive, comfortable rooms and easy access. What more could a person want? We were going to a concert - this place is with in 15 minutes of Heinz Hall - but out far enough that you have no issues with parking the car. Quiet area, little to no...\n\n\nMore', u"I recently stayed at the Crowne Plaza on a Sunday and Monday nights. The rooms are being renovated, but I heard no construction noises. My room was very nice. The king size bed was one of the most comfortable hotel beds I've ever had.\nBreakfast is not included, but since most free hotel breakfasts essentially rot, this is no big...\n\n\nMore"], 'title': u'Crowne Plaza Pittsburgh West - Green Tree Hotel'}
{'rating_string': u'4.0', 'review_count': u'168', 'address': u'5311 Campbells Run Road, Pittsburgh, PA 15205 (Formerly Country Inn)', 'review_list': [u"I had a great stay here before getting picked up by my camp manager for my summer camp experience! They picked me up from the airport and they were so easy to deal with. Free wifi was very fast, unfortunately the pool area etc was under construction but that wasn't an issue. They drove me everywhere from the mall to...\n\n\nMore", u"I never stay at this hotel. I usually stay at the Courtyard Marriott just down the street. I just thought I'd give it a try for a change of scenery. Huge mistake. It was a nightmare from the start. I told the front desk to set me up a rewards account. It didn't get done. The points went to someone...\n\n\nMore", u"This place is a little harder to get to, but it is centrally located to a lot of restaurants and stores. I didn't have a reservation due to a snafu at corporate, but they had plenty of rooms. I found out why after I asked how much a room would cost. It was over 150 a night. Luckily, a local...\n\n\nMore", u'Nice place, close to the airport, easy to get to, friendly staff, clean and comfortable. The only drawback for a business traveler is the lack of restaurants within safe walking distance. Nice courtyard with a pool and some rooms overlooking the courtyard have balconies.', u'This hotel has been recently renovated and is looking very nice. They are being converted to a "green" hotel by installing solar panels on the roof. The front desk staff was exceptional and my room was upgraded to a suite which was very nice. The colors are new and exciting, the carpet is plush and mostly everything has that new...\n\n\nMore', u'Stayed here for the night on my way to DC. Nice hotel, recently renovated and in a nice area, plenty of restaurants and attractions near by. The front staff was friendly and helpful. My shower was the only downside to the stay, it had a small leak. But since it was for one night only not an issue.', u'This hotel is located close to the Pittsburgh airport. However, "close" in this case, is relative. I had never been to the Pittsburgh airport before, and it seems that no hotels are closer than about 15 minutes. At any rate, this is a recently renovated property, and it\'s close to several national chain restaurants, e.g. PF Chang\'s. If you\'re looking...\n\n\nMore', u'I booked a room here because it was closer to the airport and I had to relocate from a shabbier motel on the south west end of town. I booked a room for two nights at the check in counter after checking rates on line. Everything was as I expected of the Holiday Inn line. However when I got my...\n\n\nMore', u'The renovations are just about done and look great. The room was big and clean and the staff was super. Van took us to restaurants and back. Fitness room is terrific and BIG with weight machines and plenty of cardio. Location is very convenient and not far from airport or downtown. What', u"we visited right in the middle of renovations. The old front lobby was being pulled down and rooms being remodelled, we thought the hotel was closed when we pulled up out the front. Our room was in the newly renovated section and the decor was 'interesting' Dark brown long pile carpet and only 2 low light globes in the room....\n\n\nMore"], 'title': u'Holiday Inn Express Hotel & Suites Pittsburgh Airport'}
{'rating_string': u'4.0', 'review_count': u'210', 'address': u'5850 Grand Avenue, Pittsburgh, PA 15225', 'review_list': [u"Very clean and nice hotel. We were in and around Pittsburgh and didn't want to stay in the city so we didn't have to deal with rush hour traffic. We found the Fairfield Neville Island to be a great location, and very nice motel. The rooms were very clean, with comfortable beds. The breakfast was adequate with eggs, sausage, waffles,...\n\n\nMore", u'this is the nearest hotel to my location and I think the only hotel on Neville Island. I experienced a nice stay. Room was quiet, bed was good. Bathroom was bright. Water was not overly softened. Breakfast was nice, person in charge said good morning and was nice. One of the only places I have been where Fox news was...\n\n\nMore', u"Our room was nice, quiet, clean, and comfortable. The people were friendly and made us feel welcome. The breakfast was good. We had a nice view of the Ohio River out our window, and a tree with a bird's nest! Nice touch! This property was real easy to get to and convenient.", u'This hotel, although in a very industrial area, is very handy to Swickley and Ben Avon, and even downtown Pittsburgh is only 10 miles away. Just off the I-79 bridge over the Ohio River.\nThe hotel is safe, very clean and very upscale for a Fairfield Inn.\nGreat free breakfast, nice pool and exercise area, free Wi-fi and free newspapers....\n\n\nMore', u'It was so neat - especially if get room on the side facing the river. Can watch boats and barges go up and down it. We there there in the fall, so beautiful leaves. Very quiet area for sure. Fire pit, pool. Especially relaxing and great area to enjoy out in back of hotel along river. Do stay there. If...\n\n\nMore', u"Stayed at the property for just one night for my son's game at RMU. Location is very close to RMU, but I felt like I was at a truck stop. There is not much else near by. Check in was easy, but at first no one was at the desk. I had to call around the corner for someone to...\n\n\nMore", u'I stayed here for 2 nights in mid-October. My king-suite was perfectly clean and the layout was well-designed. The second night a throng of tween girls decided to use the second floor hallway as an apparent slumber party location. I was awakened by them around midnight and called the front desk. The representative came and attempted to take care of...\n\n\nMore', u'I recently stayed here for 3 nights with 2 other people. We were immediately impressed with our warm welcome. Our rooms were spotless and the beds extremely comfortable with 4 pillows each!! Breakfast was wonderful with quite a nice selection. Very easy access to the interstate as well. We were able to enjoy the fire pit on our last night...\n\n\nMore', u'On the plus side, we were checked in quickly and very early. The room we had came with a nice view of the bridge. The room was well appointed but our shower leaked onto the bathroom floor so my son had to use all the bath towels to wipe it up. I called at 7am and requested two towels for...\n\n\nMore', u"Stayed here for two nights while we were in town for a hockey weekend (Robert Morris Colonials).\nThe location of this hotel was good as it was right off the highway and only a couple of minutes from the island hockey arena.\nThere isn't much to say about the room other than it was clean and more than adequate for...\n\n\nMore"], 'title': u'Fairfield Inn & Suites Pittsburgh Neville Island Hotel'}
{'rating_string': u'3.5', 'review_count': u'193', 'address': u'3896 Bigelow Boulevard, Pittsburgh, PA 15213', 'review_list': [u'Until they bring this place up to 2005 standards it will only rate an Average.\nPrice is right @ $135 pus tax. Bed was ok, room would not cool down even with AC on all night but was still comfortable. Fitness area was decent, breakfast was fine. Get there before 930 to avoid the crowds.\nIt was a decent value...\n\n\nMore', u'Stayed for a business meeting in the area. Suite was roomy. Shower had great temperature and water pressure. The breakfast was very good. The staff was pleasant and accommodating. Parking very convenient.', u'This was a great experience for traveling with a dog. They have a winding path in the back for walking your pet. The kitchen is very workable. This made it very easy for me to visit with friends and family as I have deadly food allergies and it is very tiresome dealing with eating out. We did eat out as...\n\n\nMore', u'Had an early morning tour at Chatham and Pitt and this was very convenient to both. Parking in garage. Rooms have kitchen and living area seperated from bedroom and bathroom. Rooms are clean. Furniture seemed a little worn but would be great to have so much space for an extended stay! Breakfast was very good also?', u'This is a solid Marriott property. Our 1 BR suite was large with a door separating the bedroom from the living area. Free breakfast was better than most. The staff was helpful and friendly.\nThe weather was too cold to enjoy our breakfast in the the lovely outdoor seating area. A great place in warmer months to read and drink...\n\n\nMore', u'We recently stayed at the Residence Inn for a week after a procedure at Magee Hospital. While not right next to University area & hospitals, this is close enough and just a little away from the madness. Staff is very helpful & hotel is clean. Breakfast is good & solid wifi. Walking distance dinner will have to be from the...\n\n\nMore', u"For some reason I thought this hotel was by UPMC near the Petersen Center. I am getting more familiar with Pittsburgh as my son is in his sophomore year. My GPS wasn't working so I called the hotel for directions. The front desk helped for a bit and gave my call to a woman working with him. She could not...\n\n\nMore", u'We recently stayed at the Residence Inn while visiting Pittsburgh for the weekend. Being a Marriott gold member we used points to reserve two adjoining rooms which the staff was very nice about accommodating. Rooms are good sized, and the free breakfast is great so what was the issue? Our room (214) had a whistle is one of the ventilation...\n\n\nMore', u'Recently stayed at this Residence Inn in Pittsburgh. Best hot breakfast ever in a hotel chain! Hot foods included sausage, eggs, home fries; had 2 waffle-makers, juices, cereals, yogurt, hot beverages with to-go cups. The staff were constantly refilling items and checking on the guests, and the manager walked through each morning to seek comments. Oh, and they had free...\n\n\nMore', u"I couldn't quite decide on a 3 or 4 rating - 3.5 would be more accurate. It is reasonably priced and of comparable quality to similar hotels. We were there to spend the weekend with friends and knew we wouldn't be in the room very much. The room was clean and spacious - nice kitchen area, sitting area and separate...\n\n\nMore"], 'title': u'Residence Inn Pittsburgh University/Medical Center Hotel'}
{'rating_string': u'4.0', 'review_count': u'454', 'address': u'3315 Hamlet St., Pittsburgh, PA 15213', 'review_list': [u'The hotel is absolutely great with many options for room sizes and styles with convenient rates. There is free wifi, and a continental style breakfast free for all guests. The hotel provides a free shuttle service which will drop you anywhere within a 3 mile radius of the hotel. The shuttle driver, Rick, was absolutely outstanding in his hospitality, and...\n\n\nMore', u"We stayed here For two weeks after surgery. Very clean. Great location my only complaint is the breakfast. Didn't have many options and nothing for anyone that needs to eat gluten free. And the elevator is always freezing. Staff is great", u'Friendly staff. Excellent shuttle service! Free breakfast. Convenient parking!!! Convenient to many top Pittsburgh locations. They even provide a paper to you in the morning! I would recommend staying there anytime. We have stayed there many times', u"Never stayed at a Hampton Inn before. I was pleasantly surprised by the quality of the room, breakfast, and staff. Will definately stay with Hampton Inn again (in fact, I did the next night). That's all I want to say but I need a minimum of 200 characters before I can submit the survey so I will just keep typing...\n\n\nMore", u'We were attending a sports event at the Univ. of Pittsburgh so this was well located for us. There was a free shuttle and the driver, Rick, was awesome. He was always available and prompt in picking us up when we called. He gave us good information about the area we were in. The ladies at the front desk, Shanna...\n\n\nMore', u'Great staff, very helpful. One particularly outstanding person is Rick, who drives the shuttle service. Really the level of service he provided was so accomodating, it was almost more like a free taxi service, getting me exactly where I wanted to go exactly when I wanted to get there... plus a really friendly conversationalist as well.', u'This hotel is very conveniently located downtown and close to several of the local hospitals. A hot breakfast and friendly staff make this hotel a pleasure to stay at. The rooms are quite comfortable and the hotel was very clean.', u'This Hampton was wonderful. We checked in around 5pm with Stacy and Shauna at the desk and they were a pleasure. They are friendly and just seemed to enjoy what they do. They reviewed all information with us about the hotel (breakfast, check out, free shuttle, parking, etc). They recommended a few options for dinner and even gave us a...\n\n\nMore', u"Hampton Hotels just never disappoint...this was yet another in a string of Hampton stays that was wonderful. Great beds, great rooms, great amenities (especially for the price!)...you just can't go wrong. Thanks so much!", u'Older property but well maintained and clean. Staff was very nice and accommodating. Located very close to medical centers in Oakland, just minutes from hospitals. They do take small pets which they charge extra for to cover the cost of extra room cleaning.'], 'title': u'Hampton Inn Pittsburgh University/Medical Center Hotel'}
{'rating_string': u'3.5', 'review_count': u'177', 'address': u'180 Gamma Drive, Pittsburgh, PA 15238 (Formerly Holiday Inn Pittsburgh - Allegheny Valley / RIDC Park)', 'review_list': [u'Stay here frequently - Clean rooms reasonably priced and a great restaurant on site which make this place really convenient. They have done a nice job of updating this hotel. Try the Ahi Tuna and great selection of drinks at Joes. Great service! Look for separate rating on Joe it will be a five star for convenience, food and service...\n\n\nMore', u'I was in town for business working with Giant Eagle - which made this location perfect (offices are just across the highway). The room was clean and your typical Comfort Inn type. I was facing the highway, which is a bit noisy - you can easily hear the traffic throughout the day/night. I would recommend getting a room on the...\n\n\nMore', u'We had a king bed in our room, very comrfortable. The room was clean, nice bathroom. Quiet, so we got a great nights sleep. The complimentary breakfast had something for everyone and was very good. Easy access to RT. 28 made it a quick trip into the downtown area.', u'I stayed at this establishment on Friday, February 12, 2015. Checked in and out with no issues. Returned home and noted that I was charged for 2 nights. After much run-a-round, I was told that I had reserved on-line for the 11th. I did not leave Ohio until the morning of the 12th. I tried to be courteous and resolve...\n\n\nMore', u'I had a queen room with the couch and chair. Nice touch.\nThe bed was great as I was in a stressful work project and sleep was important. The room was exceptionally clean. Liked the microwave and fridge as well.\nThe staff were really nice and the breakfast was decent.\nEasy to find and great access from PA rt. 28.', u'We stayed in a king room. The room was clean and very comfortable. It was nice having a fridge and microwave.We traveled with another couple, and had adjoining rooms with a connecting door. Although we did not use it, the pool area looked very inviting. The staff was friendly and helpful. Very nice breakfast, ham and eggs one day, bacon...\n\n\nMore', u"Located right off the interstate in an industrial park. Quiet area with only one restaurant about a block down the street (Max & Erma's) although there is a restaurant/bar in the hotel which is on the pricier side. You can get on the interstate and find malls and food places 2 - 5 miles away. Staff was helpful. Rooms are...\n\n\nMore", u'The staff was very nice. The rooms were above and beyond clean. We really enjoyed the smell in the room. Not your average hotel. Breakfast was good too with hot items. Would highly recommend to everyone.', u'We stay here every January as it is convenient to the events we are in town for. The staff are always super nice and friendly... And helpful! The rooms are clean and comfortable! The breakfasts are delicious!', u"My husband and I stayed here for Thanksgiving 2014. We booked and paid in advance for 2 nights. Since we were driving in from the East coast, we got stuck in the snow storm and we couldn't make it for the first night. The hotel was accommodating and not only held our reservation but also allowed us to move our...\n\n\nMore"], 'title': u'Comfort Inn & Suites Pittsburgh Allegheny Valley Hotel'}
{'rating_string': u'4.0', 'review_count': u'53', 'address': u'875 Greentree Road, Pittsburgh, PA 15220 (Formerly BEST WESTERN Parkway Center Inn)', 'review_list': [u"This was my first time to Pitt to see the Penguins play and if I come back , this is the place to stay . From the outside ,it's not fancy but trust me on this hotel , if it wasn't for them, our trip wouldn't have been as good as it was. Our shuttle drivers Greg Gabe and Paul...\n\n\nMore", u'The weekend stay was very nice. The staff was very professional and welcomed us. We had a problem with hot water in our shower and the problem was addressed in a timely matter. Our breakfasts were great and the staff worked very hard to keep the foods available and warm.', u'Unlike some of the previous reviewers, we had a perfect experience at this hotel. Our philosophy is to save money where we can so we can take use the saved money for more trips. That means we are not looking for the "absolutely best" rated hotel in Pittsburgh, we are looking for "value" hotels. For us, this hotel is an...\n\n\nMore', u"The hotel itself isn't far from downtown. You can save a bit and stay here. Be warned though, there isn't too much close by, at least not in walking distance. The front desk staff is great. Colleen was very accommodating and offered us the chance to get into the room an hour before check in and gave us a room...\n\n\nMore", u'The hotel lobby is very nice not what you typically see from a H.I. express. The hotel has a nice indoor pool and fitness center. The free breakfast in the morning was delicious.The room was a little small but nice. The bed was very comfortable. The only complaint I have is the thermostat had a hard time regulating the heat....\n\n\nMore', u'This hotel and the staff are GREAT!!! The hotel has wonderful amenities, pool, breakfast and workout room! The staff was incredibly helpful! We wenter for a concert and they provided shuttle service! Highly recommend for you next weekend stay in Pittsburg!!!!', u'Jasmine and Eva were very helpful when we arrived. Gave us restaurant recommendations in the area, and were extremely personable. The room was nice and clean, and the bed was comfortable. Will stay here again when back in the area.', u'Staff very helpful. We booked for Steelers game. Used the shuttle service to downtown. A good brisk 20 minute walk to the stadium from where they drop you off. Room was spacious and clean. No premium channels on tv. Would of expected it for the price we paid for the room. Did not eat the breakfast because it was hot...\n\n\nMore', u"I booked a reservation because I love IHG and I'm a platinum member. After driving for 5 hours I get to the hotel and I go to check in. I only have a prepaid credit card so I only have enough for the room on my card. The front desk attendant said that I needed the amount for the room...\n\n\nMore", u'I recently stayed here for 3 days. I landed at the airport at 2pm thursday and called for a pick up. I reached the hotel and checked in. The lobby is comfortable and clean. My room was very nice and quiet. There isnt much in the area. I walked to the Giant Eagle nearby and loaded my fridge with my...\n\n\nMore'], 'title': u'Holiday Inn Express Hotel & Suites Pittsburgh West'}
{'rating_string': u'4.0', 'review_count': u'58', 'address': u'4607 McKnight Road, off I-279 Exit 4/McKnight Road, Pittsburgh, PA 15237', 'review_list': [u'Second time staying at this hotel, once this past weekend and once in August of 2013. Both occasions were to attend a concert, one at Consol and the other at First Niagara. This location is about 5 miles from Consol, about a ten minute drive. The median in the middle of McKnight road is definitely an inconvenience, but our navigation...\n\n\nMore', u'Checked in really late at 11pm and left pretty early at 7am. Easy friendly check-in when we got there. Got up to our room quickly. Room was nice and clean, not big but we were just looking for a room to crash. Easy to jump on the highway to get to downtown Pittsburg. Breakfast was standard, but easy to access....\n\n\nMore', u'This is a fairly small Comfort Inn, but is extremely clean, extremely well-run, and thoroughly comfortable. Internet was low-hassle and fast. HVAC was powerful and quiet. Nice plug availability for laptop. Excellent bedding. Breakfast area was clean - food was typical Comfort Inn. The hotel is located in a spot that is a little tricky to get into and out...\n\n\nMore', u'Just to start, I got in at 11 PM or so and left the next morning at 6:30 AM. Given the short time I was there, I basically just slept, so I was unable to really look around the hotel and see any amenities. Since I did sleep well I think that should be a plus, it was quiet and...\n\n\nMore', u'We spent one night here in May 2014 and look forward to returning as we had a lovely experience. It was so clean and fresh that I could breathe easy and so I slept well. My husband enjoyed the complimentary breakfast.', u'Stayed here with my family and two dogs from a Friday to Sunday for a PITT game. Layout of the building is odd but our room was clean and comfortable and no bad smells! (Which I had found is hard to come by). Plenty of grassy areas to walk dogs on lower front side of hotel. Oddly no poop stations...\n\n\nMore', u'When my husband and I visit family and friends in Pittsburgh, the location is perfect. Close to downtown, the strip district, and the University of Pittsburgh. Breakfast was good, too. The staff was friendly and went out of their way to make us feel welcome.', u'This hotel is WONDERFUL!!! the beds are the best and you will have a great nights sleep in a very clean room. Breakfast was surprisingly good,,such a variety unlike other hotel breakfasts. only a short cab ride from the city. Well worth the money. I would stay here again if I come back to Pittsburgh.', u'After the Steelers game and would use this hotel again, check in and out was good. Room was clean, bed comfortable. Free breakfast was above average. All in all good place to stay and would not hesitate staying again', u"It looks rather odd from the outside. The main entrance is on the end of the building and when you walk in, it's rather a very small lobby area. The elevator is as soon as you walk in on the right and makes it rather crowded with other people checking in. The room was smaller than other Comfort Inns, however...\n\n\nMore"], 'title': u'Comfort Inn Hotel, Pittsburgh'}
{'rating_string': u'4.0', 'review_count': u'196', 'address': u'6011 Campbells Run Road, Pittsburgh, PA 15205', 'review_list': [u'I spent one night at the Hyatt and while the rooms were great, the other amenities were lacking. There is only one restaurant with and extremely limited menu, no gift/convenience shop, the one lounge was in the middle of the lobby and did not seem relaxing at all. I was tempted to go back into the airport for coffee. In...\n\n\nMore', u"First impressions mean so much to travelers. A warm greeting, a smile, or small chit chat introduces customers to the establishment. That was missing in this hotel. It seemed as though we were getting in the clerk's way by checking in and having her work. Disappointing.\nThe room itself was fine with a comfortable bed and small bathroom. Remember to...\n\n\nMore", u'Decided to stay here on a whim. Great choice. The receptionist was very nice and helpful during check in. The indoor pool was awesome, very warm. I loved that! The room was nice sized with a couch. Beautiful shower. I wish the bathroom had a little more room to move in it though. I would definitely stay here again. The...\n\n\nMore', u"I love this place! The management has been good to us as we stay here every year for the new year. There has only been one year that they've complained about our large group but granted we are there to celebrate the new year. However they are accommodating and in a prime location. I would recommend this place and we...\n\n\nMore", u"Well we booked this on Hotels.com for 129.00. Anything more than that is probably considered highway robbery. The room wasn't all that impressive. The shower curtain had mold on it and the remote was like flypaper. Would stay again if I had an early flight, but not for anything over that price.", u'The Hyatt Place hotels all look the same, but they offer a reliable mid-segment option. The breakfast with the fresh skillet option is a cut above other concepts in the price segments. Free shuttle to Airport, free WiFi. The food (no room service, has to be picked up downstairs) is reasonably priced and serviceable.', u'no issues, good business hotel. Rooms large and clean. Staff friendly enough. Breakfast pretty basic. Far away from downtown Pittsburgh - around 30 mins by car - but perfect for being near the airport and the businesses around the airport and as far as Canonsburgh.\nThere is Hyatt hotel actually on the airport, that is not this one. This is...\n\n\nMore', u"Stores have sprung up in front of this hotel making it tough to find. Once inside it was a warm welcome with a nice spread for breakfast. Friendly staff! Decent view of the night sky out the window. If you're in the area this place will work fine - conveniently located near plenty of stores and restaurants.", u'very modern, reat hotel to stay at. had nice lounge area where we grabbed pricey but excellent sandwiches. room were outstanding, clean, neatly prepared, with great large bathrooms. the only problem I had was that it costs for parking here, we had a pull trailer so we had to park in the long term airport parking for $13. very nice...\n\n\nMore', u'We found ourselves travelling to greater Pittsburgh for a hockey tournament in October 2014 and requested that we stay at the same hotel as last season. The tournament selects the hotel that each team stays in and we were provided this hotel in October 2013 for a different aged team. When the opportunity came up to travel to Pitsburgh again,...\n\n\nMore'], 'title': u'Hyatt Place Pittsburgh/Airport Hotel'}
{'rating_string': u'4.0', 'review_count': u'188', 'address': u'2950 South Water Street, Pittsburgh, PA 15203', 'review_list': [u"Staff are very friendly and helpful. Walls are a little thin (I can hear some of my neighbor's conversation) but are still better than many hotels I've stayed at. Good size room, and the internet is working fine. As with another reviewer, i'd give it a 5 if it weren't for the train.", u'We spent one night here and paid $195, which we thought was way too expensive. Though it is a new hotel, it has many problems.The beds were uncomfortable. the walls were paper thin and we got to intimately share the parenting next door. There were not enough blankets in the room and we were both cold. The worst part, though,...\n\n\nMore', u"Stayed over 3 nights to go to the hockey's games. They provided a shuttle but be sure to check in with the front desk. It is a courtesy shuttle so it gets busy. Drivers were great be sure to tip them. Hotel is clean and staff was very friendly and helpful.", u'Check in was fast, I asked for a river facing view because I had read on here from other reviewers that the train is very loud on the other side of the hotel. The view was nice, the rooms are spacious and big. I went to the hot tub to relax a little and my eyes started burning which seemed...\n\n\nMore', u"Having to drive from NYC to Pittsburgh on Friday February 27th for my son's interview/audition at Carnegie Melon the following day was stressful as traffic was horrible and we had to leave late day and towards the latter part of the drive the roads wind all around and it was dark and we were exhausted, however, it was such a...\n\n\nMore", u"This hotel is located right between the train tracks and the river. Within a block's distance are bunches of athletic facilities for the Steelers. You can drive back there, but guards won't let you in. The rooms are spacious and clean. We were in a queen double which had a seating/sleeper sofa area with a creative half partition wall. The...\n\n\nMore", u"Stayed while in town for work, and choose this hotel over ones in the past, because it is so close to the fun part of the city. Great staff, great room & clean. Was able to walk to the different bars/restaurants every night, which were close by. If in town for work, or fun and you don't want to worry...\n\n\nMore", u"Loved the hotel, rooms are fairly big and roomy. Sam at the front desk is extremely friendly, absolutely loved him. Shuttle is very nice too. I didn't have to move my vehicle the whole time we stayed. Breakfast is delicious too. Swimming pool and hot tub is very nice too, since it was -32 outside.", u'Nice clean hotel, great staff, walking distance to restaurants and some shops. Nice walking path along river. Trains run during night behind hotel, you hear in all rooms but from what I understand same problem for most hotels along river.', u'I was pleasantly, pleased with my stay here, the service here was very good and all the staff were friendly. It was in an ideal location to get to where we wanted to, and the food and the rooms were brilliant. Just ideal and comfortable enough to get a good nights sleep in, and to eat well. Very accommodating to...\n\n\nMore'], 'title': u'SpringHill Suites Pittsburgh Southside Works Hotel'}
{'rating_string': u'4.0', 'review_count': u'168', 'address': u'5311 Campbells Run Road, Pittsburgh, PA 15205 (Formerly Country Inn)', 'review_list': [u"I had a great stay here before getting picked up by my camp manager for my summer camp experience! They picked me up from the airport and they were so easy to deal with. Free wifi was very fast, unfortunately the pool area etc was under construction but that wasn't an issue. They drove me everywhere from the mall to...\n\n\nMore", u"I never stay at this hotel. I usually stay at the Courtyard Marriott just down the street. I just thought I'd give it a try for a change of scenery. Huge mistake. It was a nightmare from the start. I told the front desk to set me up a rewards account. It didn't get done. The points went to someone...\n\n\nMore", u"This place is a little harder to get to, but it is centrally located to a lot of restaurants and stores. I didn't have a reservation due to a snafu at corporate, but they had plenty of rooms. I found out why after I asked how much a room would cost. It was over 150 a night. Luckily, a local...\n\n\nMore", u'Nice place, close to the airport, easy to get to, friendly staff, clean and comfortable. The only drawback for a business traveler is the lack of restaurants within safe walking distance. Nice courtyard with a pool and some rooms overlooking the courtyard have balconies.', u'This hotel has been recently renovated and is looking very nice. They are being converted to a "green" hotel by installing solar panels on the roof. The front desk staff was exceptional and my room was upgraded to a suite which was very nice. The colors are new and exciting, the carpet is plush and mostly everything has that new...\n\n\nMore', u'Stayed here for the night on my way to DC. Nice hotel, recently renovated and in a nice area, plenty of restaurants and attractions near by. The front staff was friendly and helpful. My shower was the only downside to the stay, it had a small leak. But since it was for one night only not an issue.', u'This hotel is located close to the Pittsburgh airport. However, "close" in this case, is relative. I had never been to the Pittsburgh airport before, and it seems that no hotels are closer than about 15 minutes. At any rate, this is a recently renovated property, and it\'s close to several national chain restaurants, e.g. PF Chang\'s. If you\'re looking...\n\n\nMore', u'I booked a room here because it was closer to the airport and I had to relocate from a shabbier motel on the south west end of town. I booked a room for two nights at the check in counter after checking rates on line. Everything was as I expected of the Holiday Inn line. However when I got my...\n\n\nMore', u'The renovations are just about done and look great. The room was big and clean and the staff was super. Van took us to restaurants and back. Fitness room is terrific and BIG with weight machines and plenty of cardio. Location is very convenient and not far from airport or downtown. What', u"we visited right in the middle of renovations. The old front lobby was being pulled down and rooms being remodelled, we thought the hotel was closed when we pulled up out the front. Our room was in the newly renovated section and the decor was 'interesting' Dark brown long pile carpet and only 2 low light globes in the room....\n\n\nMore"], 'title': u'Holiday Inn Express Hotel & Suites Pittsburgh Airport'}
{'rating_string': u'3.5', 'review_count': u'236', 'address': u'6404 Steubenville Pike, Pittsburgh, PA 15205', 'review_list': [u"Pictures nothing like the internet!\nDusty, stains in toilet, and so small. The heater was so loud, it woke you up every time it came on. We then turned it off.\nWe were told there would be a coffee maker, and there wasn't.\nOur room was at the end of the last building, next to dumpsters.\nCareful driving in parking...\n\n\nMore", u'I had the impression that this was an upgraded Red Roof but only certain rooms are plus and you would pay more. We got a standard room which was renovated but had no coffee maker, no fridge, no hair dryer, no microwave all of which we are used to getting in other hotels for less price. The exterior of the...\n\n\nMore', u"It's been years since we have stayed at a Red Roof [for good reason] BUT we were pleasantly surprised and impressed by this new and improved motel. The rooms were clean and comfortable. The bathroom is very small but the shower is good. The staff is pleasant. Good location for access to Hwy 79. Lots of shopping nearby within walking...\n\n\nMore", u'Although it was a little hard at first to find the access to the hotel because it is set back a little from the road, once we got into our room, it was excellent. The check-in was a breeze and we drove up to our room and unloaded our bags. The beds were very comfortable and our room had a...\n\n\nMore', u'I was only in Pittsburgh for the night due to the weather diverting my flight. A friend talked with Ava at the front desk while I had to be on hold with the airline. My friend booked a room at 5pm on a snowy Saturday at a better rate than I had found online. The room appeared recently renovated, and...\n\n\nMore', u'I recently stayed in the Red Roof Inn in the Robinson Township of Pittsburgh. I thoroughly enjoyed the stay. The Staff were very friendly, The rooms were very clean, The location was great, near restaurants and stores. Over all my stay with them was very enjoyable.', u'This was a very nice hotel. Clean and quiet, with very friendly American staff. Also seemed to be one of the more reasonably priced hotels in the area. Young lady at front desk was very nice, allowed me to print my airline boarding passes on her desk computer. Restaurants nearby, only 15 minutes from airport.', u"Upon checking in the front desk clerk - Phyllis was extremely helpful. I didn't have to ask for my membership perk (only a free bottle of water but you'd be amazed how many other locations don't automatically offer it) I was asking some questions about where I could go to have a bite to eat and watch the Sunday night...\n\n\nMore", u"I have been staying here for the last 4 months for business. Everyday. That should say it all right there. Lol. I am up here for work and could stay anywhere. But for the price and convenience, it can't be beat. The staff is great and very helpful. The rooms are clean. The room is very functional with an area...\n\n\nMore", u'Anytime for business that I am in the Pittsburgh area I stay at the Red Roof Inn. I do enjoy the bedding, the availability of channels on the TV, and the bathrooms. For the price, it is more than worth it.\nI also enjoy the staff at the hotel. While there, I have met an Ava, Carolyn, and a Sharon....\n\n\nMore'], 'title': u'Red Roof PLUS+ Pittsburgh South Airport Hotel'}
{'rating_string': u'3.5', 'review_count': u'193', 'address': u'3896 Bigelow Boulevard, Pittsburgh, PA 15213', 'review_list': [u'Until they bring this place up to 2005 standards it will only rate an Average.\nPrice is right @ $135 pus tax. Bed was ok, room would not cool down even with AC on all night but was still comfortable. Fitness area was decent, breakfast was fine. Get there before 930 to avoid the crowds.\nIt was a decent value...\n\n\nMore', u'Stayed for a business meeting in the area. Suite was roomy. Shower had great temperature and water pressure. The breakfast was very good. The staff was pleasant and accommodating. Parking very convenient.', u'This was a great experience for traveling with a dog. They have a winding path in the back for walking your pet. The kitchen is very workable. This made it very easy for me to visit with friends and family as I have deadly food allergies and it is very tiresome dealing with eating out. We did eat out as...\n\n\nMore', u'Had an early morning tour at Chatham and Pitt and this was very convenient to both. Parking in garage. Rooms have kitchen and living area seperated from bedroom and bathroom. Rooms are clean. Furniture seemed a little worn but would be great to have so much space for an extended stay! Breakfast was very good also?', u'This is a solid Marriott property. Our 1 BR suite was large with a door separating the bedroom from the living area. Free breakfast was better than most. The staff was helpful and friendly.\nThe weather was too cold to enjoy our breakfast in the the lovely outdoor seating area. A great place in warmer months to read and drink...\n\n\nMore', u'We recently stayed at the Residence Inn for a week after a procedure at Magee Hospital. While not right next to University area & hospitals, this is close enough and just a little away from the madness. Staff is very helpful & hotel is clean. Breakfast is good & solid wifi. Walking distance dinner will have to be from the...\n\n\nMore', u"For some reason I thought this hotel was by UPMC near the Petersen Center. I am getting more familiar with Pittsburgh as my son is in his sophomore year. My GPS wasn't working so I called the hotel for directions. The front desk helped for a bit and gave my call to a woman working with him. She could not...\n\n\nMore", u'We recently stayed at the Residence Inn while visiting Pittsburgh for the weekend. Being a Marriott gold member we used points to reserve two adjoining rooms which the staff was very nice about accommodating. Rooms are good sized, and the free breakfast is great so what was the issue? Our room (214) had a whistle is one of the ventilation...\n\n\nMore', u'Recently stayed at this Residence Inn in Pittsburgh. Best hot breakfast ever in a hotel chain! Hot foods included sausage, eggs, home fries; had 2 waffle-makers, juices, cereals, yogurt, hot beverages with to-go cups. The staff were constantly refilling items and checking on the guests, and the manager walked through each morning to seek comments. Oh, and they had free...\n\n\nMore', u"I couldn't quite decide on a 3 or 4 rating - 3.5 would be more accurate. It is reasonably priced and of comparable quality to similar hotels. We were there to spend the weekend with friends and knew we wouldn't be in the room very much. The room was clean and spacious - nice kitchen area, sitting area and separate...\n\n\nMore"], 'title': u'Residence Inn Pittsburgh University/Medical Center Hotel'}
{'rating_string': u'3.5', 'review_count': u'2,332', 'address': u'600 Commonwealth Place, Gateway Ctr, Pittsburgh, PA 15222', 'review_list': [u"Great location! Right near St. Patrick's Day parade route and event in Market Square that I was attending. King Suite was very spacious and had a large bathroom. Both the king bed and the pull-out bed were very comfortable. We were also able to valet park our car hours before check in!! I would definitely stay again!!", u"I chose the Wyndham out of brand loyalty .... I use Wyndham regularly and am even a gold member of there's .... The rom was decent but average .... It felt more like a Ramada or Hampton then A Wyndham ... The bed in my room was broken at check in, the view would have been nice if the windows...\n\n\nMore", u"Great location, clean, and all around nice hotel. My two gripes are that the internet was painfully slow (took me about 5 minutes to get to this page), and there are no high definition channels. They have nice big HD TV's in the room, but with all analog channels. They must be the last hotel in north America to not...\n\n\nMore", u'The hotel is beautiful and the location can\'t be beat. The food was delicious and the bellman was very nice and helpful the entire weekend. The valet was rude and slow each time we parked. We paid for a room with a city view but did not get it. They said we got "the leftovers" because we checked in late....\n\n\nMore', u'With the exception of the lack of hot water during the week. It was warm but definitely not hot when hot was open wide. Other than the staff was great from check in to check out. The room was kept clean and plenty of towels and wash clothes, a hot commodity at other hotels i have stayed at. But the...\n\n\nMore', u"Room appeared to be clean, except for the lipstick kiss marks on the full length mirror that was there when I checked in. Bathroom is very small. Internet was extremely slow and sometimes didn't work at all. I also didn't have good cell reception in my room on the 5th floor.\nBed is comfortable, but walls are paper thin so...\n\n\nMore", u'A business group I belong to has a meeting here once a year. I wish i had a reason to stay more often. This property went through a remodel recently and it shows. The rooms are decent size with nice views of the rivers or downtown (I assume) it seems like i always stay in the rooms facing the rivers....\n\n\nMore', u'The Wyndham Grand is within a 5 to 10 minute walk from everything you would want to see or do downtown as well from as both stadiums. The facility has been upgraded over the past few years as well. The front desk staff are helpful and welcoming. The guys at the main bar are attentive and work hard to make...\n\n\nMore', u"We recently traveled to Pittsburgh for a Penguins game and had a wonderful stay at the Wyndham! We were skeptical at first because we read some horrible reviews, but it ended up being one of the best hotel stays we've ever had! The valet was easy, the staff was friendly, the room was clean and had a spectacular view of...\n\n\nMore", u'Hats off to the staff of the Grand Wyndham- a great place to stay in downtown Pittsburgh- super friendly staff and a special shout out to free shuttle drivers Renee and Tyrone- super nice and informative- thanks for making our hockey trip (2 subway stops from Consol) a memorable one !'], 'title': u'Wyndham Grand Pittsburgh Downtown Hotel'}
{'rating_string': u'3.5', 'review_count': u'67', 'address': u'10 Landings Drive, Pittsburgh, PA 15238', 'review_list': [u'If you are in the area get one of their King Suites as they are large and very nice. They have hard wood floors and a separate space for the bedroom. You finally dont have to eat your meal in bed! Also if you have any problems ask for Judy. She is super nice and extremely helpful. Thanks Judy!', u'I was pleasantly surprised with my stay here. The location is terrific: right off the turnpike entrance and within 5 minutes of my business destination. I was greeted with a warm reception by Sean at the front desk.\nThe room was up-to-date and clean; decent beds with very nice bedding. Wood floors are much cleaner than carpets, and there is...\n\n\nMore', u'For a low to moderately priced hotel in a small suburb of Pittsburgh, I did not expect such a lovely stay. The front desk staff was super friendly when we arrived. The room was surprisingly lovely! Hardwood floors are such a nice modern touch and make everything feel so much cleaner than the usual dingy carpets. The furniture was nice...\n\n\nMore', u"This was your typical excellent Holiday Inn Express. I arrived late at night and was greatly warmly. The room was nice, clean, and very comfortable. It's a tad bit smaller than other Holiday Inn Express rooms, but still plenty of room for two. There was plenty of free parking and it's conveniently located to the Turnpike and several fast food...\n\n\nMore", u"Rainy night...travel weary. Desk manager set us up in a suite ! Morning staff were also very helpful, carrying breakfast food to our room, and extending our checkout time to enable a family visit in our room.\nEasy access to the expressway and modest price ensures we'll choose this motel when we are in Pittsburgh in the future.\nNext time,...\n\n\nMore", u"Not many current choices in the area for hotels. Decent. Decent price. Friend who stayed there said they just didn't have any sidewalks for him to do his morning run. I've used this hotel for a few yrs now. No complaints. Better than what else is around!", u'Needed a comfy place to re energize after a camping trip. Very clean room and bathroom. Super comfortable bed and overall pleasant stay. Front desk was very helpful with wifi passwords and welcoming to guests. Would definitely stay here again.', u'Very impressed with the friendliness of the staff. Breakfast was very good although it was the same every morning. Could have mixed up the menu more. Hotel is convenient to center city and suburbs. Rooms were very clean. This was my second stay at this hotel and I would return again.', u'We enjoyed our stay we were in the town to visit family conveniently located and very nice room we had a suite , as we had our son he slept on sofa bed and said it was comfortable. He also like the ease of connecting to wifi. Will stay here again.', u'We stayed here while passing through on our way home. The desk clerk was very friendly and engaging. The rooms were newly remodeled and very large. There were plenty of plug-ins for our electronics (2 on each lamp) and faux wood floors which I find to be much more sanitary than rugs. I did hear 2 freight trains (several hours...\n\n\nMore'], 'title': u'Holiday Inn Express Pittsburgh-North (Harmarville) Motel'}
{'rating_string': u'3.0', 'review_count': u'177', 'address': u'699 Rodi Road, Pittsburgh, PA 15235', 'review_list': [u'We had to come down to Pittsburgh for Three Nights for Because of a family member having surgery I had stayed at the hotel before many times and though the surgery had to be rescheduled because of weather and we could not make it home because of the weather the stay was great the staff goes above and beyond to...\n\n\nMore', u"This hotel was the closest to a funeral I had to attend in Pittsburgh area. I wasn't expecting it to be so nice. The rooms were a little outdated however they were in the middle of changing all that with a huge remodel. The indoor pool was very nice and all enclosed in glass. The kids really enjoyed that part...\n\n\nMore", u"The front desk was very nice, the pool is huge, the hot tub was warm and our grandson was totally entertained! The room opens to the parking lot which you don't see everyday and it helped to unload stuff on a snowy day. The room is average but we are happy. Haaaa!", u'the worst thing about this hotel is that the wifi never worked, even after trying on and off for over 12 hours. Neither my wife or I could log on to anything or even make a connection. The other bad thing about our room is that starting around 1 am or so the heater began rattling like a dryer full...\n\n\nMore', u"We had stayed here numerous times over the years, starting back when this was still a Harley (Helmsley) property, and still somewhat upscale.\nIt's now a Choice property and under the Comfort Inns line. The building has been updated somewhat and the room finishes are in line with Comfort's standards.The property was first built, I think, in the 70s and...\n\n\nMore", u"Just off the 376, but far enough to have a reasonable noise level. If u ask for a room facing away from the freeway u don't hear it. It's a steep curvy drive up hill from the freeway, but it's Pittsburgh after all. Breakfast was fine, the restaurant is fine too at reasonable prices and serves alcohol (it's Pittsburgh and...\n\n\nMore", u"Chose by past experience with the chain, but this one was definitely substandard. Very difficult to find, and supposedly only handicapped rooms were in a building that was separate from the main one, somewhat isolated.Had a ground floor room, with, believe it or not, sliding glass doors. Great feeling of security... TV didn't work, and a surly maintainence person came,...\n\n\nMore", u"First room broken down , saggy bed with a jet engine for a air conditioner.\nMoved to a junior suite, large bedroom- didn't have a airflow vent, had to keep the door to bedroom open-noisy patrons and ice machine.\nBadly lit entrance to Inn and pool had mold on the underside.\nPrice and convenience to family was the reason to...\n\n\nMore", u'I went to this hotel with my boyfriend and we had a great time. Nice hot tub and pool and I really liked working out in the fitness center. The breakfast was also great and the room was really clean. I would stay there again.', u"We picked this hotel based on proximity to I-376. It is easy to access from both East and West. Entrance well marked, but the drive up to the hotel is long and windy - a bit disconcerting after dark. The layout is a bit odd, but it's built into a hillside. Parking plentiful, cookie on check-in is a nice treat....\n\n\nMore"], 'title': u'Comfort Inn Conference Center Hotel, Pittsburgh'}
{'rating_string': u'3.0', 'review_count': u'78', 'address': u'4770 Steubenville Pike, Pittsburgh, PA 15205', 'review_list': [u'Was planning on staying here just for the night for just the night getaway with my girlfriend and the service was horrible. Was suppose to check in at 3 pm and did not get there till almost five due to an event we attended. Once we got there we were checked in to a room with a hot tub and...\n\n\nMore', u'This was probably the best Comfort Inn my wife and I have stayed in. I would definitely recommend this to anyone staying in the Pittsburgh area who wants a reasonably priced motel. There were plenty of choices for the free breakfast...yogurt, bagels, danish, waffles, scrambled eggs, sausage/ham, OJ, Apple juice, etc.', u'I returned to the Pittsburgh area for a family visit and spent the entire week in this hotel. Finding a hotel where you are comfortable so far from home for a week can be tough, be we had no complaints whatsoever about this Comfort Inn!\nI am a native to the area so I knew where this hotel was located,...\n\n\nMore', u'I would certainly recommend this hotel. The price was right the rooms were roomy,\nclean and comfortable. The staff was more than helpful in giving directions to different places that we wanted to go. They were very friendly and made you feel at home. We will be staying there again hopefully next year. The hotel was 13 years old, but...\n\n\nMore', u'Nice quiet location with easy access to the interstate. Rooms are quite large and very comfortable. Helpful and friendly staff. Breakfast area was small, but the food was good. Would definitely stay here again.', u"We stayed in non-smoking room but I woke up to the smell of cigarette smoke. The next day I noticed half the floor (3rd Floor) was smoking rooms. I don't know why they don't just make the whole floor smoking and the 1st & 2 nd floors non smoking. I mentioned the smell to front desk and they just looked...\n\n\nMore", u"Stayed here for a weekend to celebrate my b irthday. The hotel is easy to find, and not hard to navigate around the concrete median in the road. The room itself was okay, can't say we are rushing to go back but also can't say it was the worst we have been in. It looked recently remodeled but there were...\n\n\nMore", u'I was pleasantly surprised that for $120, you had a nice clean hotel where you felt safe and had a good breakfast as well. The wi-fi even worked beautifully and it was free--I would stay here again in a minute--close to downtown Pittsburgh too!', u'I stayed for a week and got to see the staff of every shift. Everyone is friendly and helpful.\nThe hotel is in a rather quiet location away from any commercial bustle. To get in from Interstate 79 it is necessary to drive another 200m to turn left into some office property to do a U-turn.\nThere is a high...\n\n\nMore', u'This is newly remodeled smaller inn that gives you a homey feel. The staff was fantastic and you are located about 3 miles from a huge complex of shopping and restaurants. The beds were very comfortable and the room had a sitting area,a microwave and refrigerator. The hotel property is carved out of the side of a cliff so our...\n\n\nMore'], 'title': u'Comfort Inn - Pittsburgh / Steubenville Pike Hotel'}
{'rating_string': u'3.0', 'review_count': u'319', 'address': u'4859 McKnight Road, Pittsburgh, PA 15237 (Formerly Holiday Inn)', 'review_list': [u'This older LaQuinta is located on a hill overlooking McKnight Road. They have a rather large lobby which had a bar called the Hilltop Bar. The breakfast room was located by the bar. We arrived early and our reserved King room had not been cleaned yet. The desk clerk was able to accommodate us with another double room. She was...\n\n\nMore', u'Would not stay here again...too many issues to list...unsafe parking set-up. Heating issues...power issues...dog barking...no conveniences in bathroom...commode dirty...different beds than I reserved...', u'After being away from the Pittsburgh area for 22 years I was looking for a nice clean affordable hotel close to the city. I went on priceline and got a great rate for three days. The property is close to the city and it has a Chipolte right next to it! The front desk staff were so friendly. ..Sherry was...\n\n\nMore', u"I had stayed at various La Quinta Inns on a trip across the country, with good results. But this one was a disappointment. There was no more hot breakfast, the last 2 days the room was not cleaned, and my tweezers are missing. I probably won't be back.", u'Everything was very good except room was not cleaned after first night. Hotel lounge could open earlier and stay open later. Staff seemed friendly but not really dedicated. Overall nice hotel in an area convenient to the city (8 miles from downtown).', u'We stayed here for 1 night when we attended a concert in Pittsburgh in the Oakland area. Room was great! Clean and neat. The breakfast had the usual cold items and only waffles as the hot food, which I was disappointed in. I had a problem with my bill but otherwise our stay was rather pleasant.', u"We stayed Thursday to Saturday. We came in from Buffalo for a concert at the Consol Center. We checked in right are 3pm with no problem. Asked for extra towels at the desk right away because we knew we'd need them. We were on the 6th floor and the 30 seconds we were on the elevator a member of the...\n\n\nMore", u'Went to check in, lady at front desk ask for necessary credentials, placed documents in her hands and after she was through she proceeded to place them on the counter, I found this to be rude on her part, after which I went up to my room to find out that their house keep crew was on strike or in...\n\n\nMore', u'I have stayed at this hotel before and it was great. This last time I told them I was not coming back, it was terrible. New management, they should not be in the hospitality business. No maintenance done on the parking areas to remove snow. No real concern for the safety of the customers walking on the ice. No concern...\n\n\nMore', u"We found this hotel on Expedia for an overnight stay for a funeral in the area. Sherry at the front desk was amazing and helped us through issues we were having with the Expedia reservation (not La Quinta's issue at all). Our stay was very nice thanks to Sherry and the others on the reception team. A nice breakfast was...\n\n\nMore"], 'title': u'La Quinta Inn & Suites Pittsburgh North Hotel'}
{'rating_string': u'3.5', 'review_count': u'102', 'address': u'1000 Park Lane Drive, Pittsburgh, PA 15275', 'review_list': [u'The staff were very friendly, and the breakfast had a lot of variety. The shuttle to the airport was excellent. The amenities (towels) could be better. The hotel is located in a nice area, with restaurants and shopping.', u'This is my second stay here. The hotel had been under renovations and I was expecting some of my issues with my last stay to have been corrected. The woman when we checked in was very nice, very friendly. Go to our room, we are on a floor that is half renovated. New carpet, new beds, new bedding, there are...\n\n\nMore', u"Stayed here last week, and it was great. They were doing some work outside, so it was a bit of a messy parking lot. That's to be expected with work going on, though. My only complaint about the room itself is there were a couple of hairs in the tub. Could have been from housekeeping cleaning cloth. Just cleaned it...\n\n\nMore", u'We have stayed here twice. my wife and I along with our son really enjoy this place. The staff was very friendly. The place offers a nice place to relax in a outdoor park atmosphere. And even enjoy playing basketball with my son and others staying at the hotel. And the breakfast buffet offered a very nice variety. Hoping we...\n\n\nMore', u"Despite mixed reviews, we decided to try this for a Park n' Fly at Pittsburgh Airport because they had the longest Parking Period that fit our travel. We chose this in part because the hotel manager Mr. Walsh seems to read and respond to every online consumer review, which we think is a good sign for hotels. Let me start...\n\n\nMore", u'Have stayed a number of times here and will continue to stay before early flight. Great early transport to airport. They are remodeling the third floor but there was no noise issues during stay. Room was clean and tidy. Had to leave before breakfast so the in room kitchen was great for my breakfast. Would be a great place for...\n\n\nMore', u"I work in hotel management, so to say I'm a tough critic is probably putting it lightly. I checked into this hotel fairly late and I was warmly greeted by Bill and his wife. They were very helpful in getting me checked in and arranging the shuttle for me the next day. My room that I stayed in was very...\n\n\nMore", u'This may have been one of my worst stays ever in a hotel. We stayed here one night before our 6am flight out of Pittsburgh. The room was Ok, not real clean and had a big iron burn on the carpet. We went to bed early so we could get up at 4:00am to get to airport. The walls were...\n\n\nMore', u'I stayed at this hotel 9/27-9/28. I was visiting Pittsburgh to see a Steelers game. The hotel was away from downtown but is near plenty of shopping and restaurants. It took maybe 15 minutes to get to Station Square which is where we parked for the game and took a ferry to Heinz Field.\nThe hotel looked brand new and...\n\n\nMore', u"This was a stop-over on a trip. Nothing exceptional about this place, but adequate and a good value for the money. Fairly clean, plenty of room, full kitchen (although we didn't need it). The breakfast was pretty sparse, but we found enough to get us going for the day. I would stay here again if looking for some place to...\n\n\nMore"], 'title': u'MainStay Suites Pittsburgh Airport Hotel'}
{'rating_string': u'3.0', 'review_count': u'222', 'address': u'3401 Boulevard of the Allies, Pittsburgh, PA 15213', 'review_list': [u"We were able to check in super early, which was a huge plus in my book, the parking was free, the shuttle was free. Room was a little dated, looks like they are trying to remodel and just haven't done it all yet. The room was clean and beds were comfy. Balcony was nice, but it stunk. All in all...\n\n\nMore", u"Great older refurbished facility. Convenient location ! Parking. Each room has a balcony.\nPanera's restaurant. Large rooms. I appreciated each staff member, they are great ! Near University of Pgh, Carnegie Museum, Schenley Park. Close to Squirrel Hill. Straight shot on\nthe Blvd of the Allies to downtown Pittsburgh", u"I use this hotel all the time! A great to stay near the hospitals and university. Staff is excellent and very accommodating. Free parking which is extremely rare in Oakland! Panera Bread Is connected to the hotel so you don't have to go far for breakfast, lunch, or dinner.", u'Stayed at this hotel in the end of March. My mom ended up staying almost a full week, and I drove out to join her for a few days while my father was in UPMC. Let me be clear that it is not a hotel I would usually pick out for myself for a vacation or a trip where I...\n\n\nMore', u"We stayed at this hotel one weekend while a family member was in McGee Women's Hospital in Pittsburgh. The hotel is just a block away from the hospital so its location was excellent. In addition they gave a very good special room rate to family members of hospital patients. This is an older hotel and did show some signs of...\n\n\nMore", u'Review of the rooms will match the previous statements. Dated, but tolerable. Lots of electrical outlets to charge devices.\nFront Desk staff was so helpful in offering Dinner suggestions and explaining use of the hotel shuttle.\nShuttle service was fantastic! Protests had just started in the city and our driver knew the way to get us to and from the...\n\n\nMore', u'This hotel is walkable from the University of Pittsburgh campus as well as the surrounding medical facilities. But the rooms have been beaten in a bit. My room had only a sliding glass door with balcony; but the door showed evidence of having been broken through in the past. The old latch was not sufficient, so a new hook latch...\n\n\nMore', u"Stayed here for a night prior to my wife's appointment at UPMC. The facility is close to numerous medical services and is by far the cheapest in the area. While the lobby has been recently renovated, the entire hotel is dark and in severe need of a facelift. Hallway carpets were stained, gross, and long overdue for replacement. Room furnishings...\n\n\nMore", u"We are staying this weekend, Nov 7-9, 2014 to show my daughters (3&5 yrs old) my college roots. Originally made reservations at the Residence Inn in North Oakland but saw the parking was $15/day and there wasn't much to do. After reading the reviews, we were hesitant and didn't have high expectations at $126/night for 2 double beds, free parking,...\n\n\nMore", u"Stayed 2 nights in Pittsburgh to have s weekend away and go to a Steeler game. The hotel was perfectly fine for our purposes. Clean and well maintained. The wifi signal is strong and the staff is friendly.\nMy sink didn't drain very quickly. But not a big deal.\n6.4 km (4 miles) from the stadium.\nI recommend it."], 'title': u'Quality Inn University Center Hotel, Pittsburgh'}
{'rating_string': u'3.5', 'review_count': u'38', 'address': u'4800 Steubenville Pike, Pittsburgh, PA 15205', 'review_list': [u'Showed up really late - almost midnight - so was not sure what we were really getting into. Huge potholes in lot - found them bu surprise. The rooms were very, very, very outdated. If you need a place just to lay your head for one night - and one night only, you should be ok.\nWe had a good...\n\n\nMore', u'very nice rooms, and the staff was friendly, not a very good location or parking if you are moving with a truck and trailer, there is no room to turn around. found parking and had a very nice night breakfast was great, I would stay here again', u"I'm assuming that for those who decided to stay in this motel, you are not looking for an extravagant experience. The place is just like the picture from some previous reviews. Very 50s feel. The location is roughly 15-20 mins between airport and the city. Although it is very close to a large shopping area if anybody cares. Staff is...\n\n\nMore", u'I am a Choice Hotel employee, and when I had to make an emergency trip to Pittsburgh from Nashville TN, I checked into the Econo Lodge, expecting the worst, and was pleasantly surprised. The room was clean, nice big television, and the staff was friendly. Would stay here again.', u'I spent about $80, might have wanted to spend a little less than that but the hotel itself was alright. Clean enough, no real complaints. It consists of three one-storey buildings - park right in front of your door. Vending machine in the lobby. Tricky to get to - coming off I-79 you have to drive down the hill and...\n\n\nMore', u'We stayed here for one night while visiting Pittsburgh for a game. It was a lot cheaper then paying the Downtown prices of those hotels. It was a $15-20(each way) cab ride to downtown and back.\nThe hotel was a little old, but fine for one night. It was clean with comfortable beds and the breakfast was sufficient. I would...\n\n\nMore', u"At the low rate we paid everything was fine. Clean room, freshly painted although a odd color, quiet room with strong wifi although I couldn't open my wifi device. Saturday was busy at this hotel with a bit of a bumpy parking lot. It needs up dating but was ok.", u"Stayed there one night on July 11, 2014. The place is average and the room is clean and comfortable. The shower head is very low so if you're tall, you may have to squat. There is also a lot of construction on the road where the hotel is located and the smell of fresh asphalt was very evident in the...\n\n\nMore", u'What a pit. The staff is good but that is where it ends. I was looking for a cheap place to stay and found it. I booked a non-smoking room and got a smoking room, with the burn marks on the carpet and the bed spread. The bathroom is a joke. I am just under 6 foot and had to...\n\n\nMore', u'Everything seemed very clean, bed was comfortable. A flat screen TV was mounted on the wall, about a 40" model with numerous channels. There was a large shelf to the right of the sink area which was very convenient for setting things down and keeping them out of the way. It\'s a one floor facility with no central hallway. I...\n\n\nMore'], 'title': u'Econo Lodge Motel, Pittsburgh'}
{'rating_string': u'3.0', 'review_count': u'490', 'address': u'900 Chauvet Drive, Pittsburgh, PA 15275', 'review_list': [u'I recently stayed in the Microtel Inn and Suites closed to the Robinson Township of Pittsburgh. I thoroughly enjoyed the stay. The Staff were very friendly, The rooms were very clean, The location was great, near restaurants and stores. Over all my stay with them was very enjoyable.', u'We stay here before and after an overseas flight out of Pittsburgh Airport. We are able to leave our car (have left it for as long as 44 days). The shuttle service is very convenient, as they start really early in the morning. Included breakfast is nice to have, as it saves time getting out. Desk clerks are polite and...\n\n\nMore', u'One positive is the internet speed. Arrival staff and shuttle driver were very unfriendly which set the tone for our stay. However the morning after, the front desk staff and a different driver were helpfully and cordial.', u'Adequately clean and nice enough for one night and convenient to the airport. The staff was courteous and prompt.', u'This Microtel is located near the Pittsburgh International Airport in a major shopping district. Very safe location. Continental breakfast was average. Room was clean and comfortable. I qualified for the AARP discount and got the room for $59 plus tax - great deal.', u'Our stay was made special by the way Autumn at the front desk professionally handled our check in, our local directions and our questions and made sure we were happy with everything at Microtel. People like Autumn make travel a pleasure- wish more hotels had people like her.', u"I would've paid extra to spend money at any hotel around instead. When we pulled up, there was no parking at all. It was minus 20 wind chills outside. It snowed a few inches and the side walks were completely covered. No one shoveled or salted. We went out for dinner and once again no parking when we came back....\n\n\nMore"], 'title': u'Microtel Inn & Suites by Wyndham Pittsburgh Hotel'}
{'rating_string': u'3.0', 'review_count': u'95', 'address': u'100 Kisow Dr., Pittsburgh, PA 15205 (Formerly Travelodge Pittsburgh)', 'review_list': [u'Very outdated, rooms are cold and moldy. Heater is dirty and load, never shuts off. Wifi internet slow just like the dial up. Shower is hard to operate, really have to pry on the handle with all my weight to turn the water on or to regulate the temperature. Looks somewhere else people!', u'So far I realize you get for what you pay for for $50 per night. This Independent hotel is run by Indians who do not clean the facilities very well. Smelled like Under armpits which Curry dishes smell like. Also they got my room incorrect in the beginning since my room was supposed to have a refrigerator and microwave. I...\n\n\nMore', u"It's a basic place to stay close to Pittsburgh. The bed was comfortable, free breakfast (cereal, bananas, bread, donuts, orange juice, tea. coffee), free wifi, free parking. No elevator. The front desk staff are friendly.", u'Room is unclean, staffs are unfriendly. Many stuff are broken in the room, awful breakfast, not cheap fare. Never come cleaning staff(even if you stay here multiple days)・hope they impofove this bittom confiton as soon as they can.', u'Came in for the Colts game only room available within 7 miles. Room was nice and clean. Their breakfast sucked and they call it continental breakfast????? Breakfast was only bread, donuts, 2 choice of cereal, coffee and apple juice. For the price and to get one night sleep it was okay.', u'My husband and I came in for a preseason Buffalo Bills versus Steelers game. Check in was smooth and employee was pleasant on Saturday afternion. We Asked for extra pillows and towels, and we were given them with no problems. Rooms were clean, no odors and nothing was too out of date. Rooms were spacious and comfortable with the ability...\n\n\nMore', u'Clean beds. Floors in our room were stained.Bathroom was clean. Had a big dent on the tub though. Looked like someone was angry and kicked it. Plenty of towels for 2 people. Out dated TV. Actually "snowed" which is crazy for this decade. Quick check in and out. Overall. Good overnight stay.', u'I have stayed here on 3 occasions in rooms 238 and 239, the room are nice, the wi-fi is very good and the staff are great and they loved my kids! I highly recommend this hotel! Also very quiet which is great for me since i must get up very early!', u"I stayed here for one night on my way to Niagara to explore Pittsburgh and the experience was average. Room was clean and all electronic equipment's were in good order. They provide free parking and breakfast(you are not allowed to take in room) which is good deal at such price. Pittsburgh downtown is just 4 miles from this place.\nI...\n\n\nMore", u'Stayed here recently strange people hanging about seems like people are living there sadly but anyway the room I had was disgusting the smell was bad the bathroom smelled of strong urine there was a hole that looked like it was kicked in under the tub a bare hole they do not clean these hotels after they just cut corners...\n\n\nMore'], 'title': u'Hilltop Inn PIttsburgh Motel'}
{'rating_string': u'2.5', 'review_count': u'307', 'address': u'1150 Banksville Road, Pittsburgh, PA 15216', 'review_list': [u'The Days Inn was a very nice place. Staff was attentive. Room was clean and comfortable. Eat n" Park was on the same property. Breakfast needs improvement though.\nWe stayed here due to an appointment at Childrens Hospital. It was close and affordable. We will definitely stay again for our next appointment.', u"While clearly an older property, the rooms have been updated and are modern and the bed was incredibly comfortable. Staff was friendly and I liked that there was an Eat N Park next door for food 24/7. I stayed two days and visited several different parts of the city, none of which were ever more than 15 minutes away. I'd...\n\n\nMore", u'The room was sufficiently clean. The beds free of bugs. Plenty of outlets, free wifi, walking distance to Eat N Park restaurant. Staff was friendly and polite. 3 deep dresser drawers. Ample lighting. Cable & HBO. Wash & Dry for $1 each. Soap $1. Front desk makes change for the wash / trades change for dollars for the 20oz soda...\n\n\nMore', u"Beds were soft and bug free. Door latch worked fine. Do not disturb sign gave us the privacy to sleep in, and its removal saw our room 'serviced' by the time we returned. Shower/tub/floor was clean. Phone didn't work initially, but they fixed it once we reported it. No one fussed when we re-arranged the room to put the desk...\n\n\nMore", u'Stay at the Days Inn, Mountain area. This the Romantic, and also scenic area to me to be for peace of mind and comfort for the traveling. The view of the surrounding areas is just awesome. It remind me of a mountainous resort area, with a little City added to it, Must see!', u'Though I purchased a smoking room, I was surprised that the covers had burn holes in them and the air was thick, like the room rarely gets aired out. I also overpaid for a place that\'s not necessarily close to the metropolitan area. The vending machine ate my money, and I could not access the supposed "free" wifi. Other than...\n\n\nMore'], 'title': u'Days Inn Pittsburgh Motel'}
{'rating_string': u'2.5', 'review_count': u'186', 'address': u'6 Landings Drive, Route 28 & Pennsylvania Turnpike, Pittsburgh, PA 15238', 'review_list': [u'We checked in late and had great service from the night clerk, especially when the heater in our room made an awful racket. She changed our room quickly and without hesitation. Our room was well worn but clean. Worth the cost. Breakfast was adequate. We had requested a late checkout after our second night (phone call made after booking and...\n\n\nMore', u"Had a good stay. Clean room, redone since last year, comfy bed and very good quick service. I've stayed here before and will do so again.", u'Motel is definitely showing its age as well as wear and tear. Safety lock was broken off door inside and part of shower head fell off when you turned on the water. Bathroom floor and inside tub had black stains. Motel is convenient to ice rinks and indoor field facilities. However, the new Hampton Inn which is being built nearby...\n\n\nMore', u'If you use the coupon this place is a good price and a good location. There is a free continental breakfast, coffee and hair drier in the room, the beds are comfortable and bug free (which is great in itself) and when you stay there the restaurant across the way gives ya a 15% discount', u'The hotel was comfortable and the rooms were spacious. It is an older hotel and as such has some wear and tear, but still very clean. It has a microwave and refridgerator in each room as well as complimentary breakfast which is nice. The rates are reasonable.', u'Stopped at this hotel, because it was late and it was pet friendly. The desk girl was fine,friendly ,,Our room was ok ,,,a little stale smelling,,,I did see a bug on the box springs....The biggest thing for us was the loud partiers. They dropped beer bottles from the second floor,,and were very loud ,,driving in and out I front of...\n\n\nMore'], 'title': u'Days Inn Pittsburgh-Harmarville Motel'}
{'rating_string': u'2.5', 'review_count': u'193', 'address': u'700 Mansfield Ave., Pittsburgh, PA 15205 (Formerly Greentree Suites)', 'review_list': [u'This property has been raked over the coals by some reviewers. I recently stayed here (for the umpteenth time) and found it to be more than satisfactory. Rooms were clean and in very good shape. The staff at the front desk (Josh in particular) were excellent. The breakfast was good to excellent as usual. The shuttle crew (Joe and Eric)...\n\n\nMore', u'I selected the suite for my family as a surprise treat. When pulling into the parking area I could immediately feel the "slum" atmosphere. Clothing draped over stairwell railings an what appeared to be people living at the site sitting in outdoor chairs.\nLousy check in with unprofessional staff\nDisgusting room with:\nholes in walls\ncoffee maker with no coffee...\n\n\nMore', u'This is the fifth time I have stayed at this hotel in the past year, and I plan to stay more. It is my "go-to" hotel when I need to spend the night. First of all, the employees are always super great and really helpful. Plus you get what you expect from Quality with awesome beds and a great shower....\n\n\nMore', u'Stayed here for the weekend when visiting Pitt for the first time. it was nothing fancy but did the job. the room was big and had a fireplace and a pretty big kitchen considering it was a hotel. we weren\'t in the room all that much so the "fanciness" didn\'t matter. it was inexpensive for Pittsburgh. if i had the...\n\n\nMore', u"Well i was visiting Pittsburgh for 1st time. The Hotel was beyond My Expectation only issue was its hilly area so i need to pull my luggage to the room as i have good luggage. The Hotel doesnt have anything close by except some bar but not a good restaurant but the good part is they have menu's of lots...\n\n\nMore", u'This hotel is different than most hotels. It looks like a condo community that was bought by a hotel chain and made into cheap hotels. My room was dirty and there were cracks in the floor, ceiling and walls. The room had a pull out couch, but no pillows or blankets for it. The thermostat was broken and barely hanging...\n\n\nMore', u'This place is just bad. Our experience started gy checking in at a dingy lobby and walking up to a room door that needed cleaning and painting. Opening the door we were greeted with a carpet that was not only very soiled but also with a rip abound the floor outlet. The room was in very much in need of...\n\n\nMore', u'After reading the poor reviews that other guests had written, I feared we might regret our choice to stay at this hotel. However, this site fit our needs perfectly. We needed a hotel at a halfway meeting point (Pittsburgh) to visit with our sons who live over 8 hours away. The downtown hotel prices were prohibitive especially with extra charges...\n\n\nMore', u"I have travelled the world and stayed at good and bad all over, but NOTHING compares to this place. They didn't have the non smoking rooms we ordered and the smell when I walked in was wild. I went to put my bag on the kitchen counter just in the door and it had a huge puddle of something sticky...\n\n\nMore", u"It's been awhile since I've had the time to review a property, which I guess, is a good thing. I've been staying in a number of nice hotels over the last six months, and none of them have given me a reason to have them stand out. Until now...\nDue to a last minute client event and the fact that...\n\n\nMore"], 'title': u'Quality Suites Hotel, Pittsburgh'}
{'rating_string': u'2.0', 'review_count': u'22', 'address': u'2834 Banksville Rd., Pittsburgh, PA 15216 (Formerly Pittsburgh Inn)', 'review_list': [u'This hotel should not offer non-smoking rooms if they aren\'t available. Our "non-smoking" room required us to walk through a very smelly smoking hallway (tobacco and *other*). When we got to our room, there were two ash trays by the beds and one in the bathroom. A call to the front desk and we were told that our room was...\n\n\nMore', u'Stayed for two nights while in town for a Steelers game. Got a great rate but the room was to be non-smoking and the smell hit you as you walked in the door. I called to change but got the "were full" line. Opened window, washed a/ c screens in the bathtub and lite a candle. Few hours later it...\n\n\nMore', u'This motel 6 was filthy and poorly maintained. upon arriving to our room we found it was in the smoking section when we specifically requested nonsmoking, and they were unwilling to change us to a nonsmoking room because they were booked. The room was visibly dirty with an unswept carpet, dirty mirror, smudges on the furniture and window and even...\n\n\nMore', u"This facility became a Motel 6 only about a year ago. So you can understand why it doesn't look like the typical shabby Motel 6 and why it offers much more comfort. We found the rooms to be sizeable, the bathroom to work well (as another reviewer mentioned, they don't provide shampoo - so bring your own), the television and...\n\n\nMore", u"I must have read the wrong reviews or booked the wrong hotel. There's no way I would have stayed given the prior reviews I see now. The ONLY thing this place has going for it is location. We needed something near and accessible to/from PNC Park. The check in was OK, I guess. The room was not ready - but...\n\n\nMore", u'This older, but adequate for cost, hotel is located south of the river, but only a couple of miles from some\nSome nice shopping and restaurants. If you are in town for sports or sightseeing, you will need to cross the river either by bridge or tunnel. Warning: there are lots of closures and detours.\nThe staff was very nice....\n\n\nMore', u'This was our second time staying at this Motel 6 and we will go back there again next time we are in Pittsburgh. It is nothing fancy but it certainly does the trick. We had no problems with any neighbours and it is very convenient. There is an Eat and Park just down the street to eat breakfast at. A...\n\n\nMore', u"We stayed here due to a family emergency in April. We had to stay here for a night and it was horrible. The beds weren't clean, the bed was undone, it was noisy, and the room smelled like smoke! The next time we stay around here we'll totally stay at a different hotel. You'd have to pay me to stay...\n\n\nMore", u'Ok. First let me tell you that after reading some reviews was a bit apprehensive about staying here. Was in town for the day and needed some cheap lodging (moreso to crash for the night). Did not want to pay $200 and some dollars just to sleep (as in the downtown hotels).\nFirst, read some reviews that the hotel has...\n\n\nMore', u'If you need to stay some where that is realy reasnably priced for just rooms its a nice place. Must have a car but the room was clean the showerhead was a little low. But over all it was fine for what we needed'], 'title': u'Motel 6 Pittsburgh'}
{'rating_string': u'2.5', 'review_count': u'58', 'address': u'211 Beecham Drive, Pittsburgh, PA 15205', 'review_list': [u"I stayed at Motel 6 Pittsburgh - Crafton in the mid January 2015 for 2 nights together with 2 friends. It's a basic motel, but great for a short stay. Check-in was really fast and I think usually you have to pay for the wifi but we got 2 codes for free. Everybody was friendly and the room was clean....\n\n\nMore", u'This was a very basic motel. I stayed there as part of a road trip in November. We had driven from Ann Arbor following a Michigan University football game, and this was a stop en-route (circa 300 miles away). We must have arrived at the Motel 6 just after midnight. There was a man on the reception desk who checked...\n\n\nMore', u'this plase wasnt bad but not great eter the staff was ok however you have to stay on them i asked for heat and they said they would turn it on but three days later still no heat the shower heads were chest high the toilet was made for a baby and the water prrasure suked cold hot cold hot...\n\n\nMore', u"Stayed here for 2 nights during a quick visit to Pittsburgh. I booked motel 6 because of the low fares, but I won't fall for that again! They came in to clean to room and didn't make the bed (??), the shower was so low that I almost had to bend over to wash my hair.\nNever again, that's sure.", u'Asked for a non smoking room and received a room that smelled like cigarettes and marijuana. There weren\'t enough towels for 2 people and the shower is low so that if you are taller than 5\'2" you will have an issue. Glad we just had to stay overnight. Won\'t try this one again.', u'Made a reservation for the night of September 27 for 2 rooms 1 night. When we arrived to check in we were told that only 1 room was being shown, funny part was we used there corporate site for the booking. Did I mention that the rate for another room which was apparently unavailable was now double. Yes it was...\n\n\nMore', u"We we're staying 2 nights the first night we thought it's not that bad but the next day went to pittsburgh and came back to have some lunch and have a break and noticed that some stuff was moved around so checked to see if everything was there and some of my autistic son's pills were missing so there was...\n\n\nMore", u'Moved to different building/room after complaining. Still reeked because smokers are not separated from non-smokers. Tried to save a few bucks staying at this chain and made a big mistake. If it had not been so late, we would have left. Woke up early - congested and nose bleed.', u"We arrived at 12 am - the gentleman at the reception was helpful, gave us all the information - seemed like they don't care as long as you check in and check out!\nRooms were clean -as well as the washrooms - we were quiet surprised! However washroom had no latch. With regards to WiFi, they say it is free...\n\n\nMore", u'I arrived at 3pm, there were no clean rooms available. The ones that became available were smoking and I had reserved a non-smoking room. I had to wait and keep waiting to check in. The desk staff were comolaining that housekeeping couldnt do their jobs well enough to take care of customers.'], 'title': u'Motel 6 Pittsburgh - Crafton'}
{'rating_string': 'Unknown', 'review_count': 'Unknown', 'address': u'5335 Baum Boulevard, Pittsburgh, PA 15224', 'review_list': [], 'title': u'Hyatt House Pittsburgh / Bloomfield / Shadyside Hotel'}
{'rating_string': 'Unknown', 'review_count': 'Unknown', 'address': u'123 North Highland Ave, Pittsburgh, PA 15206', 'review_list': [], 'title': u'Hotel Indigo Pittsburgh East Liberty'}
