{'rating_string': u'4.5', 'review_count': u'375', 'address': u'574 West General Robinson St, GPS use 214 instead of 574, Pittsburgh, PA 15212 ', 'review_list': [u'My husband and I live in the suburbs right outside of Pittsburgh. Every year we set aside a weekend to stay at a hotel in our beautiful city to enjoy all that it has to offer. We have stayed at the Sheraton in Station Square several times, at the Renaissance downtown, and the Holiday Inn on the South Side. The...\n\n\nMore', u'What a wonderful place to stay! The staff was very friendly and helpful. The room was very spacious. We had a king studio! Breakfast in the morning was a very nice variety of choices. The breakfast attendant was very thoughtful with putting out fresh hot food and providing a tray to take the food and drinks back to the room....\n\n\nMore', u'My wife and I spent one night at this Residence Inn during our recent trip to Pittsburgh. The hotel is located downtown, but was very accessible and easy to get in and out of. The staff was friendly and our room was clean and spacious. The free breakfast in the morning was very good with a varied selection of items....\n\n\nMore', u'We travel to Pittsburgh regularly to visit family and have now found what will be our regular place to stay. The room was attractive, comfortable and looked out on PNC Park and downtown. The breakfast is above average, to be sure. When we needed something fixed in the room it was handled immediately.', u'This review is very delayed but I wanted to make sure I wrote it. We came back home to a major snow storm and things have been crazy in WNY since lol. My husband and I stayed at the Residence Inn North shore the weekend of November 14th, 2014. The hotel was easy to get to and had onsite parking...\n\n\nMore', u"I travel into pittsburg for business often, and when I get a choice, I always choose this Residence Inn. Everyone is nice, breakfast is good, rooms are very large with nice kitchens, they'll do laundry and grocery shopping. Especially when you're staying for a week on business, this place is super perfect. They have a pool and gym and all...\n\n\nMore", u"I will not be the first to say that this particular hotel was by far one of the best I have ever stayed at. I booked a room for 2 days during Valentines Day. (13-15th) I made my reservation online through Marriott's site. Once my reservation was complete I contacted the manager to arrange to have flowers delivered to my...\n\n\nMore", u"Ok, I have stayed in every kind of Marriott chain there is. As far as Residence Inn is concerned, this is by far the best I've been to. They checked me in early, gave me all kinds of Pittsburgh tips, and my room is huge, clean, and the bed is comfortable. I left a tip for the cleaning staff and...\n\n\nMore", u'Booked this hotel for our trip to Pittsburgh and are very happy that we did. Location is great if you are go into the Andy Warhol museum, just a short walk down the street.\nHotel is very clean and the rooms are quite spacious.\nThe free breakfast is excellent with nice touches like make your own waffles.\nI would definitely...\n\n\nMore', u'My family and stayed here when my daughters had tickets to a show at STAGE AE. Just a block away from the concert. This hotel had a nice warm indoor pool for my youngest boy who did not go to the concert. Definitely book a suite. Plenty of room and separate bedrooms. I thought the traffic noise would bother me...\n\n\nMore'], 'title': u'Residence Inn Pittsburgh North Shore Hotel'}
{'rating_string': u'4.0', 'review_count': u'69', 'address': u'300 West Station Square Drive, Pittsburgh, PA 15219 ', 'review_list': [u'Love staying here, the rooms are amazing, can park the car & take the ferry across or just get a cab. Tons of restaurants close by, night life & great bar. Will never stay anywhere else when visiting Pittsburgh.', u"My fiance and I booked a stay at this hotel because it was close to the convention center. With that being said, it was somewhat difficult (even using GPS) to navigate to the hotel. Once we arrived, we were advised to park in the adjacent city parking garage, where we were surprised to find the hotel parking rate was 'discounted'...\n\n\nMore", u'We had a room with a beautiful view of the river which we enjoyed very much. I was disappointed that while paying $400 a night for a room, the bathroom door hit against the toilet seat because the bathrooms are so small. Also when we checked in and walked the entire way to the other end of the hall to...\n\n\nMore', u'The Pittsburgh Sheraton is one of my favorite places to stay in Pittsburgh. The lobby is beautiful, wide-open, and has a huge glass wall that looks out to the Pittsburgh sky line. It is in a convenient location, close to public transport as well.', u'For the most part, I enjoyed my stay in this property. Check in was prompt. The room was spacious. The bathroom amenities were a nice touch. The view of downtown and the river is amazing. The property looks to have been renovated in the last few years. Hotel also provided some snacks at check in as part of their "guest...\n\n\nMore', u"Hotel was very clean, service was nice. The lobby bar and restaurant had a great ambiance. The hotel offers a shuttle that goes almost anywhere you need to be, and the driver was great! Downtown in minutes! We had an obstructed river view room and really couldn't hear the train that is near by.", u'Hotel is newly remodeled. But if you ask for a riverview room be forewarned that there is an active train track right next to the hotel. It runs day and night. Otherwise, nice hotel & did enjoy the view.', u"I've stayed here for several months and the staff is definitely the best part of my trips. Marie in the Club lounge is always friendly and the service is impeccable. Then their bellman Darryl is a pleasure and greets you every time you're walking by and always has a good story to tell. And Allen is very welcoming and efficient...\n\n\nMore", u'Booked this hotel for a great rate on priceline. The room was large, very comfortable and very nicely decorated. The king bed was super comfortable. Free internet was good, bathroom large and well decorated. The staff were friendly and helpful. Overall it was and excellent stay. Only complaint would be the high cost of parking, The most I had ever...\n\n\nMore', u"I recently stayed at this hotel on Jan 31 and Fe 6 because we were in town for an event both weekends. The hotel was exactly what we needed. It's a great location with restaurants and shopping near the facility and is convenient to downtown. The beds were comfortable, the rooms were clean, and the staff was friendly and professional....\n\n\nMore"], 'title': u'Sheraton Pittsburgh Hotel at Station Square Hotel Motel'}
{'rating_string': u'4.5', 'review_count': u'478', 'address': u'510 Market Street, at Fifth Avenue, Pittsburgh, PA 15222 ', 'review_list': [u'We purchased a certificate for a one night stay as part of a charity event package, and was pretty disappointed regarding the amount of blackout dates. If you are running a premium brand, why even have so many blackout dates...kind of cheesy, honestly. If you are going to give something for charity, give something of value, not rooms which you...\n\n\nMore', u'Arriving in Pittsburgh after a loooong drive, the folks at the Fairmont in Pittsburgh made us feel right at home with a warm welcome and great service. Training in this upscale chain shows in all of its employees as our needs were swiftly addressed and a room upgrade found upon realizing our room was just too small for ourselves and...\n\n\nMore', u'Easy concierge service in busy downtown Pittsburgh is appreciated. Warm welcoming lobby, friendly professional staff throughout. The lobby has floor to ceiling windows with great views and plenty of comfortable chairs to relax and enjoy the view. We looooved the Spa, Kyle was very helpful setting up three massages including a pregnancy massage for my sister-in-law. My massage with Shannon...\n\n\nMore', u"I am a bit of a hotel princess, and travel for business in high end hotels. As such, I don't tend to love, or stay in Fairmont Hotels much. So believe me when I tell you I was quite impressed with the Fairmont Pittsburgh.\nMy husband and I stayed there for two nights (we went to see a hockey game)...\n\n\nMore", u'We attending a magical wedding at this facility. The rooms all have a tremendous views of the city. This site is centrally located in the city. The location for a grand scale wedding was prime. The food and service was both top notched! The suites are modern in decor and the bathrooms with the glass showers and over sized, separate...\n\n\nMore', u'All of the rooms have a very good view of Pittsburgh. The rooms are spacious and beds very comfortable. They offer jazz most nights in the lobby and the fitness facility is one of the best ever in a hotel. Service is as expected at a Fairmont, top notch! Try for an upgrade looking at Mount Washington!', u'Had a great experience with the Fairmont in Pittsburgh. Definitely made my mid February snowy icy trip enjoyable. Location was great and we walked to a Broadway show at the Benedum Center, had fabulous room service for breakfast and walked to Market Square Primanti Bros and had a great local dining experience. Beautiful hotel, super luxe and quiet. Highly recommend.', u'Love the Hotel but was really disappointed our son was not able to use the gym because he was under 18. The location is fantastic especially if you want to walk Pittsburgh. I love that the Subway ( T ) is a block away and goes to the Heinz Field for free or anywhere downtown or South Hills for a...\n\n\nMore', u'This is the best hotel I have experienced. The room was immaculate, spacious, and extremely comfortable.\nThe staff "went beyond" in every way for my family. I look forward to returning!\nA special thank you to the staff for making our stay so enjoyable!', u'We stay at the Fairmont when we visit our son who goes to Pitt. Even though he is in Oakland, it is worth going down town to stay in a beautiful room with great views of the city. There is not a room with a bad view in the hotel. Staff is always welcoming and helpful and the bar and...\n\n\nMore'], 'title': u'Fairmont Pittsburgh Hotel'}
{'rating_string': u'4.5', 'review_count': u'174', 'address': u'2795 South Water Street, Pittsburgh, PA 15203 ', 'review_list': [u'I stayed here on a recommendation and could not have been happier with my stay. The room had a mini-fridge and small kitchenette area with a TV on a swivel so it could be viewed from the bed, the living area, or the kitchen. The room and bathroom were very clean. My room was facing the Hofbrau House so I...\n\n\nMore', u'We stayed one night while in town for a concert. The staff were very accommodating and the little touches were very comforting. The room was very clean and comfortable. Hotel was just a short drive to all points of interest downtown. Breakfast was delicious. Will definitely be staying again next time we are in town.', u'I found the rooms to be quiet very cool well laid out staff was excellent very friendly my only negative would be that I did not care for the breakfast unless you had an omelette. We enjoyed the walking distance to the Hofbrau house and the cheesecake factory southside works is an absolute pleasure to walk around!', u'We stayed here last weekend to visit my son who lives in Southside and were very pleased. The Hyatt House is a couple of years old but seems brand new - the room was very clean and laid out nicely with a small kitchen and living area - the TV rotated from the living area to the bed - and...\n\n\nMore', u'This was our first time in Pittsburgh and we were highly impressed with this hotel. We had come into town for the Garth Brooks concert and found that our hotel made our stay in Pittsburgh even more enjoyable. The service was great, room was clean and beautiful and the hotel shuttle took you pretty much anywhere you wanted to go....\n\n\nMore', u"I've now stayed at Hyatt House twice and will stay here from now on. I travel to Pittsburgh a few times a year and prefer to stay in the South Side. The shuttle makes the location perfect for a stay for any reason. We utilize it for drop offs all over town. The staff is super friendly and the rooms...\n\n\nMore", u'We stayed here for 3 night in December and loved it! We arrived late at night after travelling 28 hours from Australia and were very impressed. The staff we very friendly and went above and beyond to make our stay a good one. There were 5 adults and we had a two bedroom room with sofa bed. The room was...\n\n\nMore', u"This could well be the best hotel in its class that we've stayed at. The hotel is nicely located, has very courteous staff, is very functional and good value for money. It has a diverse set of restaurants at walking distance and a number of interesting shops also. It's location is reasonably proximate to the Pittsburgh universities also (CMU and...\n\n\nMore", u'I always stay in a lot of Hyatts because I find most of them to be modern ans generally very good hotels. That one was especially good.\nI got a standard room / suite and it looked great, very modern and clean, with a swivel TV that was very convenient and could be used in both the living-room and the...\n\n\nMore', u"A lot going for this hotel:\nFelt brand new - prob isn't very old b/c it's in a totally redone section of downtown PIT\nSpacious and very comfortable room- you get a kitchen where it's totally possible to cook and dine in at the breakfast bar (I didn't) and a sectional couch in the living room area.\nThere's no door...\n\n\nMore"], 'title': u'HYATT house Pittsburgh-South Side Hotel'}
{'rating_string': u'4.5', 'review_count': u'2,188', 'address': u'530 William Penn Place, Pittsburgh, PA 15219 ', 'review_list': [u"We booked this hotel online based on the photos, and when we arrived the photos didn't even compare to the actual building. The staff was beyond professional and wonderful. The hotel itself was magnificent with all the details and elegance. The drinks were a little pricey however the place was amazing. They really go above and beyond for their guests.", u"Classy great hotel, that is rustic, yet updated. Well appointed rooms with comfortable beds, luxury linens, and updated bathrooms. Staff is excellent and there are a number of options within the property to eat. There's also a throwback bar that is worth a visit.", u"As a businessman I have stayed extensively in Pittsburgh in 2014 and also so far in 2015, mostly staying at the Fairmont down the street. I figured I'd try something new this time after a recent bad Birthday visit to the Fairmont, only 1 bad out of 30 last year, but was my birthday so it ruined the day. I...\n\n\nMore", u'Overall the hotel was beautiful, staff was friendly, and the food was good. I thought the bed was hard, but the room was clean and had plenty of space. I had plenty of room in the bathroom and loved the robe that was provided. The room was cleaned every day. The food for breakfast brought to my room was right...\n\n\nMore', u"The hotel is absolutely gorgeous. It is full of historical character which I love. There were plenty of workers outside to help as soon as we pulled up. We were greeted immediately when we walked in which was very nice and helped with directions on our way out since some roads were closed due to the St. Patrick's Day parade....\n\n\nMore", u'The hotel has an old timey feel and is in pretty good shape. It does have some flaws but the building is something like 100 years old. The staff is AWESOME except the concierge. Both times she has mis-guided me in places to go for a drink/sandwich outside of the hotel. Rooms are big enough to move around in without...\n\n\nMore', u"This hotel is absolutely gorgeous. Made a last minute decision to stay here when we got snowed in during a conference in February. Got a great price on Hotwire and couldn't have been happier. Went to the front desk and we were greeted by a very nice and professional young woman. We asked for a room upgrade and she gave...\n\n\nMore", u"This is a grand old place, not old like crappy, old like classy and distinguished, back to another era. It's a must see, must stay. The full service Starbucks in the lobby and convenient parking underground across the street is also nice.\nOne thing to be real careful about is be away from the elevator lobby, I was in room...\n\n\nMore", u'left material in safe, but when I called to see if they had found it, it was gone. Some one is enjoying my gift cards. My guess is some one from housekeeping was able to open the safe and saw the gift cards and wanted them, so they thru away averything else, because to turn them in would indicate they...\n\n\nMore', u'Omni William Penn provides a Gilded Age hotel atmosphere, but with large, modern rooms and current tech and amenities. The staff are helpful and sincere, and the place is fantastically clean and neat. Pittsburgh does not have a Ritz, but this hotel rivals any Ritz. Valet, Check-in, and bell-service were all accomplished in less than a minute.'], 'title': u'Omni William Penn Hotel, Pittsburgh'}
{'rating_string': u'4.5', 'review_count': u'364', 'address': u'223 Federal Street, Pittsburgh, PA 15212 ', 'review_list': [u'Front desk staff were extremely pleasant and friendly when we arrived, and the facilities were clean and accessible. The room was also clean and comfortable. There was a free continental breakfast, with plenty of choices and fresh food. The seating area for breakfast did become full very quickly, though. The only downside to staying here was that there was an...\n\n\nMore', u'Visited this hotel with kids for a sports tournament. Hotel is directly across the street from baseball stadium and walking to lots of shops and restaurants. Rooms are spacious with pull out sofas and sitting areas. Free breakfast was typical. SOHO restaurant in lobby was very good. Parking is convenient but pricey. Our room was on the top floor, 3...\n\n\nMore', u'We checked into the SpringHill Suites North Shore on Friday night. The girl at the front desk was awesome....very helpful and so pleasant! She gave such a wonderful first impression to the hotel.\nWe had a beautiful suite on the 4th floor looking In out at the PNC Ball Park to our left. We were in town to catch a...\n\n\nMore', u'The 1st of 2 nights I stayed here I was put in a room that was as close to the highway as one can get without physically sleeping ON the highway. It was loud and I was woken up about 6x during my sleep. In the morning I requested a relocation of rooms and it was accommodated; however, I was...\n\n\nMore', u'We stayed here to be close to PNC Park, the location is very convenient. Hotel staff is courteous and attentive. Good food availble in the hotel! The rooms are in need an update, lots of wear and tear but overall the rooms were clean. Bathrooms are small but clean. Beds were comfortable and the halls were quiet.\nWould stay here...\n\n\nMore', u"We were in town for a Penguins game and stayed at this hotel. This hotel is directly across from PNC Park and just down the block from Heinz (which is usually why people stay here). But there's a free shuttle within a 3 mile radius but I suggest you sign up for it early. We used Uber to get to...\n\n\nMore", u'Right between a lot of bars, PNC Park and Heinz Field. Rooms were very clean and the staff was great. Expensive on game weekends....but sooooo convenient. Will definitely stay here again. Also...you can tailgate for Steeler games in the lot.', u"I had mixed feelings about my stay at SpringHill Suites North Shore. Starting with the good points, I'd say the hotel is ideally located, just across the bridge from Downtown and few blocks away from notable spots like Warhol's Museum. You really don't need a car most of the time. Plus, they provide shuttle service to the guests. Second, their...\n\n\nMore", u'Our Pittsburgh visit was an overnight stop while on a road trip from Chicago back to DC. So the most important feature for selecting a hotel was location. This North Shore property did not disappoint. It was ideally located in a quiet section right across the river from the very central Market Square of downtown Pittsburgh. Not only was the...\n\n\nMore', u"I have always been pleased with the Springhill suites that I have stayed at in the past. So it is no surprise that this particular one doesn't let me down overall. I will throw out my negative point first. I was in room 911, it was two doors down from the elevator. Now.....it's not what you think, hearing people walking...\n\n\nMore"], 'title': u'SpringHill Suites North Shore Hotel, Pittsburgh'}
{'rating_string': u'4.5', 'review_count': u'925', 'address': u'107 6th Street, Pittsburgh, PA 15222 ', 'review_list': [u'We live in the suburbs of Pittsburgh and celebrated our anniversary downtown for a quick getaway. The Renaissance was the perfect choice. I am a platinum elite member with high expectations. The Renaissance exceeded them with exceptional service. The Renaissance is perfectly located and within walking distance to endless fun in the city. Great stay, and a special Thank You...\n\n\nMore', u'I checked in with Julie who greeted me with a smile, warm cookies and hot chocolate in a world of opulent old world elegance perfectly intersected with modern whimsy that only Renaissance could create.\nThis jewel of a hotel sits on the river overlooking the spectacular topography of beloved Pittsburgh surrounded by bridges, trees and homes tucked away in the...\n\n\nMore', u'very nice hotel as stated on website, no problems what so ever. very close to the benedum theater, great restaurants on the street on which the hotel was located. parking just across the street. I need 200 characters to submit this review, so now I am just filling in space.', u'I stayed here for 1 night on 3/9/15 for a last minute business trip. My room was on the 14th floor club level and it was ready when promised. Upon arrival the room was clean, neat, and tidy. The bed was comfortable and the bath room had plenty of towels. In all honesty its a nice place but the rooms...\n\n\nMore', u"When you first walk into the Lobby, you suddenly say wow on how beautiful this hotel is. In every hotel, the way you are treated is the most important to guest and the front desk staff was truly amazing. i can't remember her name, but she gave us a perfect check in experience Friday night and even walked with us...\n\n\nMore", u"My husband and I recently spent 2 night at this hotel, to celebrate his birthday. We have been here before, a few years ago. We requested a corner King-size bedroom on an upper floor, which we received. The hotel appears a bit more run down than we remember, but overall it's a lovely old building with an amazing lobby and...\n\n\nMore", u'My son and I were in town for a show at the Benedum Center and I wanted a hotel within walking distance. It was about a 5 minute walk or less and the area felt safe. The hotel was older, historic, but very well kept. The valet and service staff was great. The restaurant inside appeared nice but was an...\n\n\nMore', u"Smaller standard room than other Pittsburgh hotels I've stayed in. But loved the I room movie choices. Though expensive, they were the same as the theaters. Bed was comfortable., but not exceptional. Location was awesome. You can walk to any downtown venue-stadiums, theaters, restaurants, ice skating. Taxis easy to get for Strip area.", u'Regrettably, I only got to stay at this hotel for one night. I was in town for business and in order to get there before my client I had to fly in very early in the morning. I rarely as for an early check in but this was an extraordinary circumstance. The person at the front desk very pleasantly accommodated...\n\n\nMore', u'Beautiful hotel with very large, comfortable room. I enjoyed the room service, also. The parking is probably the best price in the city of Pittsburgh and right across the street. You can walk anywhere and getting out of the city is easy. I loved it here!'], 'title': u'Renaissance Pittsburgh Hotel'}
{'rating_string': u'4.0', 'review_count': u'296', 'address': u'20 South Tenth Street, Pittsburgh, PA 15203 ', 'review_list': [u'Spent the night to enjoy the Southside nightlife. This hotel is just half a block from E. Carson Street. If you are a light sleeper, you may not want to stay here as many people were coming and going from the hotel. The parking lot is an extra $14.00 and is secure, however it is awkward to get into from...\n\n\nMore', u"Stayed here based on price and proximity to Duquesne University. It's within walking distance, although you have to climb a lot (200+) steps going over. The shuttle to the school was free, though. We got a AAA discount, too. Checked in on a Thursday and out that Saturday. Nice view of the city, the Monongahela, and Mount Washington from out...\n\n\nMore", u'The staff here goes above and beyond to take care of anything you may need. The shuttle will not only take you to the train,(which is free for pirates and steelers games from the drop off), but the will take you to the stores restaurants, whatever you need. The breakfast here is actually pretty good and if u get hungry...\n\n\nMore', u"Stayed Garth Brooks weekend. I checked in prior to the show on Friday. When I returned afterward, my key didn't work. I went to the front desk, they gave me a new key. I enter the room to find my bags missing, and someone else's bags and clothes in the room. I head back to the front desk, and a...\n\n\nMore", u"Spent a very nice weekend at this location January 23-25. Arrived late and very tired so really appreciated Rose's warm welcome and fast check-in. Next morning we were taken to the Strip District by shuttle. John, the driver was very friendly and knowledgeable. He gave us a little tour and was sweet enough to stop for us to take a...\n\n\nMore", u'I was there with a Bantam hockey team for a tournament in Pittsburgh. The hotel was very nice, and check in was easy. The staff was extremely friendly and helpful. Rooms were large and very clean. It is very close to Carson St. which has lots of restaurants and bars and Park Station. I would stay here again.', u"This HI express is located in a hot spot; the South side with lots of cool and funky restaurants and bars. It is also just a short walk from downtown. It has one of the better gyms I've seen at HI exp with cardio machines, dumbbells, med balls and a functional mobility area with ceiling high enough to jump rope....\n\n\nMore", u'The service was far better than I expected. Everyone was great, but Jay was above and beyond. The location was perfect. The beds were comfy. The room was clean. Parking was easy. There was always hot tea and coffee. Even the smell was great.', u'Everyone was very nice to us. Ms. Betty at the desk was very nice and helpful and even helped us book our next stay and talked to us about the membership clubl! The breakfast in the morning was very good and the room was clean and accommodating! Coming back May 30th for Kenny Chesney!', u"I will start off by saying i mostly stay at holiday inn's, theyre cheap, decent, and you always know what to expect (read my other reviews).\nBut this HIE is great. Clean spacious hotel in a great location. Easy to get to downtown and walking distance to carson st which is packed full of bars and restaurants. This hotel also...\n\n\nMore"], 'title': u'Holiday Inn Express Pittsburgh South Side Hotel'}
{'rating_string': u'4.0', 'review_count': u'134', 'address': u'100 Chauvet Drive, Pittsburgh, PA 15275 ', 'review_list': [u"My boyfriend and I stayed here december of 2014. The value was excellent, especially since the rooms are suites. The only issue we had was that the bathtub plug didn't hold the water in the tub. However, it wasn't big enough of an issue to keep us from returning in the future.", u'We recently were taking a trip to Orlando and had a very early flight. We live one and a half hours from the airport and decided to stay near by the night before. We looked for a reasonably priced hotel close by and decided on Candlewood Suites. It is located in Robinson Town Center, so only a few miles from...\n\n\nMore', u'This hotel is a great value. Good location with comfortable amenities such as a kitchenette in your room and a "lending library" of accoutrements to make your stay more comfortable. You\'re not going to find elaborate common areas or breakfast buffets but if you\'re looking for a clean, comfortable room for good price you\'ll love this hotel.', u'Candlewood Suites was a very nice surprise!. The pricing was fantastic. The service polite and friendly. The hotel up to date style, clean, and had fitness room and store. The room was spacious, warm and included all amenities including the kitchen wear and dvd player. They allow pets for my next trip I travel with them. I will definitely be...\n\n\nMore', u"What a pleasant surprise! We stayed here 2 years ago and were pleased with the hotel. But they have redone the rooms and now they're even better. All rooms have a functional kitchen including a cooktop, full size refrigerator with ice maker, dishwasher, dishes, and cookies. You can also borrow small appliances such as a full size coffee maker, blender,...\n\n\nMore", u'Great location, about 3o min to the city. Not bad at all. Very impressed when we walked in the room. Was just expecting a bed and bathroom maybe a small tv. It had a stove, ref, microwave, dishwasher and garbage disposal, flat screen tv and everything was very clean and staff very courteous. Would definitely come back again.', u"Stayed here for one night. Nothing fancy, just a nice clean room with a kitchenette, large desk area and comfortable bed. I would stay here again. Seemed pretty quiet to me considering the parking lot was full. Just up the road in the same parking lot as Target, you'll find Bocktown Beer and Grill. Lots of craft beer on tap....\n\n\nMore", u'Nice clean hotel. Nice kitchenettes. Friendly staff. No pool or hot tub but very clean hotel. Stayed for a week and greatly enjoyed my stay. Good food around hotel. Will definitely stay there again. Family and business friendly. Quiet for the most part. Not the thickest walls bit fairly quiet', u"Stayed at this hotel for the last weekend of december 2014 and the first weekend of the new year for the Steeler's games, and could not have asked for a better experience. everything was to the highest quality possible. the staff were very friendly and more than willing to bring up any extra toiletries that we needed. I love the...\n\n\nMore", u'We\'ve stayed at many Candlewood suites and have always found them above average. This facility is certainly the exception. Several things didn\'t work in the room and the room itself was "marginally clean."\nPerhaps the worst part was the staff, especially April, the "manager." I\'m not used to getting blatant rudeness in response to an issue. April doesn\'t subscribe to...\n\n\nMore'], 'title': u'Candlewood Suites - Pittsburgh Airport Hotel'}
{'rating_string': u'4.5', 'review_count': u'17', 'address': u'401 Holiday Drive, Pittsburgh, PA 15220 (Formerly Clarion Hotel & Conference Center)', 'review_list': [u'I stayed at the Crowne Plaza for a business trip in March and was very impressed. Upon walking in the hotel lobby is modern and spacious with a cozy feel. A business lounge, bar, and neat work space were present. After a speedy and simple check-in with Janel, I proceeded to the room which was clean and tidy. There was...\n\n\nMore', u'I came here for happy hour after work because it was being advertised in Foster Plaza. I must say the food was excellent and the bartender Will was so friendly and attentive, so that was a huge plus in my book. The decor was beautiful and you can immediately tell that the hotel is brand new. The only complaint I...\n\n\nMore', u"Came to this hotel because of a convention in the hotel. The check in was quick and easy. Staff great!!! Food at the bar/lounge outstanding (recommend shrimp flat) I can't say enough about this hotel!!! I know a review said the hotel wasn't complete but the place is beautiful. If my travels take me back to Pittsburgh I'll stay here...\n\n\nMore", u'Hotel was to be completed. When we stayed here there were light fixtures hanging off the walls. the elevators only worked sporadically. There was no heat in the lobby. The rooms were in disarray. We used Expedia and they lied and said the hotel was done. they alsi charge 35.00 dollars more per night than the hotel was charging. Overall...\n\n\nMore', u"First thing I liked about the hotel is the front lobby. The front desk person was very helpful and attentive to my requests. The room was very clean and comfortable. I would definitely recommend people to stay because it's close to the city without city prices. The restaurant staff was very accommodating as I have a gluten allergy. They were...\n\n\nMore", u"The hotel is situated perfectly for someone flying in to Pittsburgh. I was able to get downtown pretty easily and since there was a keurig in the room I didn't have to stop for coffee. Restaurant and bar was also beautiful and the food was great.", u"This hotel was evidently a run down Clarion previously. Crowne Plaza has taken it over and renovated it, but it's still nothing special.\nPROS:\nNice lobby\nFree fast wifi\nVery small sundry store on site\nRestaurant on site\nDecent towels\nClose to shopping, dining\nDecent sized rooms\nGood channel selection on television\nVery pleasant staff - good customer service\nVery...\n\n\nMore", u"We stayed at the Crowne Plaza Green Tree in early February.\nThe hotel was recently remodeled and it looked great. The hotel had a nice lobby, lounge area and updated rooms/bathrooms. Just looking at the pictures of this property as a different hotel chain, you can't help but see how much the renovations changed the hotel for the better.\nThe...\n\n\nMore", u'Right off the park way, beautiful hotel, staff is great, breakfast staff attentive, comfortable rooms and easy access. What more could a person want? We were going to a concert - this place is with in 15 minutes of Heinz Hall - but out far enough that you have no issues with parking the car. Quiet area, little to no...\n\n\nMore', u"I recently stayed at the Crowne Plaza on a Sunday and Monday nights. The rooms are being renovated, but I heard no construction noises. My room was very nice. The king size bed was one of the most comfortable hotel beds I've ever had.\nBreakfast is not included, but since most free hotel breakfasts essentially rot, this is no big...\n\n\nMore"], 'title': u'Crowne Plaza Pittsburgh West - Green Tree Hotel'}
{'rating_string': u'4.0', 'review_count': u'960', 'address': u'One Bigelow Square, Pittsburgh, PA 15219 ', 'review_list': [u'We originally chose this hotel for its location downtown but once there it exceeded our expectations for great location and hospitality. The hotel was very clean and the staff very helpful including the front desk workers, retaurant workers and housekeeping staff (who were very obliging and friendly and professional). We will definitely be returning to Pittsburgh and will book our...\n\n\nMore', u"Nice hotel, up to double tree standards. sunday breakfast is completely over priced. No one stopped to explain the options so we got up and helped ourselves to buffet scrambled eggs, potatoes, and bacon. Little did we know that was $17 per person. wow!! I'd take a lesson from your Hampton Inn. better breakfast and its included in the price...\n\n\nMore", u"We had a great stay here ! Very nice staff and great clean rooms ! Close to everything , very accommodating . Went to a concert .. Walked there and to the St. Patrick 's day parade right out back doors and down one street . Great location if you want to get the T right out back door. We...\n\n\nMore", u'While the hotel room was extremely "modern" for my taste, that was the only some-what negative comment I have. The room was extremely clean and comfortable, especially the bed and bathroom. I always picture what happens in hotel rooms and in turn I don\'t want to touch anything. After a day/night there, I warmed up to the place.', u'My stay was excellent! From my e-check in to my departure, the hotel did everything I expected as a customer. I would definitely recommend a stay at this Doubletree Hotel if you plan a stay in Pittsburgh. I plan on returning with my family next time to explore the city of Pittsburgh.', u'Within easy walking distance to Consol Energy Center. Hotel is very nice but figuring out which entrance to use for the garage was difficult. We thought the drinks in the lounge were pretty expensive. Ordered a draft beer and a wine = $18.75 without tip. Not much to do within walking distance of hotel but they offer a complimentary shuttle...\n\n\nMore', u'The Hotel was in a great location to access to different parts of Pittsburgh! The Staff is great very polite and courtesy. The restaurant and the food is good. I have use this hotel on many occasion for business trips and would continue to use them for future trips!!!', u'As the Doubletree is an older property I was pleasantly surprised. My wife was there for a weekend of meetings so I tagged along. Beds were superb with great pillows and the room was very quiet. Front desk and valet car staff very good. Breakfast for the meetings was lacking yogurt and not much fruit but a lot of sweets.', u'I stayed at the Double Tree while attending a conference in Pittsburgh and had a good experience. The hotel is centrally located - walking distance to downtown shops and restaurants. Professional and friendly front desk staff gave me an upgrade of the room upon request.', u'Over all the quality of service and the facilities were outstanding. The staff was very friendly and helpful. Our room was clean and very quite. The one thing that was very surprising to ma as the fact that I had to pay to park our car while staying at this hotel. I have stayed in several other hotels in Pittsburgh...\n\n\nMore'], 'title': u'DoubleTree by Hilton Hotel & Suites Pittsburgh Downtown'}
{'rating_string': u'4.0', 'review_count': u'382', 'address': u'500 Mansfield Avenue, Pittsburgh, PA 15205 ', 'review_list': [u'Some of the best customer service from a hotel. Free NY Times, USA Today, Local News Paper. Free fresh fruit and cookies. Great places to eat on property. Great fitness room. Free shuttle to and from the airport.', u'I have traveled extensively over the last 11 years, having 170 flights and accompanying hotels in the last year. By far, The DoubleTree Green Tree has the best staff and accommodations as I have found in the Pittsburgh area. I am so satisfied with the service there, that I typically will stay there as long as I am within 2...\n\n\nMore', u'A few weeks ago I stayed at the Monroeville Doubletree. That was my normal stop. But it was so bad I decided I had to change hotels. This Green Tree hotel is nice and clean. One elevator was not working over the weekend, so that was not great. The room was extra large. Very nice breakfast buffet in the morning....\n\n\nMore', u'I was at the hotel for a site tour and arrived on Sunday evening with an associate. We had a fast and efficient check-in and then went to the Bar/restaurant for dinner which was excellent. We were in a parlor suite and the suite was comfortable and clean. I used the internet and had John Anderson on the AV staff...\n\n\nMore', u'This hotel met all my expections. The facilities were great and the staff are kind and helpful. The room rates are reasonable and amenities are of greater value than other hotels of this size and cost.', u'I had a part time job in Pittsburgh and stayed at this hotel for about five years 1-2 days a week. Absolutely superb. Great rooms and food is on par with a several star restaurant. Free breakfast with a large selection is plus.', u'The hotel itself is very lack luster, but the location is nice in relation to the downtown Pittsburgh area. When our group arrived, we were greeted by a rude front desk employee who was not interested in helping us at all. This was the only rude employee we encountered, thankfully. We had an issue with the heating in our room...\n\n\nMore', u"This hotel is nice. The open atmosphere is a welcomed upgrade compared to another chain in New York that wanted to charge $10 to have a fridge brought to my room. The linens are crisp (1000 TC),thick plush towels in the bathroom, a cafe & a restaurant,indoor heated pool,& much more. You won't regret your stay and the cookie is...\n\n\nMore", u'We were in Pittsburgh for a Garth Brooks concert February 6, 2015 and this motel was easy to find off the Interstate. Since we had concert tickets for 10:30 the motel provided shuttle service to and from the concert (what a blessing this turned out to be). Ryan and Jack knew how to get us into the concert hall and...\n\n\nMore', u"For the value, you couldn't ask for anything better. Lounge/Restaurant was nice. Breakfast (thought not included) was fabulous! Rooms were spacious; Clean; Quiet; and Comfortable. The indoor/outdoor pool and hot tub were a bonus. No sauna. Pet friendly - $50/fee but includes dogs up to 70lbs."], 'title': u'DoubleTree by Hilton Hotel Pittsburgh-Green Tree'}
{'rating_string': u'4.0', 'review_count': u'305', 'address': u'1000 Penn Avenue, Pittsburgh, PA 15222 ', 'review_list': [u'A nice stay at a great downtown hotel.We booked a hot rate on hotwire and got a great deal for a King Room with a view. We did not utilize the valet service but it is available. There is self parking on site and we opted to use that. The lobby is undergoing a renovation so there was alot of...\n\n\nMore', u'I was at the Westin for a conference. Coming from Saudi Arabia, I have experienced many high level hotels. Although when I was there the lobby was under construction, it in no way took away from the feel of the place. The staff was accommodating and very eager to help a first time visitor. The restaurant had A+ sushi and...\n\n\nMore', u'1) run down. The decor involved beige carpets and green wall paper. That was the Westin color scheme in the late 90s and early 2000s before they switched to grey in 2004!\n2) room smells of body odor! No doubt absorbed by the fabrics due to lack of renovation in 15 years or so\n3) breakfast is sit down and...\n\n\nMore', u'Attended a conference here last week. Nice space, well supported and laid out, great staff, very convenient to a lot of things, walk to most hotels. Good Taxi service.\nThe Plenary sessions of the conference with 1600 people had great screens and sound.', u"We stayed for one night to attend a concert and it was beautiful. Check in was sweet and I loved the fact that we had valet parking for a good price. Our toilet didn't work when we first got there but they sent a repair man up right away to solve out issues. The bed was so big and one...\n\n\nMore", u'We were in town for the Steelers vs saints football game. There are not a lot of choices for decent hotels near Heinz field. This was the best of not a lot of great options. We could walk to the game, which took about 20 minutes I felt safe walking both day and night but Pittsburgh has some work to...\n\n\nMore', u'Very nice hotel that is connected the the convention center. A lot of good places to eat within walking distance of hotel. They are remodeling the lobby area but still had a good stay. I stayed for 8 days and have no complaints. Employees are very helpful.', u'My husband and I stayed here the night of our wedding on October 18th,2013. I called many hotels but the Westin was the only hotel to seem enthusiatic about my upcoming life event. Upon arrival we were upgraded to an unbelievable sweet. It had double doors entering the room,a huge living room,full kitchen,dining to sit at least 8, a separate...\n\n\nMore', u"Upon arrival, I was greeted by Jason, a very kind front desk agent. I felt welcomed by him and he was very accommodating to the condition of my stay. He was knowledgeable about different hotel amenities and other questions I had. I believe that Jason's pleasant and welcoming attitude set the tone for my two day weekend stay which was...\n\n\nMore", u"Even though some of the restaurants were not open and there are workers everywhere, we still really liked this property. It's in a perfect location when visiting Pittsburgh. There are several really good restaurants within walking distance, you're close to the theater district and all the major sites. The hotel has a courtesy van that will take you to all...\n\n\nMore"], 'title': u'The Westin Convention Center Pittsburgh Hotel'}
{'rating_string': u'3.5', 'review_count': u'2,329', 'address': u'600 Commonwealth Place, Gateway Ctr, Pittsburgh, PA 15222 ', 'review_list': [u'The hotel is beautiful and the location can\'t be beat. The food was delicious and the bellman was very nice and helpful the entire weekend. The valet was rude and slow each time we parked. We paid for a room with a city view but did not get it. They said we got "the leftovers" because we checked in late....\n\n\nMore', u'With the exception of the lack of hot water during the week. It was warm but definitely not hot when hot was open wide. Other than the staff was great from check in to check out. The room was kept clean and plenty of towels and wash clothes, a hot commodity at other hotels i have stayed at. But the...\n\n\nMore', u"Room appeared to be clean, except for the lipstick kiss marks on the full length mirror that was there when I checked in. Bathroom is very small. Internet was extremely slow and sometimes didn't work at all. I also didn't have good cell reception in my room on the 5th floor.\nBed is comfortable, but walls are paper thin so...\n\n\nMore", u'A business group I belong to has a meeting here once a year. I wish i had a reason to stay more often. This property went through a remodel recently and it shows. The rooms are decent size with nice views of the rivers or downtown (I assume) it seems like i always stay in the rooms facing the rivers....\n\n\nMore', u'The Wyndham Grand is within a 5 to 10 minute walk from everything you would want to see or do downtown as well from as both stadiums. The facility has been upgraded over the past few years as well. The front desk staff are helpful and welcoming. The guys at the main bar are attentive and work hard to make...\n\n\nMore', u"We recently traveled to Pittsburgh for a Penguins game and had a wonderful stay at the Wyndham! We were skeptical at first because we read some horrible reviews, but it ended up being one of the best hotel stays we've ever had! The valet was easy, the staff was friendly, the room was clean and had a spectacular view of...\n\n\nMore", u'Hats off to the staff of the Grand Wyndham- a great place to stay in downtown Pittsburgh- super friendly staff and a special shout out to free shuttle drivers Renee and Tyrone- super nice and informative- thanks for making our hockey trip (2 subway stops from Consol) a memorable one !', u"I am a bit suprised by how lack luster this hotel is for the price. Things got off to a bad start. I used a third party to book, and I understand rooms aren't guaranteed. However when I inquired about a room with two beds, the employee I was dealing with took the opportunity to lie to me and say...\n\n\nMore", u'The hotel is a great location in the heart of downtown Pittsburgh. The ease of the T subway makes it a great way to get around!', u'I am sitting in the bar area and the poor server is left on his own with zero help. Guests have gone to the bartenders to ask for help and they refuse and send then back to the only server in the bar area. Bartenders are sitting behind the bar laughing while guests are trying to spend money. Totally unacceptable,...\n\n\nMore'], 'title': u'Wyndham Grand Pittsburgh Downtown Hotel'}
{'rating_string': u'4.5', 'review_count': u'704', 'address': u'1247 Smallman Street, Pittsburgh, PA 15222 ', 'review_list': [u'Great hotel and location in Pittsburgh for the price upgrade it was worth it for the suite. Will definitely stay there again . Was in town for Hockey game only 15 min walk to Console. Went to Heinz History Musemn across street. Plenty of great spots to eat on Smallman Street all with in walking distance.', u'Had a great experience at this hotel. Taylor and Alexis were working the front desk at check in, and they were so pleasant and helpful. They pointed out a few nearby places to check out and asked if we needed any help with other plans for the evening. Upon entering the room I was amazed at the size! There were...\n\n\nMore', u'Room was clean. Staff friendly and helpful\nTyler was espcially helpful and always friendly\nWill use this hotel again when staying in Pittsburgh. The location is great. Free parking and within walking distance to great entertain,ent and great restaurants', u"My husbsnd and I came to town for the Maroon 5 concert and decided last minute to stay the night and go to the St. Patty's day parade and Pens game. We chose the Hampton because we had stayed here once before and because of the great location (if you are willing to walk a little in the city) to...\n\n\nMore", u'the front desk employees are the best exspecially mariea she was very friendly helpfully and professional if i had to rate her she would get an A. and taylor was great too they recommend some good restaurants', u'This hotel is in an excellant location. We arrived by train and the hotel is only 5 minutes from the station. The welcome by staff was, as always in the hotel chain, very good. Check-in was quick and we were given lots of information by the staff as where to eat etc. We were given loads of stuff as to...\n\n\nMore', u'This was an ideal location for our visit to downtown Pittsburgh. We were able to get to restaurants, clubs, and history center. The hotel service was fantastic and the staff was very complimentary to me in front of one of my clients.', u'Stayed here while attending the Garth Brooks concert. Although a bit dated, the property was very clean, staff was friendly, breakfast was good and efficient. It is conveniently located central to many city attractions. We would definitely return.', u"We recently stayed at this hotel during spring break. It was located downtown and close to everything. We were going to a Penguins hockey game and were only a couple minutes away.\nThe pool area was very nice for some family fun at the end of the day however the towels were very small and there wasn't many available. The...\n\n\nMore", u'Nice hotel close to everthing downtown. Clean and comfortable rooms. Good breakfast and nice pool area. Would have been nice to have a fridge and microwaves in the room for drinks and snacks. Free parking which is rare for a downtown hotel.'], 'title': u'Hampton Inn & Suites Pittsburgh - Downtown Hotel'}
{'rating_string': u'4.0', 'review_count': u'188', 'address': u'2950 South Water Street, Pittsburgh, PA 15203 ', 'review_list': [u"Staff are very friendly and helpful. Walls are a little thin (I can hear some of my neighbor's conversation) but are still better than many hotels I've stayed at. Good size room, and the internet is working fine. As with another reviewer, i'd give it a 5 if it weren't for the train.", u'We spent one night here and paid $195, which we thought was way too expensive. Though it is a new hotel, it has many problems.The beds were uncomfortable. the walls were paper thin and we got to intimately share the parenting next door. There were not enough blankets in the room and we were both cold. The worst part, though,...\n\n\nMore', u"Stayed over 3 nights to go to the hockey's games. They provided a shuttle but be sure to check in with the front desk. It is a courtesy shuttle so it gets busy. Drivers were great be sure to tip them. Hotel is clean and staff was very friendly and helpful.", u'Check in was fast, I asked for a river facing view because I had read on here from other reviewers that the train is very loud on the other side of the hotel. The view was nice, the rooms are spacious and big. I went to the hot tub to relax a little and my eyes started burning which seemed...\n\n\nMore', u"Having to drive from NYC to Pittsburgh on Friday February 27th for my son's interview/audition at Carnegie Melon the following day was stressful as traffic was horrible and we had to leave late day and towards the latter part of the drive the roads wind all around and it was dark and we were exhausted, however, it was such a...\n\n\nMore", u"This hotel is located right between the train tracks and the river. Within a block's distance are bunches of athletic facilities for the Steelers. You can drive back there, but guards won't let you in. The rooms are spacious and clean. We were in a queen double which had a seating/sleeper sofa area with a creative half partition wall. The...\n\n\nMore", u"Stayed while in town for work, and choose this hotel over ones in the past, because it is so close to the fun part of the city. Great staff, great room & clean. Was able to walk to the different bars/restaurants every night, which were close by. If in town for work, or fun and you don't want to worry...\n\n\nMore", u"Loved the hotel, rooms are fairly big and roomy. Sam at the front desk is extremely friendly, absolutely loved him. Shuttle is very nice too. I didn't have to move my vehicle the whole time we stayed. Breakfast is delicious too. Swimming pool and hot tub is very nice too, since it was -32 outside.", u'Nice clean hotel, great staff, walking distance to restaurants and some shops. Nice walking path along river. Trains run during night behind hotel, you hear in all rooms but from what I understand same problem for most hotels along river.', u'I was pleasantly, pleased with my stay here, the service here was very good and all the staff were friendly. It was in an ideal location to get to where we wanted to, and the food and the rooms were brilliant. Just ideal and comfortable enough to get a good nights sleep in, and to eat well. Very accommodating to...\n\n\nMore'], 'title': u'SpringHill Suites Pittsburgh Southside Works Hotel'}
{'rating_string': u'3.0', 'review_count': u'222', 'address': u'3401 Boulevard of the Allies, Pittsburgh, PA 15213 ', 'review_list': [u"We were able to check in super early, which was a huge plus in my book, the parking was free, the shuttle was free. Room was a little dated, looks like they are trying to remodel and just haven't done it all yet. The room was clean and beds were comfy. Balcony was nice, but it stunk. All in all...\n\n\nMore", u"Great older refurbished facility. Convenient location ! Parking. Each room has a balcony.\nPanera's restaurant. Large rooms. I appreciated each staff member, they are great ! Near University of Pgh, Carnegie Museum, Schenley Park. Close to Squirrel Hill. Straight shot on\nthe Blvd of the Allies to downtown Pittsburgh", u"I use this hotel all the time! A great to stay near the hospitals and university. Staff is excellent and very accommodating. Free parking which is extremely rare in Oakland! Panera Bread Is connected to the hotel so you don't have to go far for breakfast, lunch, or dinner.", u'Stayed at this hotel in the end of March. My mom ended up staying almost a full week, and I drove out to join her for a few days while my father was in UPMC. Let me be clear that it is not a hotel I would usually pick out for myself for a vacation or a trip where I...\n\n\nMore', u"We stayed at this hotel one weekend while a family member was in McGee Women's Hospital in Pittsburgh. The hotel is just a block away from the hospital so its location was excellent. In addition they gave a very good special room rate to family members of hospital patients. This is an older hotel and did show some signs of...\n\n\nMore", u'Review of the rooms will match the previous statements. Dated, but tolerable. Lots of electrical outlets to charge devices.\nFront Desk staff was so helpful in offering Dinner suggestions and explaining use of the hotel shuttle.\nShuttle service was fantastic! Protests had just started in the city and our driver knew the way to get us to and from the...\n\n\nMore', u'This hotel is walkable from the University of Pittsburgh campus as well as the surrounding medical facilities. But the rooms have been beaten in a bit. My room had only a sliding glass door with balcony; but the door showed evidence of having been broken through in the past. The old latch was not sufficient, so a new hook latch...\n\n\nMore', u"Stayed here for a night prior to my wife's appointment at UPMC. The facility is close to numerous medical services and is by far the cheapest in the area. While the lobby has been recently renovated, the entire hotel is dark and in severe need of a facelift. Hallway carpets were stained, gross, and long overdue for replacement. Room furnishings...\n\n\nMore", u"We are staying this weekend, Nov 7-9, 2014 to show my daughters (3&5 yrs old) my college roots. Originally made reservations at the Residence Inn in North Oakland but saw the parking was $15/day and there wasn't much to do. After reading the reviews, we were hesitant and didn't have high expectations at $126/night for 2 double beds, free parking,...\n\n\nMore", u"Stayed 2 nights in Pittsburgh to have s weekend away and go to a Steeler game. The hotel was perfectly fine for our purposes. Clean and well maintained. The wifi signal is strong and the staff is friendly.\nMy sink didn't drain very quickly. But not a big deal.\n6.4 km (4 miles) from the stadium.\nI recommend it."], 'title': u'Quality Inn University Center Hotel, Pittsburgh'}
{'rating_string': u'4.0', 'review_count': u'210', 'address': u'5850 Grand Avenue, Pittsburgh, PA 15225 ', 'review_list': [u"Very clean and nice hotel. We were in and around Pittsburgh and didn't want to stay in the city so we didn't have to deal with rush hour traffic. We found the Fairfield Neville Island to be a great location, and very nice motel. The rooms were very clean, with comfortable beds. The breakfast was adequate with eggs, sausage, waffles,...\n\n\nMore", u'this is the nearest hotel to my location and I think the only hotel on Neville Island. I experienced a nice stay. Room was quiet, bed was good. Bathroom was bright. Water was not overly softened. Breakfast was nice, person in charge said good morning and was nice. One of the only places I have been where Fox news was...\n\n\nMore', u"Our room was nice, quiet, clean, and comfortable. The people were friendly and made us feel welcome. The breakfast was good. We had a nice view of the Ohio River out our window, and a tree with a bird's nest! Nice touch! This property was real easy to get to and convenient.", u'This hotel, although in a very industrial area, is very handy to Swickley and Ben Avon, and even downtown Pittsburgh is only 10 miles away. Just off the I-79 bridge over the Ohio River.\nThe hotel is safe, very clean and very upscale for a Fairfield Inn.\nGreat free breakfast, nice pool and exercise area, free Wi-fi and free newspapers....\n\n\nMore', u'It was so neat - especially if get room on the side facing the river. Can watch boats and barges go up and down it. We there there in the fall, so beautiful leaves. Very quiet area for sure. Fire pit, pool. Especially relaxing and great area to enjoy out in back of hotel along river. Do stay there. If...\n\n\nMore', u"Stayed at the property for just one night for my son's game at RMU. Location is very close to RMU, but I felt like I was at a truck stop. There is not much else near by. Check in was easy, but at first no one was at the desk. I had to call around the corner for someone to...\n\n\nMore", u'I stayed here for 2 nights in mid-October. My king-suite was perfectly clean and the layout was well-designed. The second night a throng of tween girls decided to use the second floor hallway as an apparent slumber party location. I was awakened by them around midnight and called the front desk. The representative came and attempted to take care of...\n\n\nMore', u'I recently stayed here for 3 nights with 2 other people. We were immediately impressed with our warm welcome. Our rooms were spotless and the beds extremely comfortable with 4 pillows each!! Breakfast was wonderful with quite a nice selection. Very easy access to the interstate as well. We were able to enjoy the fire pit on our last night...\n\n\nMore', u'On the plus side, we were checked in quickly and very early. The room we had came with a nice view of the bridge. The room was well appointed but our shower leaked onto the bathroom floor so my son had to use all the bath towels to wipe it up. I called at 7am and requested two towels for...\n\n\nMore', u"Stayed here for two nights while we were in town for a hockey weekend (Robert Morris Colonials).\nThe location of this hotel was good as it was right off the highway and only a couple of minutes from the island hockey arena.\nThere isn't much to say about the room other than it was clean and more than adequate for...\n\n\nMore"], 'title': u'Fairfield Inn & Suites Pittsburgh Neville Island Hotel'}
{'rating_string': u'3.5', 'review_count': u'236', 'address': u'6404 Steubenville Pike, Pittsburgh, PA 15205 ', 'review_list': [u"Pictures nothing like the internet!\nDusty, stains in toilet, and so small. The heater was so loud, it woke you up every time it came on. We then turned it off.\nWe were told there would be a coffee maker, and there wasn't.\nOur room was at the end of the last building, next to dumpsters.\nCareful driving in parking...\n\n\nMore", u'I had the impression that this was an upgraded Red Roof but only certain rooms are plus and you would pay more. We got a standard room which was renovated but had no coffee maker, no fridge, no hair dryer, no microwave all of which we are used to getting in other hotels for less price. The exterior of the...\n\n\nMore', u"It's been years since we have stayed at a Red Roof [for good reason] BUT we were pleasantly surprised and impressed by this new and improved motel. The rooms were clean and comfortable. The bathroom is very small but the shower is good. The staff is pleasant. Good location for access to Hwy 79. Lots of shopping nearby within walking...\n\n\nMore", u'Although it was a little hard at first to find the access to the hotel because it is set back a little from the road, once we got into our room, it was excellent. The check-in was a breeze and we drove up to our room and unloaded our bags. The beds were very comfortable and our room had a...\n\n\nMore', u'I was only in Pittsburgh for the night due to the weather diverting my flight. A friend talked with Ava at the front desk while I had to be on hold with the airline. My friend booked a room at 5pm on a snowy Saturday at a better rate than I had found online. The room appeared recently renovated, and...\n\n\nMore', u'I recently stayed in the Red Roof Inn in the Robinson Township of Pittsburgh. I thoroughly enjoyed the stay. The Staff were very friendly, The rooms were very clean, The location was great, near restaurants and stores. Over all my stay with them was very enjoyable.', u'This was a very nice hotel. Clean and quiet, with very friendly American staff. Also seemed to be one of the more reasonably priced hotels in the area. Young lady at front desk was very nice, allowed me to print my airline boarding passes on her desk computer. Restaurants nearby, only 15 minutes from airport.', u"Upon checking in the front desk clerk - Phyllis was extremely helpful. I didn't have to ask for my membership perk (only a free bottle of water but you'd be amazed how many other locations don't automatically offer it) I was asking some questions about where I could go to have a bite to eat and watch the Sunday night...\n\n\nMore", u"I have been staying here for the last 4 months for business. Everyday. That should say it all right there. Lol. I am up here for work and could stay anywhere. But for the price and convenience, it can't be beat. The staff is great and very helpful. The rooms are clean. The room is very functional with an area...\n\n\nMore", u'Anytime for business that I am in the Pittsburgh area I stay at the Red Roof Inn. I do enjoy the bedding, the availability of channels on the TV, and the bathrooms. For the price, it is more than worth it.\nI also enjoy the staff at the hotel. While there, I have met an Ava, Carolyn, and a Sharon....\n\n\nMore'], 'title': u'Red Roof PLUS+ Pittsburgh South Airport Hotel'}
{'rating_string': u'4.5', 'review_count': u'511', 'address': u'614 Pressley St, Pittsburgh, PA 15212 ', 'review_list': [u'My wife and I stayed at the Priory Hotel recently and had a great time. The rooms were very nice, clean, and inviting. The hotel and banquet facilities are beautiful. The lobby quaint and comfortable. We enjoyed the free limo service to local restaurants. All in all, the Priory was central to a wonderful European-Style weekend in Pittsburgh.\nConveniently located...\n\n\nMore', u'We moved to a town outside of Pittsburgh and the area was still very much new to us. On a harsh winter’s day, we were scheduled to travel aboard Amtrak’s “The Pennsylvanian” to New York City. Not wanting to risk missing the train trying to battle rush hour traffic and bad weather, I pulled up “Kayak” and searched for a...\n\n\nMore', u"My husband and I recently spent a night at The Priory Hotel and had a wonderful experience. The staff is awesome and efficient! We checked in and explored the hotel. We were fascinated with the history and architecture of the hotel. The Monk's Bar was small yet cozy and had an amazing selection of drinks, some classics and a few...\n\n\nMore", u'We go to Pittsburgh a couple of times each year for cultural activities and because we like the area very much. We were looking for a better price per night for our stay. The Priory fit the bill and then some. The staff was very friendly and accommodating. We used the shuttle service a lot to get to the cultural...\n\n\nMore', u'This was our first trip to Pittsburgh and I thought the neighborhood was a little sketchy. Very cute hotel though. Bed was a little too hard for our liking. Room was clean with a view of the side parking lot, which was nice to keep an eye on the car and to be able to remote start it this time...\n\n\nMore', u'My wife and I stayed at the Priory in January for a weekend staycation. It was a great choice.\nOur room was clean and comfortable. We also enjoyed a drink in the first floor bar - and the fireplace really warmed us up when we came in from the cold. The staff was very helpful and extremely friendly. We were...\n\n\nMore', u'lovely building, with equally lovely rooms, in a good location.\ni loved my view of the courtyard.\nfree shuttle service is the best!\nvery friendly and helpful staff.\nfireplace kept going in the lounge (in between the lobby and the bar).\ncute little deck and courtyard out back (handy for those us that still smoke!).\nbig chest of drawers, closet,...\n\n\nMore', u'The hotel (really an enhanced bed and breakfast) is nice enough although the price is rather high compared with the number of services offered. First the good: free parking and internet, relatively comfortable bed with nice linens, friendly staff, supermarket next door, free shuttle service. Now the so-so: rather dark, the carpeting in the room was clean but needed a...\n\n\nMore', u"Great old building turned into a wonderful hotel. Friendly, helpful staff took care of us as soon as we came in the door. Big, comfortable room....cute bar downstairs next to a warm fireplace....simple good breakfast in the morning. We'll stay here again.", u'We spent a night in Pittsburgh between Christmas and New Year\'s. We like "old and historical", so my husband booked a room at the Priory. We weren\'t disappointed. The room was clean and well-appointed. The bar, lounge and breakfast area were comfortable and inviting, and decorated for Christmas. The staff was helpful and friendly, especially the young lady in the...\n\n\nMore'], 'title': u'The Priory Hotel, Pittsburgh'}
{'rating_string': u'4.0', 'review_count': u'53', 'address': u'875 Greentree Road, Pittsburgh, PA 15220 (Formerly BEST WESTERN Parkway Center Inn)', 'review_list': [u"This was my first time to Pitt to see the Penguins play and if I come back , this is the place to stay . From the outside ,it's not fancy but trust me on this hotel , if it wasn't for them, our trip wouldn't have been as good as it was. Our shuttle drivers Greg Gabe and Paul...\n\n\nMore", u'The weekend stay was very nice. The staff was very professional and welcomed us. We had a problem with hot water in our shower and the problem was addressed in a timely matter. Our breakfasts were great and the staff worked very hard to keep the foods available and warm.', u'Unlike some of the previous reviewers, we had a perfect experience at this hotel. Our philosophy is to save money where we can so we can take use the saved money for more trips. That means we are not looking for the "absolutely best" rated hotel in Pittsburgh, we are looking for "value" hotels. For us, this hotel is an...\n\n\nMore', u"The hotel itself isn't far from downtown. You can save a bit and stay here. Be warned though, there isn't too much close by, at least not in walking distance. The front desk staff is great. Colleen was very accommodating and offered us the chance to get into the room an hour before check in and gave us a room...\n\n\nMore", u'The hotel lobby is very nice not what you typically see from a H.I. express. The hotel has a nice indoor pool and fitness center. The free breakfast in the morning was delicious.The room was a little small but nice. The bed was very comfortable. The only complaint I have is the thermostat had a hard time regulating the heat....\n\n\nMore', u'This hotel and the staff are GREAT!!! The hotel has wonderful amenities, pool, breakfast and workout room! The staff was incredibly helpful! We wenter for a concert and they provided shuttle service! Highly recommend for you next weekend stay in Pittsburg!!!!', u'Jasmine and Eva were very helpful when we arrived. Gave us restaurant recommendations in the area, and were extremely personable. The room was nice and clean, and the bed was comfortable. Will stay here again when back in the area.', u'Staff very helpful. We booked for Steelers game. Used the shuttle service to downtown. A good brisk 20 minute walk to the stadium from where they drop you off. Room was spacious and clean. No premium channels on tv. Would of expected it for the price we paid for the room. Did not eat the breakfast because it was hot...\n\n\nMore', u"I booked a reservation because I love IHG and I'm a platinum member. After driving for 5 hours I get to the hotel and I go to check in. I only have a prepaid credit card so I only have enough for the room on my card. The front desk attendant said that I needed the amount for the room...\n\n\nMore", u'I recently stayed here for 3 days. I landed at the airport at 2pm thursday and called for a pick up. I reached the hotel and checked in. The lobby is comfortable and clean. My room was very nice and quiet. There isnt much in the area. I walked to the Giant Eagle nearby and loaded my fridge with my...\n\n\nMore'], 'title': u'Holiday Inn Express Hotel & Suites Pittsburgh West'}
{'rating_string': u'4.5', 'review_count': u'244', 'address': u'134 Bakery Square Blvd, Pittsburgh, PA 15206 ', 'review_list': [u'Newly renovated rooms with separate shower & toilet & walk-in closet, separate desk-dresser/sofa entry area - clever and with such comfortable beds - a winner! What we enjoyed was how breakfast offered fresh blanched spinach with salsa as options to accompany scrambled eggs & 2 selections of sausages and all the others usual cereal & hot oat options. Convenient parking...\n\n\nMore', u'Here for a college tour and loved that the hotel had a van that would take you short distances. Did not have to rent a car and drive in the winter weather. Rooms are very nice, large in size and offer a seating area to spread out. Breakfast was adequate. Overall I would recommend!', u"Stayed there for a nice on a business trip, great location, close to hospital and local restaurants/gyms. Good breakfast, quiet rooms. Had problems with airport shuttle, my shuttle driver Joanna and front desk concierge Shawnie were awesome! They helped me get my luggage on the airport shuttle and on my way just in time! If I'm back in town will...\n\n\nMore", u"I had the chance to stay here last weekend. It's a really nice newer SpringHill Suites. The location is great. Super close to trader joes and restaurants. I love the access to LA Fitness. A very nice little getaway!", u"We used this hotel to accommodate out of town guests for my son's wedding. They gave us a nice group discount and were very helpful and thorough in communication and follow-through. The hotel itself was lovely with spacious rooms and also provided a nice breakfast. Lauren Marchitelli was our co\xf6rdinator and provided excellent service throughout, thank you!", u'This hotel was a great choice for our family getaway to Pittsburgh. We had a car, so getting about town was easy. Parking is $15 per day, on top of room costs. Clean, modern, spacious - everything you need for a comfortable stay. Breakfast was included and was very good - fresh food, lots of variety, some hot choices. Beds...\n\n\nMore', u'I stayed at the SpringHill Suites Pittsburgh Bakery Square with my six year old son for his first Pittsburgh Pirates game and then a next day trip to Idlewild Park.\nI stayed at this hotel using a free Marriott reward night, otherwise, I would have stayed closer to downtown. The hotel is located a few miles outside of downtown Pittsburgh,...\n\n\nMore', u"Newer hotel. Best way to explain the room...you feel like you're in an IKEA demo room. if you've been to IKEA you know what I mean. Clean, modern sinks, showers, faucets. Pocket doors offer greater room space. Room has the toilet & additional sink located separate from shower/large sink. Highly recommend!", u'Loved my stay at this new and modern hotel in Pittsburgh. Excellent location in a new development. Room was very spacious with large screen TV, refrigerator and microwave and a very nice work area at the desk. The buffet breakfast was outstanding. My only complaint and the reason I do not give them the 5 stars is that the overnight...\n\n\nMore', u'Ryan, BIG THANK YOU for your time and service! Thank you for taking the time to talk to me and to reps at Marriott Rewards! We will definitely be making future reservations there. Thank You again for your service!'], 'title': u'SpringHill Suites Pittsburgh Bakery Square Hotel'}
{'rating_string': u'4.0', 'review_count': u'453', 'address': u'3315 Hamlet St., Pittsburgh, PA 15213 ', 'review_list': [u"We stayed here For two weeks after surgery. Very clean. Great location my only complaint is the breakfast. Didn't have many options and nothing for anyone that needs to eat gluten free. And the elevator is always freezing. Staff is great", u'Friendly staff. Excellent shuttle service! Free breakfast. Convenient parking!!! Convenient to many top Pittsburgh locations. They even provide a paper to you in the morning! I would recommend staying there anytime. We have stayed there many times', u"Never stayed at a Hampton Inn before. I was pleasantly surprised by the quality of the room, breakfast, and staff. Will definately stay with Hampton Inn again (in fact, I did the next night). That's all I want to say but I need a minimum of 200 characters before I can submit the survey so I will just keep typing...\n\n\nMore", u'We were attending a sports event at the Univ. of Pittsburgh so this was well located for us. There was a free shuttle and the driver, Rick, was awesome. He was always available and prompt in picking us up when we called. He gave us good information about the area we were in. The ladies at the front desk, Shanna...\n\n\nMore', u'Great staff, very helpful. One particularly outstanding person is Rick, who drives the shuttle service. Really the level of service he provided was so accomodating, it was almost more like a free taxi service, getting me exactly where I wanted to go exactly when I wanted to get there... plus a really friendly conversationalist as well.', u'This hotel is very conveniently located downtown and close to several of the local hospitals. A hot breakfast and friendly staff make this hotel a pleasure to stay at. The rooms are quite comfortable and the hotel was very clean.', u'This Hampton was wonderful. We checked in around 5pm with Stacy and Shauna at the desk and they were a pleasure. They are friendly and just seemed to enjoy what they do. They reviewed all information with us about the hotel (breakfast, check out, free shuttle, parking, etc). They recommended a few options for dinner and even gave us a...\n\n\nMore', u"Hampton Hotels just never disappoint...this was yet another in a string of Hampton stays that was wonderful. Great beds, great rooms, great amenities (especially for the price!)...you just can't go wrong. Thanks so much!", u'Older property but well maintained and clean. Staff was very nice and accommodating. Located very close to medical centers in Oakland, just minutes from hospitals. They do take small pets which they charge extra for to cover the cost of extra room cleaning.', u"I've stayed in Hamptons several times and had great experiences. The staff at this hotel went above and beyond to help my family. The free shuttle is extremely convenient. We were able to go to a lot of attractions in the surrounding area. The help from the front desk was great too."], 'title': u'Hampton Inn Pittsburgh University/Medical Center Hotel'}
{'rating_string': u'4.5', 'review_count': u'401', 'address': u'5405 Fifth Ave, Pittsburgh, PA 15232 ', 'review_list': [u"I loved this roomy, well appointed room! Beautiful and comfortable furnishings. Convenient location for our over night visit to Shadyside. I'm a very light sleeper, however, and being right next to the elevator was not a good thing for me. Also, parking is very, very limited and not well lit.", u"This hotel is converted apartments and the resulting charm is stunning, the pics don't do it justice. We were able to check in 2 hrs early even with the St Patricks Day crowd. The best part is that downtown Shadyside is a couple blocks away and has the most eclectic shopping and restaurant choices you could ask for. We ate...\n\n\nMore", u"This was my first experience at Shady Side, but my husbands second time there. I couldn't understand his enthusiasm for returning but once inside I got it. Well appointed throughout with comfy beds, linens and plenty of seating in the living room. The bathroom & kitchen are small but clean. Our two bedroom cost less than the other one bedroom...\n\n\nMore", u'We stayed for three nights in February 2015 while our son was auditioning at Carnegie Mellon. The location was great, about 3/4 mile from campus. We were able to walk to CMU, the Carnegie Museums, and nearby shops and restaurants (despite lots of snow and quite cold temperatures!).\nAs a family of 4, we really appreciated having the kitchen and...\n\n\nMore', u'We had to go to children\'s hospital last minute n first night stayed at a "name brand hotel" wish I would have picked Shadyside first!! It was closer than the other n we felt right at home. Never cramped n in each other\'s way n my 7yr old was ecstatic that he had his own room. The best part is...\n\n\nMore', u'My son and I had a wonderful stay at this hotel. As we were there for 4 nights we wanted a convenient location (to Universities), a comfortable two bedroom apartment with a useable kitchen and access to a laundry. This hotel had all those amenities and more - the staff were incredibly friendly and helpful and the apartment was very...\n\n\nMore', u'In town because my son was in the hospital, Tried Hotel Tonight and decided on Shadyside Inn because of the great rate and the apartment style rooms. Great location, easy access to Walnut street and Shadyside. Loved the full kitchen and the room since. Staff was very helpful and pleasant. Very good option for a room while in Pittsburgh. Price...\n\n\nMore', u'The price was very reasonable for the two bedroom suite. The property and room was clean, comfortable and contemporary. The location just two blocks from the shops and restaurants in Shadyside and on Fifth Avenue close to Oakland/Universities/Parks, etc.', u'I stayed two nights while my father had surgery at Shadyside Hospital. It was a perfect arrangement - close enough I could walk to the hospital & to a wonderful selection of shops & restaurants. The staff was extremely helpful, friendly & accommodating (the welcome bag was thoughtful!). Having a parking space provided was a plus. The apt, was clean,...\n\n\nMore', u"Even on the phone this group of people makes you want to stay in Pittsburgh as long as you can. I stayed in a suite half the price per night of anywhere I've been in two years and far nicer than where I live. Everything was plush but the nicest part of all was the pleasant and accommodating, interested and...\n\n\nMore"], 'title': u'Shadyside Inn All Suites Hotel, Pittsburgh'}
{'rating_string': u'3.5', 'review_count': u'102', 'address': u'1000 Park Lane Drive, Pittsburgh, PA 15275 ', 'review_list': [u'The staff were very friendly, and the breakfast had a lot of variety. The shuttle to the airport was excellent. The amenities (towels) could be better. The hotel is located in a nice area, with restaurants and shopping.', u'This is my second stay here. The hotel had been under renovations and I was expecting some of my issues with my last stay to have been corrected. The woman when we checked in was very nice, very friendly. Go to our room, we are on a floor that is half renovated. New carpet, new beds, new bedding, there are...\n\n\nMore', u"Stayed here last week, and it was great. They were doing some work outside, so it was a bit of a messy parking lot. That's to be expected with work going on, though. My only complaint about the room itself is there were a couple of hairs in the tub. Could have been from housekeeping cleaning cloth. Just cleaned it...\n\n\nMore", u'We have stayed here twice. my wife and I along with our son really enjoy this place. The staff was very friendly. The place offers a nice place to relax in a outdoor park atmosphere. And even enjoy playing basketball with my son and others staying at the hotel. And the breakfast buffet offered a very nice variety. Hoping we...\n\n\nMore', u"Despite mixed reviews, we decided to try this for a Park n' Fly at Pittsburgh Airport because they had the longest Parking Period that fit our travel. We chose this in part because the hotel manager Mr. Walsh seems to read and respond to every online consumer review, which we think is a good sign for hotels. Let me start...\n\n\nMore", u'Have stayed a number of times here and will continue to stay before early flight. Great early transport to airport. They are remodeling the third floor but there was no noise issues during stay. Room was clean and tidy. Had to leave before breakfast so the in room kitchen was great for my breakfast. Would be a great place for...\n\n\nMore', u"I work in hotel management, so to say I'm a tough critic is probably putting it lightly. I checked into this hotel fairly late and I was warmly greeted by Bill and his wife. They were very helpful in getting me checked in and arranging the shuttle for me the next day. My room that I stayed in was very...\n\n\nMore", u'This may have been one of my worst stays ever in a hotel. We stayed here one night before our 6am flight out of Pittsburgh. The room was Ok, not real clean and had a big iron burn on the carpet. We went to bed early so we could get up at 4:00am to get to airport. The walls were...\n\n\nMore', u'I stayed at this hotel 9/27-9/28. I was visiting Pittsburgh to see a Steelers game. The hotel was away from downtown but is near plenty of shopping and restaurants. It took maybe 15 minutes to get to Station Square which is where we parked for the game and took a ferry to Heinz Field.\nThe hotel looked brand new and...\n\n\nMore', u"This was a stop-over on a trip. Nothing exceptional about this place, but adequate and a good value for the money. Fairly clean, plenty of room, full kitchen (although we didn't need it). The breakfast was pretty sparse, but we found enough to get us going for the day. I would stay here again if looking for some place to...\n\n\nMore"], 'title': u'MainStay Suites Pittsburgh Airport Hotel'}
{'rating_string': u'4.5', 'review_count': u'363', 'address': u'1320 Centre Ave, Pittsburgh, PA 15219 ', 'review_list': [u"After being given a list of hotels to choose from for my son's hockey tournament - Three Rivers Cup, I selected Cambria Suites. From the moment I was put in contact with Sharon, she took great care of us! Our team had tickets to the Penguins game so it was super convenient to walk right next door to the arena....\n\n\nMore", u"I've seen other reviews that might be low and I must say that the staff must have had an off day because everyone we came in contact with was great.\nRight off the bat though are my few complaints:\n1. Small breakfast buffet is 12 bucks when most places now offer it free. I am big on Hamptons for doing...\n\n\nMore", u'Stayed for Garth Brooks concert, it was an easy check-in even though the place was swamped with fans. Very friendly man at the front desk as well as outside when we pulled up to the parking area. When we arrived both elevators were working, then one went down but it was repaired before the evening was over. Very clean and...\n\n\nMore', u"Very disappointed in our stay. We came for a Garth concert. We just needed to check in, go to concert, go to bed, check out. What could happen, right? In our very short stay, here was our experience:\n--the person at the front desk was THE rudest service employee I've ever encountered. She was surly to the person in front...\n\n\nMore", u"Stayed here on a weekend getaway with the wife. The price was alright, and they had a hot tub. That's all we were looking for.\nKnowing what I know now, I don't think I would stay again unless I was coming to Pittsburgh for a Penguins game. The room was cozy, and the front desk staff was exceptional.\nThat being...\n\n\nMore", u"The rooms at the Cambria Suites are a perfect size and the bathrooms/showers are great. If you're going to anything at Consol, stay here. The walk is easy, but the hotel is even better. Even if there is a better deal elsewhere, it is worth the money. Solid pool/hot tub and a workout room that will do the trick for...\n\n\nMore", u'We stayed at the Cambria to see Bob Seger concert at Consol Energy Center very convenient, staff very friendly and helpful. Rooms were large, very clean and quiet. The bar and restaurant were good. It was nice we never had to leave the hotel except to see the concert. If you go to event at the Consol this is the...\n\n\nMore', u'Having seen the recommendation of a friend, and given its location adjacent the Consol Energy Center, I was willing to go outside of all my loyalty programs and try out a Cambria Suites. The rooms are top notch, the exercise/pool/hot tub areas are very nice too, and although I never needed to use them, the eating and bar area seemed...\n\n\nMore', u"The Cambria was the hotel my husband and I chose for our first Consol event. The room is nicely laid out, well appointed, clean and quiet. The convenience to Consol can't be beat and is well located for exploring the city. The staff is friendly and very helpful. I had stayed here before which impressed me and after this recent...\n\n\nMore", u"My wife and I make a trip north to watch a Penguins game and when we do, our hotel of choice is always Cambria Suites. You can't beat the convenience to the arena (right next door) and there is a Subway and TGIFridays around the corner from the hotel, offering good food at the right price. Our suite this time...\n\n\nMore"], 'title': u'Cambria Suites at Consol Energy Center Hotel, Pittsburgh'}
{'rating_string': u'4.5', 'review_count': u'482', 'address': u'555 Trumbull Drive, Pittsburgh, PA 15205 ', 'review_list': [u'My family and I stayed here with our dogs while in town for a long weekend and it was the best pet friendly hotel we have ever stayed at! Everything was incredibly clean and well taken care of, staff was so nice, and the free breakfast was delicious and different each morning! We also like that the parking is free...\n\n\nMore', u"We were here for the weekend and everything was really pleasant except the bed was sooooo uncomfortable. It had no support what so ever.. It's a shame because everything else was great- the staff, maids, hot breakfast, location not too far from downtown for a really decent rate. However, because of the bed issue I will not return to this...\n\n\nMore", u'We decided to stay in this Hampton Inn because of good experience at other Hampton Inn facilities. Nevertheless, this facility does not live up to the par. The front desk staff was not very pleasant for some reason. There is no shampoo and conditioners in the room. There are three bottles of body lotion instead.', u"I stayed there on March 6th with my 2 adult children. We got in late and then ran out to WalMart because we had forgotten a few things. When we got back, close to 1:00 AM, we tried the side door with our key card. The swipe didn't work. My daughter pulled the door handle and it opened. No key...\n\n\nMore", u'Pre & Post-Op @ AGH was most comfortable, affordable and easy accessible. Front desk staff, Van driver & breakfast staff were most courteous and helpful. Room/bath/motel - well maintained, clean and generous with amenities. Quiet and comfortable.', u'I decided to stay here because of the wonderful 6 inches of snow. After securing a deal on the app Hotel Tonight-- $77 compared to the $115 the Hilton Website charged. I arrived (after hitting the pothole that was under the snow) and walked in.\nThey were having a reception and I received a free alcoholic beverage, that is a...\n\n\nMore', u'Stayed here on our way north. A bit of trouble finding the hotel because of road construction detours but found the facility to be very good. The staff are very friendly and helpful especially with restaurant recommendations. The room was very comfortable and clean. The breakfast and breakfast facility was very good. We would definitely stay here again.', u'To sleep well I need quiet or a steady white noise. The fan of the HVAC in this hotel turns on and off all night, disrupting my sleep. The temp was fine, but there was no way to fix the fan in the on position.', u"This was our second stay at this Hampton Inn and it did not disappoint. We didn't spend much time at the hotel but did enjoy our one night there. Bed was comfy. Our room wasn't ready when we checked in so they gave us the room next door. Very nice of them. I wish they had mouthwash in the bathroom...\n\n\nMore", u"Hampton Greentree was clean, well equipped with TV, microwave, frig, coffee maker. Complimentary breakfast was wonderful. Especially liked the complimentary shuttle service. Will take you to areas in downtown Pittsburgh and then pick you up. Great for concerts or sporting events. You don't have to worry about getting there and then having to park your car. This hotel was easily...\n\n\nMore"], 'title': u'Hampton Inn Pittsburgh/Greentree Hotel'}
{'rating_string': u'3.0', 'review_count': u'95', 'address': u'100 Kisow Dr., Pittsburgh, PA 15205 (Formerly Travelodge Pittsburgh)', 'review_list': [u'Very outdated, rooms are cold and moldy. Heater is dirty and load, never shuts off. Wifi internet slow just like the dial up. Shower is hard to operate, really have to pry on the handle with all my weight to turn the water on or to regulate the temperature. Looks somewhere else people!', u'So far I realize you get for what you pay for for $50 per night. This Independent hotel is run by Indians who do not clean the facilities very well. Smelled like Under armpits which Curry dishes smell like. Also they got my room incorrect in the beginning since my room was supposed to have a refrigerator and microwave. I...\n\n\nMore', u"It's a basic place to stay close to Pittsburgh. The bed was comfortable, free breakfast (cereal, bananas, bread, donuts, orange juice, tea. coffee), free wifi, free parking. No elevator. The front desk staff are friendly.", u'Room is unclean, staffs are unfriendly. Many stuff are broken in the room, awful breakfast, not cheap fare. Never come cleaning staff(even if you stay here multiple days)・hope they impofove this bittom confiton as soon as they can.', u'Came in for the Colts game only room available within 7 miles. Room was nice and clean. Their breakfast sucked and they call it continental breakfast????? Breakfast was only bread, donuts, 2 choice of cereal, coffee and apple juice. For the price and to get one night sleep it was okay.', u'My husband and I came in for a preseason Buffalo Bills versus Steelers game. Check in was smooth and employee was pleasant on Saturday afternion. We Asked for extra pillows and towels, and we were given them with no problems. Rooms were clean, no odors and nothing was too out of date. Rooms were spacious and comfortable with the ability...\n\n\nMore', u'Clean beds. Floors in our room were stained.Bathroom was clean. Had a big dent on the tub though. Looked like someone was angry and kicked it. Plenty of towels for 2 people. Out dated TV. Actually "snowed" which is crazy for this decade. Quick check in and out. Overall. Good overnight stay.', u'I have stayed here on 3 occasions in rooms 238 and 239, the room are nice, the wi-fi is very good and the staff are great and they loved my kids! I highly recommend this hotel! Also very quiet which is great for me since i must get up very early!', u"I stayed here for one night on my way to Niagara to explore Pittsburgh and the experience was average. Room was clean and all electronic equipment's were in good order. They provide free parking and breakfast(you are not allowed to take in room) which is good deal at such price. Pittsburgh downtown is just 4 miles from this place.\nI...\n\n\nMore", u'Stayed here recently strange people hanging about seems like people are living there sadly but anyway the room I had was disgusting the smell was bad the bathroom smelled of strong urine there was a hole that looked like it was kicked in under the tub a bare hole they do not clean these hotels after they just cut corners...\n\n\nMore'], 'title': u'Hilltop Inn PIttsburgh Motel'}
{'rating_string': u'3.0', 'review_count': u'490', 'address': u'900 Chauvet Drive, Pittsburgh, PA 15275 ', 'review_list': [u'I recently stayed in the Microtel Inn and Suites closed to the Robinson Township of Pittsburgh. I thoroughly enjoyed the stay. The Staff were very friendly, The rooms were very clean, The location was great, near restaurants and stores. Over all my stay with them was very enjoyable.', u'We stay here before and after an overseas flight out of Pittsburgh Airport. We are able to leave our car (have left it for as long as 44 days). The shuttle service is very convenient, as they start really early in the morning. Included breakfast is nice to have, as it saves time getting out. Desk clerks are polite and...\n\n\nMore', u'One positive is the internet speed. Arrival staff and shuttle driver were very unfriendly which set the tone for our stay. However the morning after, the front desk staff and a different driver were helpfully and cordial.', u'Adequately clean and nice enough for one night and convenient to the airport. The staff was courteous and prompt.', u'This Microtel is located near the Pittsburgh International Airport in a major shopping district. Very safe location. Continental breakfast was average. Room was clean and comfortable. I qualified for the AARP discount and got the room for $59 plus tax - great deal.', u'Our stay was made special by the way Autumn at the front desk professionally handled our check in, our local directions and our questions and made sure we were happy with everything at Microtel. People like Autumn make travel a pleasure- wish more hotels had people like her.', u"I would've paid extra to spend money at any hotel around instead. When we pulled up, there was no parking at all. It was minus 20 wind chills outside. It snowed a few inches and the side walks were completely covered. No one shoveled or salted. We went out for dinner and once again no parking when we came back....\n\n\nMore"], 'title': u'Microtel Inn & Suites by Wyndham Pittsburgh Hotel'}
{'rating_string': u'4.0', 'review_count': u'515', 'address': u'112 Washington Place, Pittsburgh, PA 15219 ', 'review_list': [u'This was one of the best hotel experiences we have had. Very helpful staff and great facility. Clean rooms. Nice pool. Would suggest adding a hot tub. Workout area was very nice. Shuttle was also helpful. Parking was a bit of an issue as our SUV would not fit in the garage so we were forced to valet park which...\n\n\nMore', u'Great hotel with easy walking distance to see the Penguins. Front desk staff and valet were very friendly. The waitress on the bar needs to smile as she was quite miserable. The room was perfect and very clean. I will recommend to all and will return.', u'Check in was a breeze; front desk was wonderful. Kiara went out of her way to ensure we knew the ins and outs of the hotel and area. We used points for one night and paid for the second night. Our reservations were merged so we did not have to check out and back in again. Thanks so much Kiara!...\n\n\nMore', u'This Marriott is very clean, great location and the staff was wonderful! Our room was nice with an awesome shower. The bed was so inviting. It was quite and a good price to park downtown. We rode the shuttle to another location which saved us money.The bar was a nice place and again great service.', u"Went to a concert in December at the Consol Energy Center & found this to be a convenient location across the street.\nI was slightly disappointed as the room as showing it's age. For being a Mariott & the price I expected a little more upscale. The room was very average, it could have been a Fairfield. The lobby area...\n\n\nMore", u"Like all marriott properties, this place is very well kept. Even though it's downtown it is fairly\nIt was a nice touch that they gave me a welcome card for extra points or a complimentary drink in the lounge.\nAlso, it's nice they serve food in the lounge until midnight.\nKeep up the good work.", u'I stayed here for a conference and liked some aspects but was very disappointed by others. All the meeting rooms were on the 2nd floor, easy to find, perfect connection to very high speed internet (this was true throughout the hotel, though I did not pay for it and am not sure if it was free because of the conference...\n\n\nMore', u'The Marriott City Center is all that you expect from a full service Marriott with attention given to friendliness and cleanliness. The night that I spent here happened to coincide with a night of two back-to-back sold-out Garth Brooks concerts and all the attendant traffic and crowds that it brought. I was impressed by how he Marriott was able to...\n\n\nMore', u'This hotel provided very well for our conference of about 250 people. The only problem was that some of the technology for presentations was not quite up to par. There were wavy screens that made the information on the Powerpoints hard to read. However, the meals (included with the conference) were good and served with dispatch. The bedrooms were spacious....\n\n\nMore', u'We stayed at the Marriott City Center while traveling for a hockey tournament. The staff was extremely helpful, polite, and accommodating. We traveled with small children, which enjoyed the nightly free hot chocolate.\nThe room we got was “no-frills”. Two double beds, a bathroom, a single serve coffee maker. We were on the 12th floor and had a good view...\n\n\nMore'], 'title': u'Marriott Pittsburgh City Center Hotel'}
