{'review_count': u'33', 'title': u'Hotel Indigo Pittsburgh East Liberty', 'rating_string': u'5.0', 'address': u'123 North Highland Ave, Pittsburgh, PA 15206', 'review_list': [u'Had a great time here in this gorgeous hotel. We will definitely be staying here again. The valet parking was super convenient, especially with all the snow in the city. Patrick the front desk guy was so nice. Thanks for taking care of us!', u'Did a quick two day trip to Pittsburgh to enjoy some restaurants(great scene, loads of new places) and some shopping.\nChose new Hotel Indigo to use some IHG points/free night from credit card. Would certainly go back on paid nights as well.\nUpgraded to a corner room with a lot of space for 4 of us. Outlets available all over...\n\n\nMore', u"I have to thank the entire staff, especially the manager Patrick, for making my unexpected snow delay so much more tolerable. I couldn't have felt any more appreciated as a guest and everyone went out of their way to make me as comfortable as possible when having to extend my stay twice due to winter storm Jonas! I look forward...\n\n\nMore", u'A colleague and I (and my family) were in town for a business convention a week ago. We drove in on a Friday and checked into our hotel. It was horrible (not 1 good thing to say about it), so we checked out - at this time it was about midnight. We called around to several other hotels in downtown...\n\n\nMore', u"We had a truly superb experience from check in to check out. It was our first Hotel Indigo stay (although we're Platinum IHG) and we love the idea of a unique space designed for each neighborhood. Our room was phenomenal and the service was unparalleled. The only smudge came from room service--those pancakes are awful--but their over easy eggs were...\n\n\nMore", u'We had no intention of staying here. We had eaten dinner in Point Breeze and decided before driving home to the north hills to drive over and see where the new Ace Hotel was located. While we were driving by we saw the Hotel Indigo sign and decided to investigate. We pulled over, looked it up on my phone and...\n\n\nMore', u"This was pretty much a brand new hotel when I stayed, full of the usual quality you'd expect from the Hotel Indigo Chain.\nThe staff were all very welcoming and friendly and the hotel of a high quality. Breakfast is fantastic and portion size is massive although they did get my order wrong on one of the four mornings and...\n\n\nMore", u"Great staff!!! We enjoyed out NYE overnight stay. The room was great but I have to say that the staff was awesome from greeting to departure. Nice rooms and comfortable too. Breakfast room arrive was really great too. It's a little out of the way from downtown but with Uber was no big deal. We will be back!", u"Great atmosphere and service. Cool rooms. Definitely staying here again. Perfect location on the heart of the upcoming areas of Pittsburgh.staff was excellent and very polite. Bar and Restaraunt were great. Almost didn't need to leave the hotel for an evening out. Looking forward to out next stay.", u"Nice Indigo hotel in East Liberty. Will recommend for business or pleasure. Beautiful and modern deco. Solid structure so you don't listen your the other rooms. Elegant and yet casual. Very comfortable rooms. Don't forget to eat at the restaurant.\nFriendly staff m. Thumbs up!!!!"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/09/0c/da/b0/hotel-indigo-pittsburgh.jpg'}
{'review_count': u'2859', 'title': u'Omni William Penn Hotel, Pittsburgh', 'rating_string': u'4.5', 'address': u'530 William Penn Place, Pittsburgh, PA 15219', 'review_list': [u'My wife and I stayed in Pittsburgh Jan 16-18 as a get-away weekend. I chose the Wm. Penn because I know it is a local tradition, it received great reviews and the price was more in line with our budget than some of the "resort" hotels outside the city. It was cold during our stay but the hotel was warm...\n\n\nMore', u'I highly recommend the William Penn to anyone visiting Pittsburgh. The hotel itself was in amazing shape and is truly a gorgeous hotel. With that being said, over the course of my stay there was a power outage and a fire alarm. Now that can happen anywhere so it is what it is but I will say that the fire...\n\n\nMore', u"Served its purpose as a decent hotel close to Consol Arena, which was within easy walking distance. However, I was a bit disappointed overall. The room was lacking in flat surfaces to place things -- I basically ran out of space even though I only had a small carry-on bag's worth of stuff and a takeout pizza.\nAlso, something --...\n\n\nMore", u'Great old elegant hotel. Good place for downtown Pittsburgh. Food at restaurants is tops. Food and lodging little pricey compared to suburban venues but not compared to downtown hotels locations. It is 100 years old so the look is vintage. The rooms are all updated and very nice.', u'Service is excellent at this hotel. It is a beautiful reminder that an older hotel can be maintained well. It is a beautiful hotel with a lovely feel to its ambiance. Their staff knows that you are why they are there and you will be treated in an excellent manner.', u'Visited the Speakeasy at the Omni William Penn after dinner celebrating a birthday. Very nice environment. Staff was great and attentive, and very knowledgeable of menu offerings and drink creations. The d\xe9cor, high back booths and comfortable seating arrangements made for the perfect end to an excellent night. Moscow Mule was excellent, as were the other drinks we ordered. Will...\n\n\nMore', u'Beautiful hotel, great clean rooms. The staff is very helpful and friendly. Cool history of the hotel and apparently a few haunted rooms. Great food and a starbucks built in to the lobby! Some of the views are absolutely spectacular.', u"We came here for a recent Springsteen concert. I thought why not book somewhere nice for the event.\nThis is a storied hotel and the building has the character to prove it. I have no complaints with the accommodation save for the water that continuously ran through the heater. But the service is spotty and that's not to say that...\n\n\nMore", u'Nice location, but a bit dated, Bathroom very small for the suite I was in. A bit noisy. There were many restaurants within walking distance. Downtown Area appears safe but no shopping in this area for women', u"I frequently travel for business so I have had a lot of experience staying in hotels. I chose the Omni William Penn for it's location and proximity to my work-related event. The Omni is absolutely gorgeous -- the lobby is elegant and everyone is friendly and welcoming from the moment you walk in the door. My room was exceptional. It...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/03/c0/76/a5/omni-william-penn-hotel.jpg'}
{'review_count': u'307', 'title': u'Hotel Monaco Pittsburgh', 'rating_string': u'4.5', 'address': u'620 William Penn Place, Pittsburgh, PA 15219', 'review_list': [u'The hotel had a great atmosphere, really funky d\xe9cor but it works. Great location in downtown Pittsburgh. The restaurant in the hotel, The Commoner, was delicious. Even better, they had a complimentary wine and beer happy hour every evening. Overall, great experience and we would stay again.', u'The hotel was great. The staff was very helpful and friendly. The room was comfortable and pretty d\xe9cor. Very quiet and a good sleep. They had a free wine and beer welcome party which was nice. My normal pet peeves of no mirror by the desk. Wish the toilet/shower was separate from the sink area. Makes it easier when 2...\n\n\nMore', u"I stayed at the hotel for a night and loved my experience. The Commoner (1920's style restaurant and bar within the hotel) had a great ambiance and friendly service. The hotel itself is eclectic with so much to look at. I walked around just to explore all of the decorations! My room was the cleanest I've ever experienced at a...\n\n\nMore", u"I couldn't recommend this hotel more highly. My husband and I and our two kids ( ages 10 and 12) travelled to Pittsburgh for a Bruce Springsteen concert. We have stayed at so many hotels and we couldn't fault the Monaco. From the friendly check in to the awesome pre concert drinks where they even put Bruce on the iPod...\n\n\nMore", u'Great hotel kudos to Tommie who works the front door and his partner ( a young female, my bad I did not get her name) they set the tone for those luxury hotel with a boutique feel. Not stuffy at all just nice people who do everything to accommodate you. Rooms are comfortable, decor is eclectic and fun. Great vibe...\n\n\nMore', u"We come to Pittsburgh about 3 or 4 times a year to visit my family and we have stayed in probably 15 different hotels searching for one that would really wow us. I think we've finally found our winner. Monaco is centrally located downtown an easy walk from a bunch of nice restaurants. The decor is trendy, and the rooms...\n\n\nMore", u'My husband and I stayed here when we were celebrating our wedding anniversary. The staff is amazing and the rooms are great. Fun wine hour and the food at the commoner is fantastic. Sweet little surprise was left for us while we were out. Located right in the middle of everything.', u'My husband and I stayed here over the weekend and were celebrating his birthday. We had a beautiful spa king room which had the coolest decor. This place is totally out-of-the-box which we absolutely loved, from the room furnishings to the color of the rooms of the doors. Christian was great at check-in and offered us 2 cocktails in the...\n\n\nMore', u"We stayed at Hotel Monaco for one night while in town to see a concert, and immediately began planning a return trip. The decorations were quirky and fun, the bed was comfortable, and the staff were polite and efficient. I'd highly recommend it for a couples trip.", u'We booked the Monaco for 2 nights over the weekend and arrived by train from NYC to find the hotel had been overbooked. The front desk offered a room at the hotel next door. Disappointing as we picked the Monaco for its modern boutique feel. The front desk manager got onto the front foot and gave us a comp dinner...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/07/4e/66/37/monaco-pittsburgh.jpg'}
{'review_count': u'626', 'title': u'Fairmont Pittsburgh Hotel', 'rating_string': u'4.5', 'address': u'510 Market Street, at Fifth Avenue, Pittsburgh, PA 15222', 'review_list': [u'I stayed at this hotel for one night. It was very nice and the staff made me feel welcomed immediately upon arrival. The room was large, nicely decorated and very clean. The bed and pillows were divine. I loved how the room had coffee service with plenty of condiments and cream, not just a little packet. The lobby is very...\n\n\nMore', u'be careful when booking your rooms, the hotel does not promise the one that you have booked well in advance. booked two queen beds and hotel overbooked and offered us a single bed with a cot. 229.00 to sleep on a cot.', u'Stayed here 1 night in January 2016 to attend Bruce Springsteen concert, and turns out the Boss was on the 23rd floor. Very cool (saw Max in the lobby). Beyond that, this is a very nice hotel in a great location. We stayed on 19th floor and it was very quiet and room was very comfortable. Only complaint: $15 for...\n\n\nMore', u'The only reason that I gave the Fairmont a 5 rating is that is the highest it goes. The hotel itself is very nice, rooms are spacious and modern. The gym is much better than I expected. I think the thing that sets the Fairmont at a higher level is the quality of the staff. If you ask any of...\n\n\nMore', u'We booked a stay here approximately one month before a concert we were planning on seeing at The Consol Energy Center. The price was mid priced, around $250.00. The hotel was beautiful and stylish. The rooms were beautiful as well. We originally booked a king size deluxe room which gives you a room on a higher floor. We arrived early...\n\n\nMore', u'I stayed at this hotel because it came highly recommended - everything was top notch. I was escorted to the check in desk and my room keys were waiting for me. I was also escorted to the elevator by the young woman who checked me in.\nRooms are well appointed and have robes, slippers, tea pot, keurig and honor bar....\n\n\nMore', u'Review of our stay - Beautiful hotel, friendly staff, clean and well-appointed rooms. Great central location and super pet friendly! Would definitely return.\nReview of the wedding we attended - delicious food, attentive wait staff, gorgeous ballroom.\nThe only negative was that our rooms were not ready until after 4 PM on the day of our arrival, but it was...\n\n\nMore', u"The hotel is in a great location, within walking distance of many desirable destinations-- like Prantl's Bakery! When I was making the reservation on the phone, I mentioned to the staff member that we were celebrating our anniversary. Upon our arrival, we were treated to a bottle of champagne and some delectable chocolate treats! The room was modern, complete with...\n\n\nMore", u'I spent a weekend at the Fairmont Pittsburgh in Oct. 2015, and greatly enjoyed my stay. The hotel is very nice: the rooms are tasteful and have great views; the decor is modern; the restaurant serves a fine (although not inexpensive) breakfast, and the service from the hotel staff is excellent. But the best amenity the hotel offers is its...\n\n\nMore', u'Best place to stay in Pittsburgh. Walking distance to most downtown attractions and restaurants. Spa and gym are amazing. Stayed for Christmas and had a view of the Christmas market from room. Live jazz in lobby nightly.'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/07/80/c3/ef/1-king-bed.jpg'}
{'review_count': u'991', 'title': u'Hampton Inn & Suites Pittsburgh - Downtown Hotel', 'rating_string': u'4.5', 'address': u'1247 Smallman Street, Pittsburgh, PA 15222', 'review_list': [u"Hampton Inn's are somewhat cookie cutter, let's be honest. As long as they are clean they are good. What can make one better than the others? Staff and location are two variables and this Hampton Inn wins on both counts.\nLet's start with the staff. From the front desk to the housekeepers, everyone seemed genuinely happy to be there. They...\n\n\nMore", u'An excellent hotel with all the services you could want. It is located in Downtown Pittsburgh next to the Convention Center and close to all the major venues. The rooms are very clean and comfortable.', u'Having stayed at many Hampton Inn hotels this one was the best. Clean, comfortable, and very accommodating. Everyone super nice! The Heinz museum is located across the street and there is a bunch of great restaurants close by.', u'This is a very nice, but typical Hampton Inn. It is a great location if you are headed to the civic center. They have free parking and you can park yourself. It is convenient to the expressway and there is the museum across the street. The pool is very small. The complementary breakfast is great. They have waffles, eggs, meat,...\n\n\nMore', u"We love Hilton, but we needed to go out of our way to express what a lovely property this was. The staff here is what makes this hotel. Your entire staff has a professional and kind demeanor. Our first trip to Pittsburgh wouldn't have been nearly as wonderful if it wasn't for them giving us directions around town and telling...\n\n\nMore", u'I am a frequent Marriott hotel stayer however on a recent stay in Pittsburgh we opted to stay here instead and I have to say that I was not disappointed. Not only did I get a great night sleep the staff was amazing as well. I have to say thank you to Del and Maria for entertaining my little girls...\n\n\nMore', u'Was our first time to Pittsburgh, this hotel was on our radar Because we are honors members. The hotel was clean, right downtown, you are within walking distance to restaurants, Heinz museum (right across street). Famous Primanti Bros was maybe 10 blocks! Which I highly recommend. If you get a room on the back side you get amazing views of...\n\n\nMore', u'The Hampton Inn and Suites Pittsburgh Downtown was one of the best I have ever stayed. The service was excellent. People working the front desk went out of their way to answer questions and help. The location was perfect. There was free parking and breakfast. The breakfast was better than most hotel "free" breakfasts. The hotel was clean and the...\n\n\nMore', u'It is located in downtown Pittsburgh, convenient to go everywhere in the city. Free parking is the plus. However, the room and the bathroom are not clean. The booking system also had issue when checking in and out, waste of time.', u"We were greeted by Derek at the front desk and he was extremely welcoming and upgraded us to a king suite (we didn't even ask) and we were allowed early check-in. The location is perfect. My wife and I walked everywhere in Pittsburgh and even if you have to Uber/taxi, everywhere is a short ride. Very clean hotel and FREE...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/01/7d/3e/07/hampton-inn-suites-pittsburgh.jpg'}
{'review_count': u'461', 'title': u'Residence Inn Pittsburgh North Shore Hotel', 'rating_string': u'4.5', 'address': u'574 West General Robinson St, GPS use 214 instead of 574, Pittsburgh, PA 15212', 'review_list': [u'History: Built in 2010\nLocation: North side of Pittsburgh across Allegheny River from downtown. Across the street from PNC Park where Pittsburgh Pirates play.\nInterior Decor: Newer styled Residence Inn with contemporary Mediterrenean colors.\nExterior Apperance: 10 story hotel in brown/beige colors. Attractive.\nOutside view from the room I stayed at (901): Wrong sides - Instead of downtown or PNC...\n\n\nMore', u'After an extensive online search, we four (parents, adult daughter and grandmother) found this two bedroom/two bathroom w/ kitchenette suite to be perfect. We used Uber for longer transportation needs, but the hotel shuttle was perfect for trips within a 3 mile radius. The staff was quite accommodating. The included breakfast was perfect for our tastes with fresh fruit, eggs,...\n\n\nMore', u'Great location a few minutes away from the downtown. Reasonable suites good for family trips. The suites are modern, with all the conveniences you need. Great shuttle service to surrounding attractions. The hotel is right across the street from the stadium so the neighborhood has zero charm and is rather deserted. However the are several bridges nearby that lead to...\n\n\nMore', u'I had the chance to speak with the property manager after my stay. My issue was with check in and the person I checked in with, His name was Dylan. The worst Marriott employee I have every dealt with,. Dressed in dirty clothes, very argumentative at check in, too busy on the internet when I needed some toilet paper later...\n\n\nMore', u'I have traveled to numerous Residence Inn hotels throughout the country, but after this visit at this location...never again. When we entered our suite, we were so pleased. The decor was nice, the room was very comfortable, I just felt at home until my husband pulled back the blanket and called me over to take a look. I was disgusted....\n\n\nMore', u'There are many nice things to say about this property. However, there was a concern regarding the elevators, and I want to share some info with fellow travelers first.\nWe did get stuck in the elevator, though only for a few minutes. In summary, if you push more than three floors on the elevator button panel, the elevator decides to...\n\n\nMore', u"We were in Pittsburgh for a couple days and decided to stay at RI given a good rate (low season, before the holidays). It was pretty well located close to downtown (across the bridge). The neighborhood seemed safe and clean. Outdoor parking was still expensive $25 but wasn't valet and allowed you to go in and out as much as...\n\n\nMore", u'Stayed just after Thanksgiving and had a great stay. Will definitely be back again. We requested a high room and were on the 8th floor. They let us check in about 30 min early and when we asked for stadium side I think she did the best she could but we still faced the highway a bit. Traffic noise was...\n\n\nMore', u'We stayed at the Residence Inn North Shore for one night and found it to be a very comfortable and relaxing stay. If you are in Pittsburgh for a baseball game, this hotel is literally across the street from PNC Park. And Heinz Field is a short walk away. There are many restaurant choices which are just a stroll away....\n\n\nMore', u"I stayed here for a Pitt game with my husband and 2 year old son. My son typically gets VERY bored in hotel rooms- it's just not enough space for him- but we did NOT have that problem here. We were in a studio king room and there was so much room! There was a kitchen with a full-sized fridge,...\n\n\nMore"], 'img_url': u'http://static.tacdn.com/img2/x.gif'}
{'review_count': u'450', 'title': u'SpringHill Suites North Shore Hotel, Pittsburgh', 'rating_string': u'4.5', 'address': u'223 Federal Street, Pittsburgh, PA 15212', 'review_list': [u'Stangely I am reviewing a hotel I have yet to stay at. Made a reservation error for a trip 6 weeks out. Called immediately and no resolution possible. Always enjoyed staying at Marriott, but will no longer choose to do so. Seems shortsighted customer relations. \U0001f61e\U0001f61e\U0001f61e fine print strikes again!', u"Had I not been there for a business trip, it would be a great hotel to stay in to watch a game. It is within walking of the stadium and restaurants.\nIt appears very new on the inside but I wouldn't think it would be new because of the location.\nIn any case, it was clean, comfortable and very reasonably...\n\n\nMore", u'I debated whether to give this 4 stars or 5 stars. However it will be a 5 for me.\nPros:\nNice sized suites\nClean rooms\nFriendly staff\nGood breakfast\nVery centrally located. Great restaurants within walkable distance.\nCons\nThe towels were old ( a bit worn out)\nThe bathroom was a bit dirty(not the cleanest) when I checked in\nThe...\n\n\nMore', u"Probably one of the better one nighter hotels I've been at. Was easy to get back and forth to the arena with the shuttle. Room was clean and comfortable. Didn't have a problem sleeping like I do at the Hilton Inns. Late night swim was great. Breakfast was meh as most North American places. Wireless was great. Would definitely stay...\n\n\nMore", u'Beautiful hotel, very close to downtown , we only stayed one night for a hockey game but will be returning. The staff was very friendly and informative. Our suite was beautiful very comfortable and clean. The breakfast was included with waffles, coffee, fruit, yogurt etc.', u"Stay was great, could have been made better by two small items. Room 309 - the toilet seat needs tightened and the big thing - the smell of grease and exhaust from the restaurant below. The stay wasn't ruined by the smell, noticeable as soon as we entered the room, but it prevented it from being perfect.\nI was surprised...\n\n\nMore", u"I come to Pittsburgh once a month for work. I travel to the suburbs when I am here. This it's nice to be in the center, so I commute out.\nI have stayed at this location 4 times now and it will be my go to. There are a few reasons for this:\n1) staff is very friendly and helpful....\n\n\nMore", u'The rooms are nice. The bed was comfortable. The room had a Keurig coffee maker but only had 1 reg k-cup and 1 decaf k-cup. I think they should put at least 2 of each as my wife and I both drink reg coffee. So I just waited till on my way out when I went thru the lobby and...\n\n\nMore', u"A great location for experiencing all the downtown has to offer. The King suites offer a great layout with a large sitting area and wet bar area. The complimentary local shuttle was an outstanding service for our large group as we travelled about the city to celebrate my wife's 40th birthday.", u'This hotel was great. You are right next to PNC Park plus Heinz Field and Console Energy Center are really close. They do a free shuttle within 3 miles of the hotel which was wonderful. Its very clean the rooms are really nice and the restaurant/bar was fantastic serves food late at least on the weekend. I would come back...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/04/0f/20/ca/springhill-suites-north.jpg'}
{'review_count': u'1139', 'title': u'Renaissance Pittsburgh Hotel', 'rating_string': u'4.5', 'address': u'107 6th Street, Pittsburgh, PA 15222', 'review_list': [u"I have stayed here a few times and everytime it's great. Service is wonderful...rooms and hotel is updated and gorgeous. I've also been here for a wedding and it was amazing-great views of the city frm the ballroom and rooms. I think this is the best hotel in the city by far! Great location-close to stadiums and all that's going...\n\n\nMore", u'Visited the RV Show in Pittsburgh a few weeks ago. We always stay here when we travel to Pittsburgh. The rooms are clean and the bed are comfortable. The views from the river view rooms are beautiful. The food is delicious! We love getting the mussels! The staff is friendly and helpful. The hotel is close to PNC Park and...\n\n\nMore', u'Room description stated " large room on club level with view of the city". Our room was on the club level but the view most definitely was not of the city. The room was comfortable but the wind howled all night, making it difficult to sleep. One bright spot was Mary at the front desk. She is always cheerful and...\n\n\nMore', u"The hotel is very clean. The staff is very pleasant and accommodating. The bar and dining area offers a great selection for food and drinks. Everything is close to the stadium and downtown local attractions. No need for a cab everything's in walking distance. Room was comfortable and clean as well bathroom was very spacious great downtown hotel", u'This hotel has a great location right across the river from both PNC Park and Heinz Field as well as the Andy Warhol Museum. A super nice staff and a really beautiful atrium. The room is comfortable and had a nice view of the two stadium.', u'The hotel was beautiful. The room was comfortable with a gorgeous view. The service was great and the staff was very friendly. We will definetly stay there again!! Next time we will take more advantage of all the amenities.', u'Incredible hotel! Will definitely be back. A very magnificent, historical hotel in downtown Pittsburgh along the Allegheny River. You can do the Valet Parking for $35 plus about $5 for a tip, or park yourself beside the hotel in a parking garage for $20 for 24 hour parking. The bed was exceptionally comfy and the room was really clean.', u"I love this hotel! I visit Pittsburgh fairly regularly, but this was my first stay at the Renaissance. I was very happy with everything about my stay starting with an easy check-in and quick check-out. It's a great location if you have business downtown. The hotel is in a beautiful old building which was wonderfully restored. It's a nice mix...\n\n\nMore", u'nothing bad to say -- we upgraded to a corner room - it was worth it,\nthe staff was friendly,\nthe location was great (a lot of nice restaurants around )\nthe bed was comfortable\nwe will return\nin the past we paid for valet (something like $40 plus tip) -- this time we self parked across the street and...\n\n\nMore', u'Was in Pittsburgh for business. The staff at the Renaissance was excellent. Beginning with the Bellmen, to the front desk staff, to the house keeping staff. I had a room that had a view of Heinz Field and PNC Park. Great location and there are many places to eat that you can walk to.'], 'img_url': u'http://static.tacdn.com/img2/x.gif'}
{'review_count': u'274', 'title': u'Sheraton Pittsburgh Hotel at Station Square Hotel Motel', 'rating_string': u'4.0', 'address': u'300 West Station Square Drive, Pittsburgh, PA 15219', 'review_list': [u'Decided to take a mini trip on the same weekend a major storm hits! Front desk woman was very pleasant, definitely loves her job. King size bed with river view! Loved! Yes the train does comes by but really not an issue. Bed was super comfortable. Used the fitness center very nice and well kept. Nice pool area. There was...\n\n\nMore', u'I stayed here only one night for a business meeting in the hotel. Check in was fast, friendly and professional. I was given a room on the 14th floor and it had a great view. The Sheraton is located right on the river. My view was of the river and the city.\nMy room was clean and very comfortable. The...\n\n\nMore', u'So many great things to say- Found a great deal on another site. We were so lucky! Paid extra for a river view which was so worth it. Just beautiful views at night. Right next to a train track (maybe 2 trains a day?) which was a bit of a setback but we hardly heard it on the 8th floor....\n\n\nMore', u"This is a so-so hotel. There are plusses and minuses but, overall, I don't think I would stay here again.\nThe pros: the room was overall okay, I slept well here, the wifi worked as expected (clearly throttled but at the advertised rate), and check-in and check-out was quick and professional.\nBut then there are a bunch of niggling cons....\n\n\nMore", u"Clean & comfortable room, beautiful views of the river & city. Shopping, transportation, the Incline all in walking distance. Parking garage literally next to the hotel. Very convenient and the staff was excellent! Really enjoyed our stay! We'll stay here again!", u"I am an SPG Platinum member with a lot of experience with the Sheraton brand. This is one of the nicer one's I've stayed at - it was modern and clean. Neat lobby atrium. Very large pool (which seemed to be open all night long!) Our room had an awesome view of the river and downtown. the woman running the...\n\n\nMore", u'We arrived December 30th. Parking was a bit pricy at $21 a day. Seeing and passing by station square looked promising when we arrived.\nInside, the rooms were clean but was outdated.\nWe quickly found out that the trains run throughout the day. No wonder they give ear plugs.\nSince we arrived in the evening, we checked out the food...\n\n\nMore', u'The hotel was nice, clean and quiet. Not too many people in there over the Christmas holiday so that might have attributed to the quietness. The overall hotel, dining area and room were clean, staff was friendly and Christmas buffet breakfast was the bomb. Our room faced Station Square and part of the river, so it was a nice view....\n\n\nMore', u'Small rooms. Inconvenient parking in a parking structure on the other side of the block, but valet was available. Close to Fort Pitt and overlooks a beautiful park. Upscale lobby with complimentary fruit infused water and lovely grand piano.', u"I admit I'm a clean freak but when the candy wrappers and filth lay in all four corners of the elevator for the duration, something is wrong. The common areas and pool and hot tub areas (ewwww, chunks of wet paper and hair lying around) were poorly kept and the room was no exception. Crumbs and a few feathers littered...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/08/35/9c/02/exterior.jpg'}
{'review_count': u'666', 'title': u'Hampton Inn Pittsburgh/Greentree Hotel', 'rating_string': u'4.5', 'address': u'555 Trumbull Dr., Pittsburgh, PA 15205', 'review_list': [u'We booked this hotel because of its location. Easy to get into the city and onto the parkway west. When the major storm hit the staff made the necessary moves for us to spend another night. They do have a shuttle service to major sites in the city\n.', u'We thoroughly enjoyed our stay. The staff made the dogs feel welcome and the room was very clean. The complimentary breakfast was better than most other hotels. The only problem we had was that the king bed with sofa bed room was tight for a family of four traveling with two dogs. Other than that, everything was great!', u'I had a great experience at this Hampton Inn. The front staff was very friendly and accommodating. The room I stayed in was very nice and clean. The fitness center was very nice and clean as well. I could not have been happier with the service I was provided during my stay. I will definitely stay there again if I...\n\n\nMore', u'We arrived at the Hampton inn at green tree on Saturday 1/16 because we came to Pittsburgh for a penguins game all the way from New York. As we arrived in the corridor there was a strange odor walking in but that was the least of our problems. Checking in the guy behind the counter was bland and looked as...\n\n\nMore', u'We picked this hotel because of location close to downtown Pittsburgh but not in busy City. It is close to shopping and Robinson Township shopping and restaurants. The hotel is clean, the staff was good - we enjoyed our stay. Food rate a 7 on a 10 scale. Good staff.', u'This hotel is clean, spacious, conveniently located and had a very helpful staff. Breakfast was both free and good. We highly recommend out.\nOther amenities include free WiFi and parking as well as a shuttle that goes to major attractions.', u'My most recent trip to Hamilton Inn Greentree was my fourth time staying there. They are always so helpful and friendly. The shuttle service to and from the game not only saves money, but the shuttle driver was nice and friendly, and even gave us a small "tour" of the unknown spots in downtown Pittsburgh. They are very accommodating to...\n\n\nMore', u'Loved this pet friendly hotel tucked into a hillside right off the Parkway. Super friendly staff and the room was perfect. Loved being able to have our furry family member with us during our trip to Pgh. Breakfast was just right and our well behaved dog was welcomed in the lobby/dining area as was a little kitty kept in its...\n\n\nMore', u'We visited along with our daughter, son in law and 2 grandsons. We had 2 rooms and both were excellent. Our daughter also had their dog and there was no extra charge. The location is great with lots of free parking. The breakfast which is included has everything you could want. The hot items changed each morning. This hotel had...\n\n\nMore', u'This hotel is awesome, smooth check in... Beautiful rooms, clean and newly remodeled. Excellent buffet breakfast lots of "open seating" with Tv and coffee bar We will be BACK! The price was excellent, we got to the hotel 1 hour before checkout and got into our room within 5 minutes!'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/08/32/4d/58/hotel-exterior.jpg'}
{'review_count': u'623', 'title': u'Hyatt Place Pittsburgh-North Shore Hotel', 'rating_string': u'4.0', 'address': u'260 North Shore Drive, Pittsburgh, PA 15212', 'review_list': [u"If you're accustomed to Hyatt Place's this one will not disappoint. Free breakfast and some great views of the city. If you are going to an event at PNC Park or Heinz Field this is the place to stay. Hotel was extremely clean and staff was very courteous", u'In town for Springsteen concert at Consol. Was greeted by Nathan upon arrival for check-in. He was extremely friendly, made sure I was aware of any relevant information and answered my questions about the public transportation-the "T" is right across the street and gave us easy and quick access to downtown and Consol, then to Southside and back to the...\n\n\nMore', u'Overall my stay was good. The room was clean and the bed and pillows were very comfortable. The location was excellent, very close to the activity (casino) we had planned for the evening. I would recommend the Hyatt to my friends.', u'The Hyatt Place was very affordable and conveniently located to downtown Pittsburgh and the North Shore. I cannot say enough about the friendliness and accommodating nature of the staff. They made me feel like family! The room was clean and functional (could use a small amount of updating) and met all of my needs. I would definitely stay at this...\n\n\nMore', u'Free and tasty hot buffet breakfast! Very helpful night staff (we checked in at midnight) It was a fast and easy check in! Beds were so comfortable.Location is about a block walking distance from Heinz Field, a great variety of restaurants in walking distance, across from great view of the river. All in all, a great stay!', u'What a great, little find! Loved the service of the staff, the little bar off reception was a hoot! Nice breakfast (very attentive staff to refill the quantities of food to keep everything "fresh" on the buffet). Great room. Couldn\'t have asked for more! Try the phenomenal steakhouse across the street, Hyde Park. The place is phenomenal!!! Thanks for a...\n\n\nMore', u"Best place to stay if you are going to a Steelers game! Great hotel with an awesome staff. Well worth the money. The internet in our room wasn't the best but it worked in the rest of the hotel just fine.", u"Easily accessible from the interstate and very close to downtown on the North Shore of Pittsburgh. Check-in was fast and efficient. Staff was very friendly. The king room was clean and comfortable. Complimentary continental breakfast was satisfying and above average. Super modern decor. What more do you need? Wouldn't hesitate to stay here again.\nArea surrounding the hotel was quiet...\n\n\nMore", u'I love coming to my once a year favorite CLOSE, CLEAN and FRIENDLY Hotel! They make you happy, and the close proximity of the stadium is wonderful! This has been my 4th year at Hyatt North Shore and I will never stray to another hotel ever again! I tried and moved back to my comfort. You will not be disappointed....\n\n\nMore', u"The hotel staff was friendly. The hotel itself felt secure. My room was spacious, clean, and perfect for my stay. The location was great for my needs, and the shuttle service was an added bonus! Breakfast with the room was a nice feature, although I didn't make use of it on this trip. Perhaps on my next trip I will...\n\n\nMore"], 'img_url': u'http://static.tacdn.com/img2/x.gif'}
{'review_count': u'576', 'title': u'DoubleTree by Hilton Hotel Pittsburgh-Green Tree', 'rating_string': u'4.0', 'address': u'500 Mansfield Avenue, Pittsburgh, PA 15205', 'review_list': [u'This hotel is an older hotel but they have done a very nice job of keeping the interior up to date. I mention it being older only because of some minor issues with it, bathrooms are very small and elevator makes a lot of noise. Neither of these issues would keep me from going back. Overall room size is very...\n\n\nMore', u'Hit all the musts when traveling with a kids sports team. Pool, restaurant, wi-go, bar for parents. We stayed in tower three and the rooms were a bit run down. Peeling paint on bathroom door as there are no vents.\nComfy beds and the kids must have kept the kitchen running on cookies.', u"I've been coming to this hotel for 10+ years, and it just seems to get better every time. The staff treats you like family and goes out of there way to help you with anything u may need or want. The bartenders are the friendliest around, front desk is very helpful and accommodating , the shuttle drivers have so much...\n\n\nMore", u'My wife and I went to Pittsburgh, PA, last month on an unplanned visit. The hotel we usually stay in was booked up and the appointment rep recommended the DoubleTree Inn. We said OK and hoped for the best - and that is exactly what we got.\nThe desk staff were very friendly and helpful, even when we asked for...\n\n\nMore', u'This is our second stay at the Green Tree Hilton. When we were there 3 years ago, much of it was under reconstruction, so it was nice to see all of that completed. We stayed here because a group of friends was visiting Pittsburgh to attend Pitt wrestling duals. One of our friends has a son who wrestles there. While...\n\n\nMore', u'Hotel is in a safe area and convenient to the city. The hotel, as with most Double Tree, is clean and comfortable. The staff is friendly. I recommend this hotel for business and family. The bar/restaurant is fairly priced and the burger and wings were tasty. The food mart offers Starbucks Coffee and pastries although the pastries did not taste...\n\n\nMore', u"Stayed here twice; huge room, friendly, helpful staff; extremely clean & modern. Ordered a burger and peach cr\xe8me brule (sp?) from the on site restaurant and it was one of the best I've ever eaten. Loved all the on-site extra accommodations. Listed on the PA state-approved list of hotels.", u'Wonderful. Clean, comfortable, close to shopping. Hilton Honors floor is the best. It was a great treat to walk eight out of my door and get fresh coffee in the morning. Staff very helpful and friendly.', u'I like to try different pet friendly hotels when staying with our little dog and this one was one of the best so far the front desk help was great and helped you anyway they could the restaurant had a good atmosphere and good food the pool and hot tub was refreshing', u'The rooms are clean, the food is delicious, and the staff is kind and welcoming. Kelly from the Bistro always goes above and beyond to satisfy customer needs. She even remembers my name.5 Stars Kelly.'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/09/81/1c/51/champions-lounge.jpg'}
{'review_count': u'93', 'title': u'Cambria Hotel & Suites Pittsburgh - Downtown', 'rating_string': u'4.5', 'address': u'1320 Centre Ave, Pittsburgh, PA 15219', 'review_list': [u'I have been here a couple times now and have had a great stay every time. The hotel lobby, restaurant, pool, and gym are all very nice. The place is very clean. The rooms have a cozy feeling to them. More importantly than the place itself are the people that work here. Everyone is so welcoming and helpful. Mandy and...\n\n\nMore', u'This was a trip to Pittsburgh for my daughter to attend a seminar downtown. We had stayed at this hotel several times previously to attend Penguins games at Consol Energy Arena which is attached to the hotel. The rooms are large, modern and feature two flat screen televisions in each room. The rooms are clean ,the bed comfortable and the...\n\n\nMore', u"Great property next door to Consol Energy Arena. Stayed there to attend a concert at Consol. Room had plenty of space with a sitting area with TV, couch, chair, desk. Bed area had it's own TV. Also has microwave, fridge, Keurig coffeemaker, nice sized bathroom w/shower. Had a bar/restaurant in lobby. Limited menu but enough choice if you're not up...\n\n\nMore", u'We were a large sports group of families the staff was accommodating from the time of checking in--Jackie the General Manager as well as Rachel the group coordinator and Erica at the front desk as well as John and Eric they made sure the whole weekend meet our satisfaction. Rooms were impeccable and large would definitely recommend to anyone visiting...\n\n\nMore', u'We loves the service from the bar (Jon ) and the front desk was awesome (Kelby)!! Love watching the games here and the food was really good too!! Pittsburgh is an awesome city to visit, and the people are really nice too!!', u'Really enjoyed this hotel! So convenient for hockey games. Tia and Eric checked us in and explained the shuttle and other amenities. The lobby is fun before games, bar was crowded and we got a beer from the Labatt girls. Will definitely stay here for another game, the rooms are huge and cleaned well.', u'Pros-Location, inexpensive parking, coffee in room, friendly front desk crew (Erica and Tia) and bar/”restaurant” staff, nice lobby and easy access to parking, big bed, TV, desk and nice d\xe9cor.\nCons-Very firm uncomfortable bed, cold water if showering after 9:30 in the morning, no choice in coffees offered, no replenishing of coffees, no removal or replacement of glasses used, mold...\n\n\nMore', u'Property is older and hard to find even with GPS. Staff was helpful but had to physically check my room to make sure it was empty (not a big deal really). Parking is unclear without asking since it is next door to an arena (almost attached?). Room had two tvs and big shower with modern sink area. Very nice for...\n\n\nMore', u'I found the Cambria excellent for the overnight stay I had in Pittsburgh. The rooms are very spacious--plenty of room for four. (It says it can sleep up to six, but that would be pushing it. The bathroom was impeccable. Very clean and well maintained with modern fixtures. Love the in room Keurig! Staff extremely friendly. Just know that parking...\n\n\nMore', u"I visited this hotel for one night for a business training seminar and must say that I was pleasantly impressed. This was my first time being in Pittsburgh, and while in town, was meeting with a colleague to see my first NHL hockey game ever! I didn't realize how close it was to the arena; just a short walk across...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/01/c2/0b/09/cambria-suites-at-consol.jpg'}
{'review_count': u'1192', 'title': u'DoubleTree by Hilton Hotel & Suites Pittsburgh Downtown', 'rating_string': u'4.0', 'address': u'One Bigelow Square, Pittsburgh, PA 15219', 'review_list': [u'The location of this hotel was very convenient for getting around downtown on foot. It was lovely and clean. Great customer service at the front desk. There is a well-stocked 7-11 mini-mart attached to the hotel which my teenaged children thought was heaven on earth. The room was clean and quiet - but small. The bathroom was especially cramped. The...\n\n\nMore', u'Part of the pleasure of a Doubletree, I admit, is getting a free cookie which is always pretty good, and often warm, when you check in. So while I contained my disappointment at no mention of a cookie and none in sight, it’s a small ding.\nThe room we chose in online check-in was ready and available—but had we known...\n\n\nMore', u"The hotel itself was nice. It was very clean and the room was fine. However, the parking situation here is horrific. We stayed for New Year's Eve and waited for almost 45 minutes just to get into the garage. We had 3 rooms for 3 couples but only 1 of us actually got to park in the garage. When the...\n\n\nMore", u'Book this hotel after getting ticket to see Springsteen. Hotel close to Consol Energy Center. Maybe 2 long blocks. under 10 minutes walk depending on traffic.\nThe rooms were nice seem to be an older hotel. Very clean and very friendly staff. From young cleaning girls to hotel parking staff. The restaurant/bar was close and that was a major bummer....\n\n\nMore', u"Went for a concert at Consul Arena, so it was nice that we were less than 5 minutes away. The rooms are pretty dated and the bathroom is extremely tiny, but other than that it served it's purpose. The restaurant was closed, so we can't comment on that, but the breakfast that was offered was very good. Parking was easy...\n\n\nMore", u'Nice staff but the hotel was an older hotel and even with all the updates it still was an old property where they just put lipstick on the pig. Also there was no bar or restaurant since it was under construction so the bar and breakfast were just in a makeshift conference room. Not bad for the price but there...\n\n\nMore', u'was a pleasure, very clean rooms, comfortable beds room service was a treat and the shuttle service was great did not have to rely on any other transportation. Pool was very relaxing. We will utilize this hotel again', u'My 7 yr old son and I decided to do an impromptu stop while driving through... we absolutely loved it here. Staff were so helpful and friendly, and the glass rooftop pool area on the third floor was nice. We were on the 18th floor nestled in all of the downtown buildings, which is exactly what my son requested -...\n\n\nMore', u"Rooms decent, noise from room above intolerable. Had to ask management to either get it under control or move us. 2nd night, dogs barking in hall, screaming drunks at 2AM were crazy. We aren't overly sensitive and normally put up with a lot, but this hotel seemed to be full of nut cases. Restaurant was disappointing as well. Since it...\n\n\nMore", u'I have stayed at this hotel several times for Pens games and have always been impressed with kindness of the staff and the hotel is very clean. There has never been a question that was not answered with many different options. The game was in walking distance and made for a great experience for my son.'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/06/6a/5a/7a/doubletree-by-hilton.jpg'}
{'review_count': u'643', 'title': u'Pittsburgh Marriott City Center Hotel', 'rating_string': u'4.0', 'address': u'112 Washington Place, Pittsburgh, PA 15219', 'review_list': [u'I had participated an event organized here. I must say there was nothing particularly bad with the hotel, but also nothing excellent. Location is great, walking distance to downtown.\nA bit worn room, limited soundproofing, noisy AC (cannot be switch off). Conference facilities are however nice, but the buffet meals were below average with some exception. On the other hand...\n\n\nMore', u'Not only is the hotel conveniently located (across the street from the Consol Energy Center) the accommodations were wonderful and the staff was helpful. I loved having in/out parking privileges as a hotel guest and also receiving complimentary wi-fi access as a Marriott rewards member. I ordered room service (a mushroom, swiss burger with sweet potato fries) and the food...\n\n\nMore', u'Great Location. Very nice Marriott. They did the most they could to accommodate the Springsteen overload. The lobby is a little small, but they did the most with the space they had. Large Starbucks in the attached conference center is really nice. Great to have a full service Starbucks right there!', u'This is a very clean, well-run hotel close to the Consol Center. The lobby and bar are sharp looking and inviting. Our room was quite large, clean and comfortable. And the staff was courteous and attentive from the valets, the bellhops, the front desk, and the women running the breakfast buffet. It is surprising how often that is NOT the...\n\n\nMore', u"Very clean and when we checked in the additional requested amenities were already stocked in our room (towels, feather pillows and liquid soap).\nIt's in walking distance to the Consol Center. On Friday and Saturday the hotel bar stays open until 2pm, but the bar is very small with almost no seating, so hanging out there after an event can...\n\n\nMore", u"We love staying at this Marriott when we are in Pittsburg! Before you even walk in, the high quality customer service is apparent. The bell hops go out of their way to make sure you are greeted, make small talk when they aren't busy and you are waiting, and don't just point in the direction of where you need to...\n\n\nMore", u'Stayed for 2 weeks in December on business. Hotel is a good location and is within walking distance of many restaurants and a 15-20 min of most of downtown. Staff was friendly and helpful. Stayed in 2 different rooms which were both were clean and comfortable. The fitness center was nice and offered several treadmills, ellipticals, some dumbbells and one...\n\n\nMore', u"I traveled to Pittsburgh for two football games during Halloween Weekend: the Wagner College-Duquesne University game on October 31st and the Steelers-Bengals game on November 1st and, needing a hotel room for the evening of October 31st, chose Marriott Pittsburgh City Center. The hotel couldn't be easier to find; just follow the signs for Consol Energy Center (home of the...\n\n\nMore", u'Checked in for one night to catch the Leafs/Penguins game. The valet was extremely friendly and offered to leave out car upstairs if we were going to need it later tonight as it may take over 30 mins to get the game to bring the car. Cody at the front desk was extremely pleasant. The hotel is usually nice. Rooms...\n\n\nMore', u'We stayed here during the holidays visiting family. The staff was very friendly and helpful. The room was inexpensive and we were upgraded to a suite as Platinum members. There are some dated items like the carpet but other upgrades like robes and nice furniture. On the 19th floor we had a nice view of Mount Washington We walked to...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/07/53/e0/0d/marriott-pittsburgh-city.jpg'}
{'review_count': u'334', 'title': u'HYATT house Pittsburgh-South Side Hotel', 'rating_string': u'4.5', 'address': u'2795 South Water Street, Pittsburgh, PA 15203', 'review_list': [u'This Hyatt concept has all the amenities a business traveler expects. close to several dining and retail options, business center has easy access plus a good clean hotel in an up and coming area of Pittsburgh. Not a fan of their sports teams but I am now of the city.', u'We stayed at The Hyatt House south side Pittsburgh for two nights. Of course Pittsburgh is not a fun city to drive in, the staff at Hyatt House was sure to let us know of the shuttle service available. They also pointed us in the right direction to all surrounding amenities, such as restaurants, night life, etc. The hotel is...\n\n\nMore', u'I have stayed various places around the south side of Pittsburgh over the last 12 months and have found the Hyatt House to be in a great location with clean and comfortable rooms. I try to stay there whenever possible.', u'Located next to many restaurants. Very clean and comfortable rooms. Linens were impeccable. Bar prices in the hotel were a bit higher than expected but there were many other drinking establishments nearby. Beautiful facilities.', u"I can't tell you how many times I've stayed here, but I love it. There's so much to do, all within walking distance. Even for the things that aren't, it's very well-situated to jump onto the Parkway in either direction. The accommodations are top notch, the staff is always very courteous and helpful, and their breakfast is a good way...\n\n\nMore", u'We stayed at this hotel for a January Saturday night in a one bedroom suite with "partial view" of the river. The room was big, very well designed, and we had a great view of the river and the city. The hotel was quiet and the continental breakfast was extensive given that it was free (the omelette bar was great!)....\n\n\nMore', u'xWhat a great hotel, we had a beautiful view of the river. At night the lights along the river were awesome. The hotel is new, well laid out and very comfortable. For business travelers this is the place I would want to stay - kitchen, work space, living space, great bathroom with all the amenities. For leisure travelers - it...\n\n\nMore', u"This is a newish hotel, which means it's clean and everything works. Nice, comfortable beds. The size is great with a nice kitchen (why a cheese grater). The living room area is the one downside. The seating area is really uncomfortable. The only solution is to bring pillows from the bedroom and use those to lean on. Location is really...\n\n\nMore", u"My wife and I spent Saturday night while attending a wedding in Pittsburgh. The hotel has a great location in the South Site, and rooms are simply great - spacious, comfortable and clean. Low point was the 'mandatory' valet parking and the overall poor customer care - which, sadly, we found to be widespread in the city.", u'I have no complaints about this hotel. The location is excellent for shopping and dining. I had a one bedroom suite and it was huge. You do have to walk through the bedroom to get to the bathroom which is a bit of a pain when someone is sleeping.\nThe bathroom was large - and very clean.\nThe breakfast was...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/04/20/4d/93/hyatt-house-pittsburgh.jpg'}
{'review_count': u'504', 'title': u'The Westin Convention Center Pittsburgh Hotel', 'rating_string': u'4.0', 'address': u'1000 Penn Avenue, Pittsburgh, PA 15222', 'review_list': [u"I was very happy with my accommodations at the Westin. Room was clean, bed was comfortable and the staff was friendly. Great location as well. Didn't eat at the restaurant, but had a drink at the bar, which was fine.\nI'd definitely recommend the Westin when staying in downtown Pittsburgh.", u"Two of our other colleagues who were at this hotel the week prior both had to call security for starters, so that wasn't a good impression of the hotel before I even made the trip down to Pittsburgh. One called because a hotel employee arranged for his child to celebrate their 18th birthday in the hotel room next to my...\n\n\nMore", u'I stayed during a non-busy time and had no elevator issues. I found the staff to be very helpful and friendly, including in the restaurant. The rooms were adequate, but seemed a little tired. The location was great for access to most places downtown.', u'Mister Marvin The Doorman at The Westin Hotel Pittsburgh is an awesome gentleman. He makes me feel welcome when I arrive after a long drive from Reading or wherever I have driven from that day. He always remembers my name. A great experience to be greeted in such a friendly fashion. Well done!!!', u"We attended a dance convention. The staff was really friendly and went out of their way to help unloading the car, checking in, and getting our stuff to the room. We also had excellent room service for the two nights we stayed, however, it was a bit pricey (but isn't all room service?). Room was clean and the beds were...\n\n\nMore", u'We stayed for one night, and it feels like we spent most of it waiting for an elevator. When elevators finally did arrive, they were packed with people complaining about -- wait for it -- the elevators. The Westin has installed a system in which you touch the floor you are going to and a computer picks your elevator. This...\n\n\nMore', u"Location was good but for the money we stayed at the Monaco which is by far much better. The new elevator system was a hassle and the staff wasn't super friendly. I would say this is a typical business hotel nothing stood out.", u'Take it from a very seasoned traveler. This is a 5 star property; the fifth star awarded because of the charm and helpfulness of their front office manager, Jaclyn Wombacker. She turned a small frown upside down. Was in town for the weekend visiting local colleges with my daughter. Super stay!', u'Overnight Manger Rachel hooked me up with a great view and a wonderful room. I called ahead and told them I was proposing to my Girlfriend (she said yes). She also hooked us up with a bottle of champagne and room service for the night. Johnny the overnight room service attendant was super fast and courteous. Best view of the...\n\n\nMore', u"We stayed here for the downtown New Year's Eve celebration. The service and staff was excellent and it was nice having our car in a heated garage. The view from our room was great.\nThe room was very nice and above average. Very clean and staff very responsive when we wanted extra blankets. But you can hear everything in the...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/05/5b/ee/23/traditional-king-room.jpg'}
{'review_count': u'126', 'title': u'Crowne Plaza Pittsburgh West-Green Tree Hotel', 'rating_string': u'4.0', 'address': u'401 Holiday Drive, Pittsburgh, PA 15220', 'review_list': [u"I've never stayed at this hotel /never been to Pittsburgh but drove in for the 1st night of the new Bruce Springsteen Tour ...Brrrrucccce...ok, enough of that...The hotel had everything I needed and expected. The lobby/front desk were helpful/available, arranged a shuttle bus for me,\nthe housekeeping staff on the floor were great - they assisted with a few things...\n\n\nMore", u'A nice hotel with ample parking and more than comfortable accommodations. The room was nice and the restaurant on site was great for dessert and drinks in the evening. There was an event going on that weekend so they had a special menu, but when I expressed that I wanted a certain dessert, they were more than happy to accommodate....\n\n\nMore', u"Loved the hotel. Was very accommodating for our first trip to see the STEELERS play the Colts. Nicely updated and decorated for Christmas. There were shuttles to the downtown area but we made friends at the bar and took a cab instead with them. The shuttles didn't start until 5pm and we wanted to get down there to have some...\n\n\nMore", u"The hotel was wonderful. It was nice, clean, and quiet. The staff was awesome and friendly. I didn't get a chance to try their lunch but the breakfast was delicious. I will definitely come back to this hotel on my next visit to Pittsburgh", u'My mother, grandmother and I stayed at this hotel one weekend last summer for a wedding. The staff at the hotel, from the front desk to the bartender to the housekeeping staff, were friendly and courteous and treated us exceptionally well, and with any problems we encountered the staff went out of their way to help. The area around the...\n\n\nMore', u"The hotel itself is pretty nice and the rooms are clean and well stocked. A nice lobby bar and reception area with a nook business center. All very functional and clean.\nHere's the rub. My wife and I were in our room and heard shouting outside in the hall. It was a Steelers-Raiders weekend so it didn't surprise me because...\n\n\nMore", u'the room was in good condition the bed was comfortable a very nice experience.the five minute shuttle ride to the football game that takes you right down town and a short walk to the stadium. mount washington is just a few minutes away as well', u'My boyfriend and I stayed at this hotel the weekend of the Steelers/Broncos game. We got the shuttle to the casino within an hour of being there. We slept very well and the room was extraordinarily clean! We hope to stay here again next football season!', u"The hotel was clean and comfortable. The staff was friendly and helpful. It was situated near a major freeway so it wasn't hard to find or get too. We checked in super late and had a noon checkout. I got up for breakfast but it wasn't included which was a bummer and a little pricey but nice. 10/10 I would...\n\n\nMore", u'I have stayed at this hotel several times in the past year and have found it has an excellent atmosphere with a staff that is friendly and helpful. The Crowne is very clean and the rates are incredible for a hotel of this caliber.I have recommended the hotel to business partners and friends alike and they have enjoyed their stays....\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/07/41/19/af/crowne-plaza-pittsburgh.jpg'}
{'review_count': u'472', 'title': u'Shadyside Inn All Suites Hotel, Pittsburgh', 'rating_string': u'4.5', 'address': u'5405 Fifth Ave, Pittsburgh, PA 15232', 'review_list': [u'I attended Carnegie Mellon University 15 years ago and had always heard about the Shadyside Inn but never had the reason to stay there. I was delighted to finally see it for myself on a recent trip. We had a one bedroom apartment, that is almost as big as the one we live in at home. It had everything we...\n\n\nMore', u'I only stayed here one night, although I had planned to be there 3 nights. This appears to be a former apartment building that has been partially converted to a hotel. Rooms are in several different buildings. Mine had no elevator, so had to carry bags up one floor. Not a big deal in my case but could be a...\n\n\nMore', u'This was a wonderful hotel experience. I stayed in the suite located on Kentucky Avenue. It is a house that has been converted into two suites; one upstairs and the other downstairs. It was more spacious that my first apartment. It is ideal for an extended stay. The suite was very well decorated in a modern d\xe9cor. The staff was...\n\n\nMore', u"Great location and great staff. Discounts to museums was a nice plus. Very roomy for the price, and was upgraded to two bedroom suite which wasn't really necessary. The controls for the radiator at floor level kind of inconvenient.", u"These are old apartments refurbished as hotel suites. If you need a suite and are spending some time there, it's a great deal. But, if you only need a room for a night, or a few, you can do better. First, this is a cluster of buildings, so don't unload your bags until after you check in, because you might...\n\n\nMore", u'This is more of an apartment with hotel services than a traditional hotel. It is ideal for families, extended stays, anything where you want extra room and privacy. The staff was friendly and helpful. T he location is outstanding, along Millionaires Row in Shadyland, walking distance to Carnegie Museums, restaurants, parks, etc. The only problem we had was the noisy...\n\n\nMore', u'We visit our son in Pittsburgh a few times a year, and recently booked at Shadyside Inn and Suites this past weekend.\nQuiet, clean and roomy the staff that greeted us hospitable. An enjoyable stay.\nThe location is good. The room was fully equipped.', u'We thoroughly enjoyed our stay here. It was very affordable, clean and staff were great. It is a very creative and stylish use of previous use buildings. It was two blocks from wonderful restaurants and great shopping. We walked to the museums and got discount tickets through the hotel. The elevator was slow but it created nice conversation with other...\n\n\nMore', u'I have to say it is more like a short term condo rent. Houses / condos are pretty old. I was lucky to be located in the main area. Unfortunately we had no dish washer. Cleaning service was sometimes a little bit a problem. But besides that they offer great service like shuttles (included one round trip a day), laundry...\n\n\nMore', u'I thought I would chance it; even though the reviews were mixed; I should NOT have we will not be coming back here. The staff was amazing and very accommodating; however the rooms were very old and not redone. There is no elevator to B, C, or D rooms and there are many steps so not good for elderly... They...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/07/92/d3/e0/shadyside-inn-all-suites.jpg'}
{'review_count': u'181', 'title': u'Candlewood Suites - Pittsburgh Airport Hotel', 'rating_string': u'4.0', 'address': u'100 Chauvet Drive, Pittsburgh, PA 15275', 'review_list': [u'The cleanliness kept this review from being higher. I was staying here before an early morning flight out the next morning. Checkin was a breeze and the desk clerk was friendly and very personable. I arrived late in the evening and just wanted to get to sleep before my early rising in the morning. Checked the bed and everything was...\n\n\nMore', u'I have been too many hotels throughout the United States and I have to say this ranks up there is one of my favorite. This hotel is located just minutes from downtown Pittsburgh. Looking for a place to eat or shop not a problem conveniently located within minutes of the mall and 20+ restaurants in the area.\nThe staff was...\n\n\nMore', u"Bed was so worn out that it sunk in middle and we couldn't roll to side. Also, tiny pillows that were size of couch pillows. Window unit was loud and freezer ice maker made about 10 ice cubes in 24 hours.", u'My boyfriend, pitbull, and I stayed at this Candlewood Suites for 2 months and could not have been happier! The room was clean, spatious, and very accommodating. Our favorite part was how amazing the staff were. Kaitlyn, at the front desk, was always happy, helpful, and professional. She also loved our dog and made her feel very welcome. There was...\n\n\nMore', u'We got two rooms for just one night (Saturday). We came to town for a Steelers game and I searched around and this hotel had great prices compared to others in the area.\nThe rooms are great. Comfy bed, clean all around, lots of space. The only thing that I noticed was a wash cloth hanging on the shower rod...\n\n\nMore', u"I wasn't expecting much when I booked this budget hotel about 15 min away from the airport, and that was fine. I arrived at 1:30PM & the front desk clerk kindly let me check in early. My room, 231, was very nice! The furnishings were pleasant & the bed was very comfortable. The free wi-fi worked very well, much better,...\n\n\nMore", u'Friendly staff, dog friendly, close to airport, long term renters, big laundry facility, clean room. Deal breaking issues for short term renter: No free breakfast, gym, pantry, laundry all in same room. Free coffee is to close to the tread mill.', u"My only compliant were the linens were stiff and scratchy. to the point of uncomfortable in mu opinion. My wife and I stayed overnight so I can't rate the stay and service on a long term basis. The pool and weight appeared to be nice. The front desk personal were friendly was the shuttle driver. Had we stayed longer, I...\n\n\nMore", u'This Candlewood Suites was nicely appointed and the rooms were clean and comfortable. The staff was very professional and courteous. I can definitely recommend it. The location is suburban close to the airport and shopping and restaurants.', u"I had a late arrival at the airport and wanted something nearby that was affordable and clean and this hotel did the trick. The room was very tidy and spacious which was great for a tired traveler. The kitchenette had everything you'd need to cook but I didn't use these amenities. It was about a 30 minute (with traffic) Uber...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/0a/1b/d8/05/hotel-exterior.jpg'}
{'review_count': u'380', 'title': u'Holiday Inn Express & Suites Pittsburgh-South Side Hotel', 'rating_string': u'4.0', 'address': u'20 South Tenth Street, Pittsburgh, PA 15203', 'review_list': [u'Great morning breakfast...free parking and free wifi. Has a shuttle if you want within 3 miles of hotel. Only down side is if you party at night expect noises in am.. Room cleaning staff a little noisy..doors closing and opening..overall great for the trip.', u'Many reviews on travel sites mentioned the long wait for check in. We arrived early (3:00) and checked in promptly for our four night stay (Dec. 30 - Jan 3). Our room was directly adjacent to the front desk and elevators, but seemed to be fairly quiet. The rooms are nice. We were happy. Asked the girl at the font...\n\n\nMore', u'Arrived after dark, staff was efficient, but not overly enthusiastic. Hearing the passing train whistles as we went to our room was not encouraging for a good nights rest; however the room was very quiet, could hear more of the outside noise in the hallway, than was noticeable in the room. wife loved the view of the river and bridges....\n\n\nMore', u'Stayed in mid-December at the Holiday Inn Express in Pittsburgh on South 10TH Street on the South Side. Great stay! The very large king bed room was beautiful, on the upper floor with a view of the city. Got a great weekday AAA rate too. The hotel staff was very welcoming. There is also a convenient shuttle service to the...\n\n\nMore', u"My boyfriend and I stayed here last Saturday while attending a Pens game... We figured since Holiday Inn is a large chain, and the room wasn't exactly cheap, we would have no problems but I was oh so wrong. We arrived at 630, the line to check in was wrapped around the lobby and they said no rooms were ready...\n\n\nMore", u'When I checked in the 2 Queen Bedroom I had booked was not available. I was offered the choice of two separate King rooms or a King with a pullout sofa. I needed two parking spaces and you only get one so I offered to take the King with a pullout if they gave me a second parking space which...\n\n\nMore', u"I am shocked this hotel has 4 stars. I wonder if I just came on a (very, very) off weekend? I'm not usually one to write reviews, but this place is so bad that I felt I had to. First of all, I made a reservation one month + before my stay. I arrived at 10pm the night of my...\n\n\nMore", u'Two nice things to say about this hotel is that the fitness room is great and the few staff members I saw were nice.This hotel was fine the first night but when we came in the next day our beds were not made, but our towels and toiletries were changed. We tried to call down to the front desk and...\n\n\nMore', u"Me and my husband stayed there for 10 days... It was wonderful. The room was huge, the bathroom great, everything was clean an working perfectly. The location is perfect. The sound of train is something we will always remember tenderly. BUT, all wasn't perfect if the staff were not that amazing and extraordinary people. We were very welcomed by Robin...\n\n\nMore", u'Every staff person we came in contact with was very friendly and helpful. The entire hotel was clean and well-maintained. Perfect access to Carson street. If you are looking for a hotel within walking distance of the Carson St. bar scene, this is it. We will be back!'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/08/90/8f/61/holiday-inn-express-south.jpg'}
{'review_count': u'583', 'title': u'The Priory Hotel, Pittsburgh', 'rating_string': u'4.5', 'address': u'614 Pressley St, Pittsburgh, PA 15212', 'review_list': [u"We were happy to find this hotel on the web and booked it for an overnight stay to see a Bruce Springsteen concert at the Consol Energy Center. What a historic gem! Our king room was completely modern yet it didn't lose the historic charm....tall ceilings, period decor, and well chosen antiques abound. The shuttle service to Consol was excellent!...\n\n\nMore", u"Stayed her while in town for a Bruce Springsteen concert. Chose it for price and location but got so much more.\nSuper convenient shuttle provided to and from The Console Energy Center. Rooms were beautiful and clean and staff was very friendly and helpful. We didn't make it to the complimentary breakfast but hear it was good.\nParking right around...\n\n\nMore", u"We had to make a trip to Pittsburgh for a family emergency. Usually we stay with friends, but couldn't for this trip. We wanted to be downtown, but not in a big, corporate hotel. The Priory was a great surprise. The price is very reasonable, the hotel is charming and authentic. Nicki, the bartender in the Monk's Bar, makes a...\n\n\nMore", u'Clean king room. Easy check in. Fair price. Nice breakfast included. Shuttle that took us anywhere we wanted...like having our own driver. Small & very inviting bar. Delicious drink specials...bartender was cranky 20 minutes before close. Not cool.\nOff the beaten track. Not so much traffic near hotel. Four out of five stars from me!', u'This is a nice quiet property with pleasant staff and in a good central location. Close to Heinz field and PNC. Room was nice and well appointed. A very quaint place. I will stay there again without question.', u'The Priory is a charming use of a historic building. A refurbished monastery that was once scheduled for demolition until a community stepped in and held off its destruction. Located in once was historic Germantown this cozy hotel is within walking distance to the Heinz stadium and PNC park. They even offered transportation to some venues like the casino. Whether...\n\n\nMore', u'Liked everything about our stay at the Priory . Take advantage of the free shuttle if you plan on going to the strip. make sure to check out the grand hall and the neighborhood too. The breakfast was generous as well.', u'Saved $50.00 parking fee for Steeler game by staying here (free shuttle or close enough to walk). The intimate on-site bar (and bartendress) lend an intimacy to this unique lodging. If you like places with a history and a "feel", just stay here for heaven\'s sake!! The breakfast itself and the room it\'s served in are bonuses to your visit....\n\n\nMore', u'This hotel is unique for sure. Cleanliness in the shower is less than to be desired. Mold building and visibly showing. Room 202 check it out. I had family in another room 222 and the furniture from a queen bedded to king bedded room was much better in the King room. Seems inconsistent. Nice venue for a wedding. I would...\n\n\nMore', u"Top notch service at the Priory - very efficient and caring staff. We enjoyed the tastefully decorated public areas, very respectful of the building's history. Our room was in the older part of the hotel and was very well appointed. We found the bed very comfortable and the room was quiet. I would suggest a couple of small improvements in...\n\n\nMore"], 'img_url': u'http://static.tacdn.com/img2/x.gif'}
{'review_count': u'284', 'title': u'Red Roof PLUS+ Pittsburgh South Airport Hotel', 'rating_string': u'4.0', 'address': u'6404 Steubenville Pike, Pittsburgh, PA 15205', 'review_list': [u'Only had a one night stay on a college visit. Check in was quick and easy. Decent size room, plenty of space for myself and my son. Room was clean. I would stay there again if I were in the area. People working the front desk were friendly and helpful.', u'It was our first time in Pittsburgh. The rooms were clean and well kept, and both maintenance man mike and cleaning staff cindy were very friendly and helpful in our need/wants from the hotel but also helped us to find our way around the city', u"I tend to stay in nicer hotels, but am not very picky, and was in extenuating circumstances so went with the Red Roof Inn give the price - wouldn't do it again. I was in Pittsburgh for the weekend and unfortunately given snow on the East Coast my flight was cancelled (twice). I was at the airport at 6pm and...\n\n\nMore", u'Wow! Such great staff! Cindy Mike Brian and Lindale were fantastic. Any need was happily taken care off! And so pleasant on Xmas eve! Highly recommend! Clean rooms and they treated you like family! :) :) :) :)', u'We arrived late from Ohio, were treated very kindly by Phyllis at the front desk, had a courteous shuttle driver take us to the airport the next morning. On our return, the shuttle arrived at the airport in a timely fashion and returned us to our vehicle.', u"maintenance man mike was terrific. went out of his way at my every request. I can't say enough . between mike and the cleaning staff cindy and linda . my stay was a very pleasant. I will make this red roof inn my place to stay when I come to Pittsburgh . thanks again joe mccullough", u'The motel has outside doors on the ground floor and inside doors on the second floor. (Stairs, he elevator) The motel has a few aged parts that need an upgrade but ultimately not bad and still functional. The desk workers were friendly and quick at their job. The maintenance and cleaning workers seemed friendly.\nThere is a restaurant in the...\n\n\nMore', u'This is our second time con ng up here to this specific red roof inn. They are very consistent with pricing and service. They offer military discounts and friendly staff. Conveniently located near the airport, mall, walmart, target etc. We will go back if we need a place to stay.', u'We were displaced due to a fire and the entire staff and GM Tony were excellent to my family during our extended stay with them. The room was clean and very convenient to many restaurants in the area.', u'We arrived to find the computer system was down delaying our check in. We were then told the room we reserved was not available. The ad stated that there would be 24 hour airport shuttle service... another disappointment. Shuttle service did not begin until 5am, we needed to be at our gate at 4:45. They told us we could take...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/09/aa/da/64/exterior.jpg'}
{'review_count': u'589', 'title': u'Hilton Garden Inn Pittsburgh University Place Hotel', 'rating_string': u'4.0', 'address': u'3454 Forbes Avenue, Pittsburgh, PA 15213 (Formerly Wyndham Pittsburgh University Place)', 'review_list': [u'It was my first time at a garden inn and I was very happy with everything. The room was clean and nice sized. We had the buffet in the restaurant downstairs and the omelette were delicious. The front desk was very helpful and always available.\nThere was a charge to park the car at the hotel which I always feel...\n\n\nMore', u"This is always the hotel I stay at for business when I am in the Pittsburgh area. It is a great location, and a great Hilton property. It has valet, a restaurant with bar, and my favorite, infused water in the lobby! Very clean, and friendly staff! You can't beat it!", u'My brother and I stayed one night and went to the Springsteen concert at the Consol Center. The hotel stay was great. The room was quiet, clean, and comfortable. The restaurant, bar, and service was excellent. Diane was especially hospitable in the restaurant at breakfast. I highly recommend this hotel.', u'Beautiful lobby, comfortable beds & efficient Valet! There were plenty of restaurants within walking distance. The hotel shuttle was a big plus for returning from our concert at the Consol Energy Center. Breakfast in the dining room was good & Diane was an awesome waitress.', u'Would prefer to stay here every time we visit Pittsburgh,Pa My husband was having knee surgery at the hospital there close this hotel. We parked when we arrived and never had to take our vehicle out again. They seen we got back and forth to the hospital and seen we got to the restaurant next door after dark. Wonderful', u'So very pleased with this hotel from the moment we stepped in - The receptionists were very pleasant and helpful, the bar staff (especially Erin) were knowledgeable, helpful and very welcoming.\nThere is a shuttle that will take you within 3 miles for free and the drivers are superb.\nThe room was brilliant, bed and pillows comfortable, there was everything...\n\n\nMore', u'In the city of Pittsburgh there is a beautiful conservatory to visit. This hotel is the closest to this conservatory. They have a good restaurant and some other restaurants around the hotel which make getting food an easy task. The valet service is helpful and quick.', u"Stayed here for a Steelers game in September. Shuttle to take to and from the field which we were too late to get on. Friendly staff, great rooms. Walking distance to most places in Pittsburgh. Would definitely go back if I'm back in the Steel City.", u"The staff went above and beyond to help every way possible, great over all experience. convenience to hospital is great, restaurant was Delicious, other venues close by. couldn't ask for more out of a hotel in this price range", u'The greatest customer service I have seen in a long time. Will never stay anywhere else in Pittsburgh. The have shuttle with a nice driver take you anywhere to avoid the parking challenges. The valet and front desk staff were so nice and helpful and welcoming!'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-p/0a/1e/12/ce/exterior-at-night.jpg'}
{'review_count': u'1412', 'title': u'Wyndham Pittsburgh University Center Hotel', 'rating_string': u'4.0', 'address': u'100 Lytton Avenue, Pittsburgh, PA 15213', 'review_list': [u'I shared my room with my son, so of course we used both beds in the Double Queen bed room.\nTo my dismay, when we returned from a long day out, one bed was not made, only 1 cup was replaced in the bathroom, and there were no teabags to replace the ones that we had used.', u'Was There In Mid October 2015 For Steelers Cardinals Game Nice Room No Microware Oven Hard 2 Feed A 7 Year When He Wants Mac and Cheese Nice Restaurant Downstairs Food Was Ok Drinks At Bar Was Good Very Friendly Staff Beware Of Parking 25.00 Per Day Better Off On Side Street U Will Just Need Coins', u'Rooms and entire hotel very clean. Beds were very comfortable. Restaurant was delicious. So convenient to Pitt.', u'My stay was excellent. I appreciated the free shuttle within 3 miles of the hotel; I found this very helpful. I stayed here my first night dropping my son off at the University and decided to stay here my last night as well, as it was so easy, convenient, and comfortable.', u'I stayed 3 nights in two double bed room on 7th floor. my room was spacious, clean, and comfortable. But there was no refrigerator and minibar in the room , that was little inconvenient though.\nThe best part was kindness of one of hotel restaurant manager whose name is Ms. Gloria Dearoff. we had to check out at 5:30 am...\n\n\nMore', u'My husband and I stayed at the Wyndham pittsburgh university center hotel on Lytton avenue on 9/3/2015. We checked in After midnight and without a reservation after a very stressful day at the hospital. The front desk attendant, Nicole, was extremely kind and went out of her way to make us comfortable. I cannot explain how much that meant to...\n\n\nMore', u'My room and the hotel are clean, sink stopper works, towels are very absorbent, front desk is very accommodating, there is an elevator. Our included breakfast of Eggs Benedict was divine. Parking garage was great.\nBreakfast ends at 10am even on weekends. Toilet ran which is why I rated this down one. Also there is no frig unless you order...\n\n\nMore'], 'img_url': u'http://static.tacdn.com/img2/x.gif'}
{'review_count': u'596', 'title': u'Hampton Inn Pittsburgh University/Medical Center Hotel', 'rating_string': u'4.0', 'address': u'3315 Hamlet St., Pittsburgh, PA 15213', 'review_list': [u'The lobby and elevator were filthy. The room was less than clean. The staff was incompetent. But it was close to everything we wanted to do in Pittsburgh. I would not choose to stay here again, although I have had good experiences with Hampton Inns in the past.', u'This was our second time here. Although it is a good value, has a good breakfast, and is a clean place to stay, I was a little disappointed. At one time, I went down to talk to the front desk clerk, and no one was there. The handwritten sign said something like: "Making deliveries. Will be back soon." Why would...\n\n\nMore', u"I've stayed here a few times and always been impressed.\n- The hotel is walking distance to UPMC hospitals but a shuttle is available if needed.\n- They discount parking for hospital guests and don't mind if you leave your car at the hotel during the day after you check out.\n- The rooms are newly renovated with a fridge...\n\n\nMore", u"We were recently in Pittsburgh for my daughter's audition at Carnegie Mellon. We had a long drive and were quite stressed in general, but we were welcomed warmly at the front desk. The clerk was very friendly and helpful with dinner recommendations, shuttle info, etc.\nThe room was nice and clean. Typical Hampton Room. Comfy beds!\nThe complimentary breakfast was...\n\n\nMore", u'We were in PGH for an appointment with a physician and stayed overnight the night beforehand. The weather ha turned sour, frightfully cold, and we were thankful we took the extra time into the city. Not being familiar to the area of University Center, the staff told us via phone how to get to the hotel the easiest method, since...\n\n\nMore', u'Once again a fabulous stay at a great hotel. Front desk staff was terrific. Breakfast was great with a good variety of options. Room was clean and comfortable. Price was fantastic. This is our go-to hotel when staying in the Pitt area.', u"The hotel's rooms are worn down. The staff at the check-in initially gave me the key to someone else's room, I guess they are tired too. The hotel is on the outskirts of the University Business District but it charges $14.00 per night for parking which I found to be way above a reasonable price. The heater was noisy and...\n\n\nMore", u'My wife and I found this location to be well above average in regard to the facility and staff. Would not hesitate to stay there again or recommend someone else to do so. Another plus is the parking is nearly at the front door and access to downtown Pittsburgh, Pa is very convenient.', u'Affordable, clean and convenient to UPMC. Staff is friendly and welcoming. Did not evaluate the breakfast. We had early morning surgery and checked out before 7. It is about 3 block from UPMC so it is probably not withib walking distance. It is also only about a mile from downtown for concerts, ballgames, etc.', u'I choose this hotel because it was close to childrens hospital. We stayed in a king room. The room was a little small, but clean. The bed was a little hard. Breakfast was nice. Had a lot to choose from. Front desk was nice. All together the hotel was nice.'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/09/55/7e/15/medical-center.jpg'}
{'review_count': u'137', 'title': u'Holiday Inn Express Hotel & Suites Pittsburgh West', 'rating_string': u'4.0', 'address': u'875 Greentree Road, Pittsburgh, PA 15220 (Formerly BEST WESTERN Parkway Center Inn)', 'review_list': [u"We stayed here after the Pittsburgh / Denver game. The only thing that sucked was that we weren't able to check in early. The front desk staff did assure us that we would have a room once we got back from the game. We only stayed here overnight so didn't get to use any of the amenities. From check in...\n\n\nMore", u'The staff went above and beyond to meet our needs. the rooms were clean, comfortable and quiet.\nThe shuttle service into Consol Energy Center for the Bruce Springsteen show was very convenient. Although they normally stop shuttle service at 11:00 they extended it after the concert until all hotel guest had been picked up (which was quite a few). Thank...\n\n\nMore', u'My husband and I stayed at this hotel for a three-day getaway in Pittsburgh. The hotel is right near the highway, but not so close that you hear the traffic in your room. Because of this, downtown Pittsburgh is only ten or fifteen minutes away in weekend traffic. The staff, especially the housekeeping staff, were cheerful and helpful without being...\n\n\nMore', u'This hotel was great. I was a little worried about some of the reviews I saw on this hotel but it was a great price and and equally great location to the city. If you are used to a 5 star hotel than this is not your hotel. If you are looking for a clean, friendly staff and with many...\n\n\nMore', u'Average location but excellent front desk customer service and a great shuttle service to the local eating spots. Was there on a rainy night without a vehicle and the shuttle saved my evening. Nice place nice service would stay there again. Thanks', u'The suite i stayed at had a kitchenette and 2 rooms. The kitchenette had 3 chairs to sit at and eat, drink and discuss business. The rooms were clean, up to date, each had a TV, their own temperature control. The bathroom was large and modern. The bed, couch and chairs were comfortable.', u'Booked based on my Rewards Points, needed a close place to stay because my husband was preaching in the city. I was confident because Trip Advisor reviews were good.\nBooked 2 rooms 1 for us, 1 for mom. We were placed in 505 and 515.\nCheck in about 8:00pm. The King rooms were small but appeared so I can happy....\n\n\nMore', u'Stayed 10/29-10/31/15 the location is in a great location to downtown. The staff were friendly and accommodating. They were ready when we arrived and assigned all 5 rooms on the same floor. There was fresh coffee and fruits at no charge. The rooms are much better than the pictures. The pictures must be old because the rooms were updated the...\n\n\nMore', u'I stayed here 5 years ago when it was Best Western and had a nice stay. When I walked in and saw how beautiful it was I only could say WOW! everything was so fresh and new. The breakfast was good, fresh hot and Vicki did a get job keeping everything full and tables and food area clean. When we...\n\n\nMore', u'Parking was ample, and checkin was quick.\nThe room was clean, as was the bathroom. The internet worked well, and there was a good selection of tv channels.\nMy room on the 6th Floor was quiet, with a nice view of the city.\nThe bed was comfortable, the room temperature was maintained without one of the noisy air conditioners blowing...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/09/ad/dd/bc/sunlit-all-season-indoor.jpg'}
{'review_count': u'367', 'title': u'Hampton Inn Pittsburgh - Mcknight Rd. Hotel', 'rating_string': u'4.0', 'address': u'4575 McKnight Road, Pittsburgh, PA 15237', 'review_list': [u"Stayed here one night. I had never stayed here before. Check in was fast and friendly.\nI pre checked in and from my phone picked room 223. Everything in the room was fine. Clean and your usual Hampton Inn room. That is where it ended. One o'clock in the morning I heard a loud screeching sound. I could not believe...\n\n\nMore", u'We are a fan of the Hampton brand, but not this hotel. We reserved the king suite with whirlpool to rbing in a romantic New Year and were disappointed. To begin, the suite had a bad odor and the furniture was very dated. We were very excited about the room bc of the whirlpool, but felt a bit deceived as...\n\n\nMore', u"Clean, quiet and comfortable. Fridge froze all our drinks overnight, but too cold is better than too warm. Whirlpool jets weren't that powerful, but better than nothing. Free breakfast sucked, but what do you want for free? You want a good breakfast- then you go and pay $10-$15 somewhere and get it", u'We stay here a lot and have always found it a good place to stay. The room is clean, spacious and well appointed. On this stay, however, the group across the hall were up almost all night partying and slamming the doors. We finally had to confront them to get them to shut up. The doors are a problem here...\n\n\nMore', u'The rooms were nice and quiet. The beds were comfortable and well appointed. I should have asked for an extra towel to wrap my hair with after my shower. The internet access easy and free. The complimentary breakfast had a good variety of hot and cold items. It was very convenient to restaurants and other businesses.', u"We recently booked two nights at Hampton Inn in Pittsburgh....on McKnight road. We like Hampton Inn's because they are predictably good. This one however; was not up to the usual good Hampton standard. We booked one of the only available rooms....double beds. Not queen...but doubles. Ok..so we are spoiled and usually get the king but they were not available so...\n\n\nMore", u'To begin with, this hotel is on McKnight Road where the road is physically divided, so you can only enter from one direction. If you are coming form the other way, you need to go a half mile past and turn into some other parking lot.\nI booked a king bed online and was told upon arrival that they only...\n\n\nMore', u'First time ever to stay at a Hampton Inn and very good experience. Staff always available and helpful, clean rooms and comfortable bed. Hotel quick access to highway and easy to find. Great value for the price. Will stay again when back in Pittsburgh.', u"Overall great experience. Staff was very friendly, the room was nice, lobby was clean and very presentable, and the complimentary breakfast was outstanding. My ONLY issue with the hotel is that the room wi-fi was rather slow. In this day and age you'd expect the internet to be a little faster than it was. With that said, I would definitely...\n\n\nMore", u'Overall, a good hotel. Getting to the hotel from downtown requires some safety precautions. Coming from the south you find that you cannot make a left to get to the hotel. You must continue north on route 28 and turn around safely. Do not attempt to make an illegal U-turn on this busy interstate at the next light as it...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/08/32/d1/6e/hampton-inn-pittsburgh.jpg'}
{'review_count': u'357', 'title': u'Courtyard Pittsburgh Downtown Hotel', 'rating_string': u'4.0', 'address': u'945 Penn Avenue, Pittsburgh, PA 15222', 'review_list': [u'Visited for a convention at the convention center. This hotel was located, basically across the street with valet parking - so it was perfect. Rooms were lofty, clean, comfy. Cafe and snack area were very nice. Located near to good restaurants and coffee shops.', u"This hotel is great! It's my 3rd time staying here and as always, the room was nice and clean, it has a fridge for late night snacks, and the staff is courteous and knowledgeable about cool things to do nearby. It's perfect for a Steeler's Game since you can walk to Heinz Field. Great shops surround the hotel and Market...\n\n\nMore", u"you're forced to use valet service to park your car here and the parking guys are obnoxious. they act like you're imposing on them when you need to get your car out, and I know for a fact they rummaged through my personal things in my vehicle.\nI will never stay here again.", u'Good price for a hotel downtown. Very clean, very quiet. Literally right next to the convention center. Just blocks from Amtrak station, a few bus stops. The back view of the hotel is the convention center--in other words no view at all. The bistro downstairs offers trendy breakfast meals (parfait, a few pastries, fancy combo meals). Not really a kid-friendly...\n\n\nMore', u"Overall we'd recommend this hotel because of the service and convenient downtown location. This hotel was a perfect location for us - right in the cultural (theater) district and a 15-minute walk to the Strip District, ball fields, and even shorter walk to Market Square. On the positives, service was very friendly, the room was a decent size with mini-fridge,...\n\n\nMore", u'Nicely located, easy walking distance to Heinz Field, and to local restaurants and bars. Room was nice and the food at the counter was as expected. Nothing incredible, but basic breakfast options. Only issue was that although the cleaning service straightened up a little in the living area, the bathroom did not look like it was touched. It was on...\n\n\nMore', u"This Courtyard is a pleasant upscale from the normal everyday businessman's Courtyard. Starting with the Valet and Front Desk Staff the experience feels more like a full Marriott than a Courtyard. Very good value for a downtown hotel. Easy walk to numerous restaurants and Heinz Field or PNC Park.", u'First time visiting Pittsburgh - spent the Oct 8-12 weekend here and was very pleased with the hotel, the room and the staff. In particular, Natalie on the front desk was very friendly and helpful and set us up with an excellent room - spacious and quiet with a very comfortable bed. As well, special thanks must go to Manna,...\n\n\nMore', u'My last review of this hotel was not very flattering, but went back and was surprised! The service was very good and the rooms okay. (Had some problems but were addressed by staff) It is very convenient to downtown and all sporting events for pro sports. Nice breakfast area and attached to a nice restaurant.', u'I stayed at Courtyard Pittsburgh for 2 nights and the hotel was clean and spacious with high ceilings. The decor of this hotel is nice but not really anything to write home about. The beds were comfortable. The bistro was good but a little on the pricey side. The staff was ok but not overly friendly or anything. I really...\n\n\nMore'], 'img_url': u'http://static.tacdn.com/img2/x.gif'}
{'review_count': u'206', 'title': u'Holiday Inn Express Hotel & Suites Pittsburgh Airport', 'rating_string': u'4.0', 'address': u'5311 Campbells Run Road, Pittsburgh, PA 15205 (Formerly Country Inn)', 'review_list': [u'Stayed at this hotel the night before a Steelers Football game. The rooms were clean and comfy. The best part is the entire staff had on some type of Steelers clothing the next morning at breakfast. Really got us ready for the game. Breakfast had plenty of options and hotel is close to Heinz Field.', u'This is the second time we have stayed at this hotel. We usually book a suite and both times the rooms have been very clean. Staff are friendly and prompt if we needed anything. The hotel is close to many areas to shop and eat as well as an easy drive to both the airport or downtown Pittsburgh. Will definitely...\n\n\nMore', u"We have stayed here several times now, and each visit has been a positive experience. Rooms are very clean and quiet. Even the rooms on the back side of the hotel by the highway are quiet and the room darkening curtains keep the early morning sun out very nicely. Location is great -- it's just a quick ride down the...\n\n\nMore", u'Everything seemed clean and convenient. Breakfast was ready early for a large group leaving in the morning. Free coffee, tea, and hot chocolate available all day. Nice lounge/breakfast area with fireplace. Room for improvement: Caulking work on the bathroom sink looked completely incompetent and should have been replaced before that room was ever used. Just a big cosmetic flaw.', u'I stayed here with my husband and young child after a holiday party. We checked in a little late but the desk clerk was quick to find our reservation, happy and friendly. The beds were extremely comfortable - I stayed in three different hotels this month and this bed was definitely the best. Breakfast was good, but the only complaint...\n\n\nMore', u'This is a large, square-shaped hotel, so it is a long walk around the property. It is clean well-appointed, and is near restaurants. The breakfast is good, all the standard-fare that you get at an "Express" location. This is right off the highway, so you may want to stay on the side away from the busy highway if you do...\n\n\nMore', u'Stopped by for the night awaiting a flight in the morning back to Chicago. Hotel was very clean, staff was nicer and more attentive than I have seen in a Holiday Inn for quite some time. Front Desk people were very friendly and helpful in many ways. Needed minor assistance on a very small item and the Assistant GM was...\n\n\nMore', u'I chose this hotel because of my early morning flight out of the Pittsburgh International Airport. The hotel offers free shuttles to/from the airport. The shuttle drivers were both extremely nice and helpful, although the hotel itself is 15 minutes from the airport.\nAll of the staff were very friendly and the check-in and -out process was efficient. There is...\n\n\nMore', u"My husband and I have stayed here for several years. Bathrooms were ignored during a recent 'remodel'. Bathtub in room 315 is in very poor condition. Wifi is free but signal is very weak. I could barely get a signal in the room. Ice machine on 3rd floor did not produce any ice and we were told it was new....\n\n\nMore", u"We arrived late, and they didn't have room with two beds for this family of four, but the king was great and after we just slept in it! The bed was the old spring kind, but it was SO comfy, best sleep we have had in years in ANY hotel. Had some miscommunication with the staff before arriving, thought they...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/06/fb/56/6d/welcome-to-the-holiday.jpg'}
{'review_count': u'198', 'title': u'Comfort Inn & Suites Pittsburgh Allegheny Valley Hotel', 'rating_string': u'3.5', 'address': u'180 Gamma Drive, Pittsburgh, PA 15238 (Formerly Holiday Inn Pittsburgh - Allegheny Valley / RIDC Park)', 'review_list': [u'I have stayed here many times over the last couple of decades. At the end of the Holiday Inn days, it was pretty rough, but it has been renovated recently. It still seems somewhat old, but my room was clean. When I arrived, it was very cold outside but my room was very hot. When I adjusted the temperature, it...\n\n\nMore', u"It wasn't the worst played I've ever had to stay and it wasn't the worst hotel experience but it wasn't worthy of a repeat. There is something with hair, as it was everywhere!! Pulling back the covers there was hair, bathroom floor, there was hair. Seems like an ongoing theme. The corners in the bathroom was evidence of the build...\n\n\nMore", u'Rooms, halls, pool were dirty, dirty, dirty. Basic cleaning like dusting were clearly not being done. The front of the bathroom sink was covered with dust and specs of toothpaste or soap or something. Corners of the bathroom piled with dirt, hair in the shower. Even the doors to the closet and bathroom had dirty finger prints!!!! The pictures in...\n\n\nMore', u"I travel to Pittsburgh for business, and am always looking for value, comfort, cleanliness, and convenience of location. This hotel has them all. It's 10 minutes from Downtown on most days. The staff is attentive. The rooms are clean (most have a refrigerator and microwave). They are clean, although some showers are outdated. And, the price is more than right.", u'Disgusting! I have had to call housekeeping three different times in less than 24 hours. There were hairs all over the bathroom floor and on "clean towels". It was evident the bathroom hadn\'t been cleaned at all. It was filthy. After speaking to housekeeping the second time, they assured me they would take good care of us. Then they left...\n\n\nMore', u"We went to this hotel for an employee appreciation event. 3 out of 6 rooms had issues: one room still had trash in the cans, one had a red stain on the blanket, another had a filthy comb in the pull out couch. we were all on the same floor so I'm assuming that the worker that day decided they...\n\n\nMore", u'Very close to the Heinz VA facility and just off the highway. Morning newspaper delivered to room was a nice bonus. Breakfast buffet both hot and cold items were ample and well stocked. Business center computer and printer was available and useful.', u"For the past four years, we have stayed here and found it perfect for our grandson ( from age 3 1/2 to no 61/2 ) ... We usually stay two nights and then go to the zoo one day and the museum the next ;) we like the indoor / outdoor pool and the fact that there's a restaurant/ bar...\n\n\nMore", u"Stayed here because it was close to where I was working. The outside looks nice and the place is pretty big. The clerks at check in seemed very robotic and didn't seem very friendly. The room looked ok except for the bathroom. I don't usually complain but the bathtub is worn and stained. It was cleaned just stained gray. I...\n\n\nMore", u'All staff were super friendly and helpful. The beds were good and rooms clean. Showers were hot and had great water pressure. Breakfast had a lot of choices and the staff that worked in the dining area stayed on top of things, nothing ran out. Check in and check out went smoothly with no issues.'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/08/42/9f/8f/exterior.jpg'}
{'review_count': u'119', 'title': u'Comfort Inn Hotel, Pittsburgh', 'rating_string': u'4.0', 'address': u'4607 McKnight Road, off I-279 Exit 4/McKnight Road, Pittsburgh, PA 15237', 'review_list': [u"Our room with a king bed was small but cozy. Most importantly, the room was very clean. Staff friendly. There is some parking under the building, which is great if you can get one of these spots when it's snowing. It had snowed overnight during our stay and we did not have to clear the car. Nice bonus!", u'Clean room and helpful staff. Stephanie made sure we had the right room. Kennedy greeted us warmly and made sure we have a great breakfast. We stayed in the suite which was well furnished and clean. There was a minor problem that was quickly corrected and without asking for it we were compensated for the problem. They even made sure...\n\n\nMore', u'The staff was extremely pleasant and helpful. The hotel was clean and the breakfast was good. It was a good experience. We would likely stay there if we made another trip to Pittsburgh. Very convenient to many places.', u'What a pleasant place to stay in Pittsburgh. We have stayed here before on several occasions and each time the staff are exceedingly helpful, pleasant and down to earth nice people. From the desk clerks to the kitchen staff and the housekeepers you have never met such nice people. Hats off to you all. We feel like family when we...\n\n\nMore', u'Our room was a little small but clean and comfortable. Breakfast gave you the option of waffles, eggs and with bacon/sausage, muffins, bagels, breads, yogurt. Upon check in we were surprised when we were informed that we were the "Guest of the Day", we were given a bag of snacks and a water bottle.The staff is what really set this...\n\n\nMore', u'We found the room to be smaller than most other hotels we had stayed in but they was not a negative in any way. The staff was incredible and friendly. Our room was clean and fresh when we checked in and it was kept that way daily. We had to be at the hospital at 5:30 and asked if we...\n\n\nMore', u'Room was not spacious, but was comfortable, quiet, clean, with efficient climate control. Exiting parking lot a bit tricky, one-way onto a 4-lane highway, but easy to navigate. Hotel staff friendly and helpful -- the strongest point of a nice two-day stay. Easy access to downtown in one direction, and to upscale shopping mall and restaurants in the other direction.', u"New hotel, very clean. Not a very convenient location for my needs, but a great stay. Love the sliding doors and the covered parking. The evening/early night on duty person is great and friendly. The late, late night staff, not so much. I've stayed there 3 times so far and my only issue has been the extra charge for leaving...\n\n\nMore", u"I was seeing a concert and this was just a stay over trip. A very tiny parking lot and lobby, but the room was as expected and a good price. I didn't get a chance to do the breakfast or anything beyond driving back and forth to the concert venue.", u'Room was very small, and the breakfast was not that great. The bed was super comfy as well as the pillows. Good hotel for stopping through and staying for a night. Could definitely use some updates to furniture. You could tell the furniture in our room was very used.'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/08/a3/f5/26/exterior.jpg'}
{'review_count': u'285', 'title': u'SpringHill Suites Pittsburgh Bakery Square Hotel', 'rating_string': u'4.5', 'address': u'134 Bakery Square Blvd, Pittsburgh, PA 15206', 'review_list': [u'The hotel was modern and clean. The breakfast was good, and all staff members were very nice, Lavern was particularly pleasant. The hotel pool was lap sized, and some what of a disappointment, but free use of the adjacent LA Fitness more than made up for the hotel pool. The parking garage was convenient with unlimited in and out for...\n\n\nMore', u'This hotel is camouflaged and hidden within the Bakery Square area of Pittsburgh. It is clean, modern and a nice mix of comfort and business convenience. There is no gym, but they do give you free passes to LA Fitness next door. Parking is adjacent in a connected garage. The Wi-Fi signal was strong throughout and free.', u'No frills but it was very clean and quiet. Breakfast was very good and the staff were very pleasant. I was disappointed that the pool was not opened as I thought it would be a great way to entertain children staying from out of state for a wedding.', u"I've stayed here twice--once solo for work and once with family for a wedding--and each time it has been a pleasure. The rooms are spacious and immaculate, the beds are comfortable and luxurious, the desk area is perfectly suited for getting good work done, and the bathrooms are great as well. The little convenience store in the lobby is a...\n\n\nMore", u'This was a very nice hotel. The only complaint I have is that they gave my a handicap accessible room when I did not request one. This is not something that is a big deal but I would prefer to simply have a standard room.\nThe breakfast was very good! there were numerous options and the area where you eat...\n\n\nMore', u"I want to say that this place is in a wonderful area. It is very clean and of course I haven't eaten the breakfast in the morning I did have a couple of wines. All was well with everything just working overtime as in overcast with no sleep. When one of the mornings came around a coworker calls me to...\n\n\nMore", u"...in a nice surrounding. Rooms are really spacious with bathroom and extra toilette and couch. Indoor pool available but quite small. Clean, modern design, good choice of breakfast but only plastic 'dishes and tools'. Fitnesscenter directly connected...convenient parking. Very friendly staff and 24/7 open small shop for snacks and stuff.", u"We loved this hotel. It's in a great location. It's also beautifully decorated. The colors and the lines in the hotel were wonderful!. This hotel has a very hip modern vibe. We were going to a function at the Pittsburgh Zoo and we were thrilled to take the complimentary shuttle to and from the hotel. I would definitely recommend this...\n\n\nMore", u"Stayed here for a Steeler game. East liberty is getting to be such a nice area. Took a cab to game cost around 22.00 each way but didn't have to worry about parking etc. Rooms nice . They had a nice breakfast bar in the morning.", u'We used the Springhill Suites Bakery Square for our wedding hotel block. I cannot say enough nice things about the service that we received. Kaitlyn helped us with our hotel room block and shuttle service and was incredibly responsive, helpful, and kind. They were able to let us rent the shuttle for 8 hours, and were very easy to work...\n\n\nMore'], 'img_url': u'http://static.tacdn.com/img2/x.gif'}
{'review_count': u'202', 'title': u'Courtyard by Marriott Pittsburgh Shadyside Hotel', 'rating_string': u'4.0', 'address': u'5308 Liberty Avenue, Pittsburgh, PA 15224', 'review_list': [u"Nice hotel, nothing extraordinary and nothing bad to say either. If you're looking for clean, solid hotel, this is a good choice. Note: deep in PIT, so a bit of a hike from the airport, and only valet parking at the hotel. but their local shuttle is legit - took us to a local restaurant quickly.", u"This seems to be the hotel that my sons' teams book when playing hockey in Pittsburgh although not real close to the rinks.\nValue: above average but due to space constraints (it's a city hotel folks)you are going to pay for parking whether you valet or not so just let the valets do their job and remember to call ahead...\n\n\nMore", u'Accommodations: 1/5\nHotel Customer Service: 2/5\nValue for money: 1/5\nOwnership: 1/5\nShuttle Service: 5/5\nI am Marriott Gold so I was upgraded to a top floor jacuzzi room. I travel a lot and spend a lot of nights in various hotels at different price points. Therefore, it is fair to say you expect different quality when staying at a...\n\n\nMore', u'I travel to Pittsburgh twice a month, and appreciate consistency and predictability, and this Marriott Courtyard offers just that. Staff is pleasant, rates are reasonable, a healthy breakfast is on-site, numerous restaurants are in walking distance, and the hotel is well located in downtown Pittsburgh. Thumbs up.', u"This is a really great location and hotel! The staff is really nice too. I love the Starbucks located practically in the hotel too! The lobby and the rooms are very clean. Valet is the only option for parking but that's probably a good thing downtown. I highly recommend this location!", u"The staff is excellent here. Very friendly and attentive. So, it's hard to leave a negative review, but..\nFirst, parking. They charge for parking at close to $20 a day (that includes tax). Parking is premium in Shadyside, but already paying one of higher rates for a hotel in the area, to tack on parking, when there are no other...\n\n\nMore", u'We chose to stay at the Courtyard rather than drive home ( we are local to Pittsburgh) after a night of Halloween fun on Ellsworth Ave\nEverything went as panned. Good service from all hotel staff\nWe will definitely stay there again for our next event in Shady Side area', u'On the second floor, reasonably quiet. Great location. Desk personnel not too helpful about getting around town. Room was very clean and neat, looks to be recently renovated. Great location for our purposes.', u'I have stayed here a number of times. The staff is helpful, the location is convenient to many restaurants and grocery stores. When entering the hotel, the staff always has a kind greeting. I will be back.', u"The hotel was ideal and ideally located for our purposes and short stay.\nThe ambience was pleasing and thee staff was attentive. The hotel is well maintained, the room clean and the beds super comfortable (that's why we try to stay with the Marriot hotels).\nThere's a Starbucks that accessible from the inside of the hotel located in the same...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/0a/19/a5/34/exterior.jpg'}
{'review_count': u'245', 'title': u'Residence Inn Pittsburgh University/Medical Center Hotel', 'rating_string': u'3.5', 'address': u'3896 Bigelow Boulevard, Pittsburgh, PA 15213', 'review_list': [u'Be aware there are 2 sets of elevators-one to the garage and lobby, the other from the lobby to the floors. Check in and parking was easy. Love the new Marriot mobile app! The room was nice, view of the cathedral of learning. The hot tub, unfortunately, was closed for maintenance and the pool was murky. Yuck! Location is good,...\n\n\nMore', u"We had surgery scheduled for my daughter and needed a place close by the main Children's Hospital in Pittsburgh, Lawrenceville. This hotel was about 5 minutes away and would definitely stay here again. Our room was spacious, clean, comfortable and quiet. We had a studio with a queen bed, mini kitchenette, pull out sofa and room to lounge. The amenities...\n\n\nMore", u'I do not understand why this property has been ranked low on Tripadvisor. After reading previous reviews and ranking, my expectations were not high. But it turned out to be a very pleasant stay.\nI was in town for an event at CMU and decided to give this place a try for one night based on promotional rate that they...\n\n\nMore', u'Interesting public spaces at this hotel: lower lobby for entrance off the street; spacious check-in/breakfast lounge (reached by elevator); outdoor seating area with a city-park feel. Very friendly staff. I appreciated the hot soup available on the cold evening. A smile came across my face when I opened the door - the room layout makes for spacious, comfortable living!\nThe...\n\n\nMore', u'Located on a hillside a fair distance from UPMC, nothing close by in terms of restaurants etc. Rooms were very large suites with kitchens. No bar or restaurant in hotel, breakfast was included and fairly decent selection.\nGym was reasonable as well as pool on site.', u'Check-in, the very large room (which was more of a suite), and the wifi were fine. There was a nicely sized refrigerator in the room. The breakfast downstairs was the usual. The hotel also provided a late check-out (2 pm), which was extremely helpful', u'Gave my seminar this week on life and health insurance at this property as well as stayed overnight 3 nights as well. Rooms are clean, quiet and very comfortable. Full kitchen, a feeling of being in an apartment and not a hotel. The staff especially at the front desk are warm friendly and willing to please and accommodate . Highly...\n\n\nMore', u'Our third stay at this nice Marriott location and it has been good as always.\nMy Stay: 4 nights from Oct 17th 2015\nRoom: 610 - HUGE, 2 Queen Bd Rooms separated by a living room with sofa bed, full kitchen, large fridge and freezer 2 full bathrooms. Perfect for families - Rate $179/night for 3 people; Charges $15 a...\n\n\nMore', u"I stayed at this hotel in October 2015 when coming back to Pittsburgh to clean out my storage unit. It was a good hotel located on the backside of the medical center and three of the ethnic neighborhood centers of Pittsburgh's more known groups (Bloomfield for Italian Americans, The Hill District for African Americans, and Polish Hill for Polish Americans...\n\n\nMore", u'I feel a little guilty posting this review because it should in no way reflect upon the staff. The staff was nothing but professional, friendly, and helpful. Unfortunately I cannot say the same about the hotel. Upon entering, I noticed right away that the lobby was dated and smelled less than fresh. Our room was also on the shabby side...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/0a/1b/29/fa/exterior.jpg'}
{'review_count': u'259', 'title': u'Hyatt Place Pittsburgh/Airport Hotel', 'rating_string': u'4.0', 'address': u'6011 Campbells Run Road, Pittsburgh, PA 15205', 'review_list': [u'My wife and I travel to Pittsburgh every year to watch a Penguins game and usually stay at the Cambria Suites next to Consol Energy Arena. Because of a reservation issue, we had to look for another place to stay and were blessed to find this gem of a hotel within easy driving distance to the downtown area. We stayed...\n\n\nMore', u"I stayed here recently so I wouldn't have to brave the Pittsburgh traffic during a snow storm. The staff is excellent and actually got me checked in early, which I greatly appreciated. It is nice to be able to just check out and walk through airport security. The lounge and restaurant are pricy, but the food decent. World class? No....\n\n\nMore", u"This hotel is where I have stayed for every business trip to Pittsburgh I've taken. It is truly a wonderful place--clean rooms, nice glass showers, friendly and professional faces. I wish they would remember me as I'm there every other week, but they do recognize me at least. The hotel doesn't have a restaurant, per se, but does have hot...\n\n\nMore", u'check in quick and without incident. everyone was friendly. room was nice size with a king size bed and a couch. mattress was very comfortable. loved the walk in shower. the flat screen was nice. breakfast in the morning was simple but good. they had an indoor pool but we did not use it. we requested late check out and...\n\n\nMore', u'Ive stayed at this Hyatt Place several times as this is a favorite place to crash on our way out east. Like all Hyatt Places, fresh green apples welcome you as you walk in the door. The rooms are extremely spacious with modern furnishings and the breakfasts are unlike any other with FRESH eggs, fresh fruit, etc, prepared by a...\n\n\nMore', u'The hotel is convient to Pittsburgh and other outlying areas of Pittsburgh. The room is upscale and the resturant and bar offer a nice variety of food and drinks. Enjoy starbucks coffee on site too. Frequently stay at this property and will return again', u'We have stayed at \'Hyatt Places" before and this room was very similar to others we had stayed in previously...like the \'suite\' feel with sofa and bedroom areas.\nA few complaints though...heater/furnace was very loud, in fact we shut it off to be able to sleep. The bathroom is divided into a shower/toilet area and a separate sink/vanity area...which is...\n\n\nMore', u'We were here for a hockey tournament and the rooms were wonderful. Large and spacious, with a separate living area. Which made it quite nice for a family of four to spread out. There is an L-shaped sectional sofa which also turns into a pull out bed for more sleeping area, and plenty of space to store luggage, as well...\n\n\nMore', u'Fantastic hotel lobby. Every staff person I encountered was friendly, knowledgeable, and helpful.\nThe restaurant in the lobby is awesome! Great wine selection. I had grilled salmon with fried brussels sprouts and anchovies with broccoli rabe. It was fantastic and perfectly seasoned! Breakfast is pricey. The buffet is $18.00... really? Am I in NY with that price? I will admit...\n\n\nMore', u'The location is at the airport and we had to pay fee to get in and out of the hotel cum airport parking lot. The best part was the breakfast buffet was excellent with lots of varieties. Room was clean.'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/06/fe/31/43/hp-p269-conv-gen-1-reno.jpg'}
{'review_count': u'245', 'title': u'Fairfield Inn & Suites Pittsburgh Neville Island Hotel', 'rating_string': u'4.0', 'address': u'5850 Grand Avenue, Pittsburgh, PA 15225', 'review_list': [u'We stayed here spontaneously on our way down from Ontario to Florida. Nice quiet area. Got a king size bed for a good rate considering the hotel. Large TV, huge bathroom with nice shower, overly comfortable bed, wonderful breakfast with waffles and good muffins, front desk attendant was really nice, no complaints whatsoever.', u'I have been staying at this hotel since 2013. I am there at least 3-4 times a year and the service has always been very consistent. Although the area surrounding the hotel does not seem very nice, I guarantee the views will make up for it.', u'Location was great for us visiting Pittsburgh. Clean comfortable rooms. Staff was courteous, friendly and helpful. Pool and jacuzzi were great (other then too much chlorine which is like most hotel pools). Breakfast was fresh and nice assortment.', u'Dorothy in the breakfast room is awsome. The lady that works the third shift is really nice as well. on my most recent stay after the room was serviced someone from housekeeping tried to enter my room while I was sleeping at 1:45 p.m. I think it was the manager of housekeeping. Then I noticed how busy the person was...\n\n\nMore', u'Loved this hotel!! They are just outside of the city, so we drove into the city to see things. The room was clean, quiet...everything we need in a hotel! There was a nice restaurant just off the parking lot that had good food at a reasonable price. We had a really nice weekend here, visiting with our college freshman!', u'The hotel location on Neville Island was just outside of their industrial district.\nBut to our pleasant surprise, this hotel was very nice inside and out. With a great view of the river behind the hotel, you could enjoy the river scene with the boats and docks across the river.', u'We have stayed here on numerous occasions and no matter what room we are in the noise from the interstate and the Penske garage is quite evident. Beautiful view of the river. Clean rooms. Usually friendly employees (had one this trip not too happy). AND MOST NEGATIVE COMMENT....THE BREAKFAST SHUTS DOWN AT 9:00!! After a long night of travelling, getting...\n\n\nMore', u"I thought the hotel was really good. Nice people, nice clean rooms, comfy beds and a good breakfast.\nThe only downside is the location. It's a fair distance from downtown, without a lot, even restaurants in the immediate area. It's a very industrial area, so there are a lot of trucks on the road out front which can make for...\n\n\nMore", u"I stayed the weekend of 8/28/ -8/30/2015.\nService was good. Nice and clean place. Had planned to use the pool but it was a little small and once one family was in it the desire wasn't there to jump in. The patio was really really nice. very quiet. The fire pit that was lit at night was very nice and...\n\n\nMore", u'Clean and comfortable. We requested a quiet room and fourth floor was just right. Basic amenities but no lotion or hair dryer in bath room. If you have allergies to feather pillows they will change them to good quality regular pillows. Basic breakfast with good Marriott coffee. Pleasant friendly staff. Much better experience than when we stayed here last year....\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/0a/1c/93/55/exterior.jpg'}
{'review_count': u'119', 'title': u'Comfort Inn Hotel, Pittsburgh', 'rating_string': u'4.0', 'address': u'4607 McKnight Road, off I-279 Exit 4/McKnight Road, Pittsburgh, PA 15237', 'review_list': [u"Our room with a king bed was small but cozy. Most importantly, the room was very clean. Staff friendly. There is some parking under the building, which is great if you can get one of these spots when it's snowing. It had snowed overnight during our stay and we did not have to clear the car. Nice bonus!", u'Clean room and helpful staff. Stephanie made sure we had the right room. Kennedy greeted us warmly and made sure we have a great breakfast. We stayed in the suite which was well furnished and clean. There was a minor problem that was quickly corrected and without asking for it we were compensated for the problem. They even made sure...\n\n\nMore', u'The staff was extremely pleasant and helpful. The hotel was clean and the breakfast was good. It was a good experience. We would likely stay there if we made another trip to Pittsburgh. Very convenient to many places.', u'What a pleasant place to stay in Pittsburgh. We have stayed here before on several occasions and each time the staff are exceedingly helpful, pleasant and down to earth nice people. From the desk clerks to the kitchen staff and the housekeepers you have never met such nice people. Hats off to you all. We feel like family when we...\n\n\nMore', u'Our room was a little small but clean and comfortable. Breakfast gave you the option of waffles, eggs and with bacon/sausage, muffins, bagels, breads, yogurt. Upon check in we were surprised when we were informed that we were the "Guest of the Day", we were given a bag of snacks and a water bottle.The staff is what really set this...\n\n\nMore', u'We found the room to be smaller than most other hotels we had stayed in but they was not a negative in any way. The staff was incredible and friendly. Our room was clean and fresh when we checked in and it was kept that way daily. We had to be at the hospital at 5:30 and asked if we...\n\n\nMore', u'Room was not spacious, but was comfortable, quiet, clean, with efficient climate control. Exiting parking lot a bit tricky, one-way onto a 4-lane highway, but easy to navigate. Hotel staff friendly and helpful -- the strongest point of a nice two-day stay. Easy access to downtown in one direction, and to upscale shopping mall and restaurants in the other direction.', u"New hotel, very clean. Not a very convenient location for my needs, but a great stay. Love the sliding doors and the covered parking. The evening/early night on duty person is great and friendly. The late, late night staff, not so much. I've stayed there 3 times so far and my only issue has been the extra charge for leaving...\n\n\nMore", u"I was seeing a concert and this was just a stay over trip. A very tiny parking lot and lobby, but the room was as expected and a good price. I didn't get a chance to do the breakfast or anything beyond driving back and forth to the concert venue.", u'Room was very small, and the breakfast was not that great. The bed was super comfy as well as the pillows. Good hotel for stopping through and staying for a night. Could definitely use some updates to furniture. You could tell the furniture in our room was very used.'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/08/a3/f5/26/exterior.jpg'}
{'review_count': u'76', 'title': u'Holiday Inn Express Pittsburgh-North (Harmarville) Motel', 'rating_string': u'4.0', 'address': u'10 Landings Drive, Pittsburgh, PA 15238', 'review_list': [u'Another great holiday inn express. The room was very clean, comfortable and spacious. Free wifi, in room coffee, great water pressure in the shower, and the free breakfast was terrific. The staff was very friendly. The parking lot was well-lit. And although the hotel is next to the turnpike, the "traffic noise" was minimal. A+', u'We stayed here to visit my cousin who attends Pitt. It is about a 15 minute drive from the Pitt campus but very conveniently located near an entrance to the PA turnpike. We also choose this location because near the ice rink in Harmarville where my cousin plays hockey. We had room on the 1st floor across from the ice...\n\n\nMore', u'We arrived Friday afternoon, and the desk host was very pleasant to deal with.\nThe hotel was very relaxing, fairly quiet for a Friday. We stayed until Sunday, then checked out. The food was very plentiful, (hot and cold choices), and good. The cook/kitchen help was able to talk some as the hotel was not too busy at the early...\n\n\nMore', u'I stayed at this Holiday Inn Express for four nights last week. My family and I had to leave another hotel at the last minute and the staff was great in accommodating us in finding two rooms, close together at a decent price. The housekeeping staff was very helpful and always smiling, the front desk staff was always pleasant and...\n\n\nMore', u"Stayed here one night on busy Labor Day weekend to visit family family in nearby Verona. The breakfast was excellent and items replenished often. We booked two double rooms, however one room's air conditioning unit was not working- just blowing air but not cool. It was ok for one family member but not the other. We were told a new...\n\n\nMore", u"I spent 4 nights here. The first 3 were ok, the last night, less than desirable. An adjoining room had someone smoking in there and the scent carried over into my room. The hotel manager did rectify the situation after the fact, but was disappointed that the MOD at the time didn't do anything.\nOverall, it's an ok hotel with...\n\n\nMore", u'Rooms have been recently updated and feature clean, faux-wood floors -- really bright and modern. The suite is huge and a great value! Pool is a nice size as is the pool room itself. Free breakfast was good quality. Staff was great. And the location is nice -- a bit out of the City, but a quick 10 min to...\n\n\nMore', u'We stopped here on the way back home because we stayed at the one at the one in Logan. Again the the rooms are clean and the service was great. The room has high ceilings which you do not see that often, quite unique. They have hot breakfast until 9 AM.', u'My boyfriend and I visited for the night to celebrate our Irish heritage. Check in was slow n felt like it took forever even being the only one in line. The hotel was up to date and included an inside pool. It was conveniently located close to a few places worth visiting like Primantis Brothers and Meadows Racetrack. It is...\n\n\nMore', u"not too many hotels close by in Oakmont. We didn't want to go into the city so decided to stay out here. Only had three choices (super 8 & days inn next door) We were glad we chose the Holiday Inn. Nice place and staff was very friendly. Very convenient to Oakmont CC so if you go down for the...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/0a/0a/b9/1a/hotel-exterior.jpg'}
{'review_count': u'226', 'title': u'SpringHill Suites Pittsburgh Southside Works Hotel', 'rating_string': u'3.5', 'address': u'2950 South Water Street, Pittsburgh, PA 15203', 'review_list': [u'Whether you are stopping by or visit the Pittsburg area, this hotel is conveniently located. It is just across the river from the highway, and there are several restaurants within walking distance. For local attractions, the hotel has a complementary shuttle which will take you within 3-mile radius. The front desk lady was friendly and accommodating.', u"Worst hotel I have visited in a long time. Not only was my room musty, it was filthy. Alaina and Katie were pleasant, Harry was helpful & knowledgable about the area.\nI can't say I will recommend to anyone.\nThis hotel needs work and management is definitely asleep.", u'I’ve stayed in Pittsburgh a number of times and decided to try this property. The room was clean. Now the bad news: I didn’t see a single smile from any worker. When I checked in about 8 PM, no one was at the counter. I waited a minute or two then coughed. A worker came out from behind the partition...\n\n\nMore', u'New design Marriott Springhill is nicely decorated. Located riverfront the SOuth exposure of the hotel is an active railroad track. Avoid that side when booking - the trains blow their whistles in the middle of the night. The included breakfast is typical and just functional. The housekeeping is spotty - they neglected to clean my room one the nights and...\n\n\nMore', u"Easy access to this hotel. A friend recommended this hotel because of the location and knowing I didn't want to be downtown. Still a lot to do in this area. Staff was friendly and room was clean. I'll be back!", u"Went to Pittsburgh to celebrate our college freshman's birthday. She also happens to be an athlete at school. We checked in very late only to find that without a doubt, a guest had been smoking in our room. As we headed out to dinner, I notified the front desk, 2 young ladies, about the issue. I received warm smiles and...\n\n\nMore", u"I have stayed here a few times for business. I like that it's easy to get too and there are some decent food options around. Don't get a room near the underground freight rail! It runs all day and is incredibly loud! I have also had issues with hotel management when I tried to get them to deal with a...\n\n\nMore", u'Stayed here for a local wedding and choose this location again for business travel. Arrived for the first time shortly after they opened. The lobby is beautiful. The location overlooking the river is peaceful watching boats and barges float by. I always ask for a room facing the river. The location is also convenient for restaurants.', u'We were in for a family wedding and the location was ideal for restaurants, shops and things to see and do. Our daughter came in earlier and was able to get a room key prior to our arrival, which was great. Our suite was very large and clean. The breakfast bar was average but with all the restaurants in the...\n\n\nMore', u'First concern was being asked if we wanted earplugs. This hotel is located adjacent to a train/freight line which is above ground behind the hotel and then goes underground just past it. The trains sound their horns 1/2 mile away, approaching the hotel. If your room is on the south side you get to enjoy the horn and light. If...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/0a/1d/6b/31/exterior.jpg'}
{'review_count': u'37', 'title': u'Homewood Suites by Hilton Pittsburgh Downtown Hotel', 'rating_string': u'5.0', 'address': u'1410 Smallman Street, Pittsburgh, PA 15222', 'review_list': [u"Highly recommend this Homewood Suites on Smallman Street at the top of The Strip in downtown Pittsburgh. We used the shuttle service during our stay which was a huge advantage for our college visits. The gregarious driver, Tim, made sure we got to our destinations in plenty of time. Although the breakfast won't be mistaken for fine dining, there was...\n\n\nMore", u'Everything you want with a downtown hotel for a decent price. Right in the strip district and has a cool warehouse Pittsburgh feel to it. We were in town for a concert and the hotel was under a mile from CONSOL Energy Center and the hotel was everything we needed.', u'I stayed at this property while attending an event at the Consol Energy Center. The location was great and there were several restaurants really close by. The complimentary breakfast is served in a great room with a view of one of the rivers and there were big screen televisions available as well as a billiards room. The room had a...\n\n\nMore', u'The staff here are phenomenal! As an example, one night I woke up early with a knee that would not work. The staff brought me a cane so I could make it through the next day! What a huge help! Thank you very much!', u'This hotel just opened in November 2015. It was beautiful. Modern, clean, fresh, rooms were awesome. We had a studio suite and it was very comfortable. At the last minute, we had a friend stay with us on the pullout sofa. I told them about it (wanted to be honest) and they said there was no extra charge! The staff...\n\n\nMore', u"Just spent two nights at the new Homewood Suites in Pittsburgh. It was great. Beautiful lobby /arrival experience. Rooms were clean. Beds were awesome. Staff was friendly and had smiles. Clearly they enjoyed being there. Must have great leadership running hotel. Location is perfect. Easy to Uber places...best of all - walking distance to Primantis in the Strip District. I'll...\n\n\nMore", u'my husband and i stayed here for one night to see a show at the consol energy center...this was a PERFECT location for that, just a short uber ride away....we also went to carson street on the south side for lunch and it was about 5 mins by car from this hotel, so again, great location....not only is this hotel...\n\n\nMore', u'Very friendly and helpful staff. The hotel is on the edge of the strip district but also a 20 min walk to downtown so a very good location.\nCommunal areas are spacious and well decorated, breakfast included - and evening / social meal and bar drinks also.\nRooms are all suites and very comfortable - its a new hotel with...\n\n\nMore', u"I've been staying at the Homewood Suites since they opened. I have to say it a beautiful hotel, but the staff is what makes this place amazing. Everyone has been so nice and friendly with me, and I will actually miss leaving. If you are looking for a great place to stay with an awesome staff, Downtown Homewood Suites is...\n\n\nMore", u'My husband & I and another couple rented two rooms and spent the night. We travel often and were blown away with this hotel and staff!!! Unbelievably friendly staff, clean beautiful spacious rooms with full kitchens, great breakfast and bar area in lobby. The hotel is conveniently located in the Pittsburgh Strip District. Walking distance to clubs, fine & casual...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/09/f3/82/19/homewood-suites-by-hilton.jpg'}
{'review_count': u'33', 'title': u'Hotel Indigo Pittsburgh East Liberty', 'rating_string': u'5.0', 'address': u'123 North Highland Ave, Pittsburgh, PA 15206', 'review_list': [u'Had a great time here in this gorgeous hotel. We will definitely be staying here again. The valet parking was super convenient, especially with all the snow in the city. Patrick the front desk guy was so nice. Thanks for taking care of us!', u'Did a quick two day trip to Pittsburgh to enjoy some restaurants(great scene, loads of new places) and some shopping.\nChose new Hotel Indigo to use some IHG points/free night from credit card. Would certainly go back on paid nights as well.\nUpgraded to a corner room with a lot of space for 4 of us. Outlets available all over...\n\n\nMore', u"I have to thank the entire staff, especially the manager Patrick, for making my unexpected snow delay so much more tolerable. I couldn't have felt any more appreciated as a guest and everyone went out of their way to make me as comfortable as possible when having to extend my stay twice due to winter storm Jonas! I look forward...\n\n\nMore", u'A colleague and I (and my family) were in town for a business convention a week ago. We drove in on a Friday and checked into our hotel. It was horrible (not 1 good thing to say about it), so we checked out - at this time it was about midnight. We called around to several other hotels in downtown...\n\n\nMore', u"We had a truly superb experience from check in to check out. It was our first Hotel Indigo stay (although we're Platinum IHG) and we love the idea of a unique space designed for each neighborhood. Our room was phenomenal and the service was unparalleled. The only smudge came from room service--those pancakes are awful--but their over easy eggs were...\n\n\nMore", u'We had no intention of staying here. We had eaten dinner in Point Breeze and decided before driving home to the north hills to drive over and see where the new Ace Hotel was located. While we were driving by we saw the Hotel Indigo sign and decided to investigate. We pulled over, looked it up on my phone and...\n\n\nMore', u"This was pretty much a brand new hotel when I stayed, full of the usual quality you'd expect from the Hotel Indigo Chain.\nThe staff were all very welcoming and friendly and the hotel of a high quality. Breakfast is fantastic and portion size is massive although they did get my order wrong on one of the four mornings and...\n\n\nMore", u"Great staff!!! We enjoyed out NYE overnight stay. The room was great but I have to say that the staff was awesome from greeting to departure. Nice rooms and comfortable too. Breakfast room arrive was really great too. It's a little out of the way from downtown but with Uber was no big deal. We will be back!", u"Great atmosphere and service. Cool rooms. Definitely staying here again. Perfect location on the heart of the upcoming areas of Pittsburgh.staff was excellent and very polite. Bar and Restaraunt were great. Almost didn't need to leave the hotel for an evening out. Looking forward to out next stay.", u"Nice Indigo hotel in East Liberty. Will recommend for business or pleasure. Beautiful and modern deco. Solid structure so you don't listen your the other rooms. Elegant and yet casual. Very comfortable rooms. Don't forget to eat at the restaurant.\nFriendly staff m. Thumbs up!!!!"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/09/0c/da/b0/hotel-indigo-pittsburgh.jpg'}
{'review_count': u'16', 'title': u'Fairfield Inn & Suites Pittsburgh Airport / Robinson Township Hotel', 'rating_string': u'4.5', 'address': u'1004 Sutherland Dr, Pittsburgh, PA 15205', 'review_list': [u'The FFI Robinson is a great affordable place to stay. As a Marriott Gold, I know what to expect at FFI properties and this one is one of the best I have ever in. The fact it just opened in Oct 2015 obviously helped but everything about the stay was excellent. Check-in was quick even with me requesting an upgrade...\n\n\nMore', u'The hotel is in a great location close to a mall and restaurants. Not close to downtown, but we had a car. Breakfast was very good, room very clean and quiet with fair space, attendants were all great. Wireless worked fine and good free parking.', u'I stayed at this hotel after a Pitt Football game, just after it opened. The hotel was great, and the staff was very friendly. The room was spacious and offered plenty of amenities. This hotel is just minutes from the Pittsburgh airport, local shopping and restaurants, and other attractions. It is also a short drive to downtown Pittsburgh. A great...\n\n\nMore', u'The rooms are all new and so are the amenities. The beds were ultra comfortable and the rooms were quiet. The pool was a little small, but a good size for the kids to splash around. The included breakfast was great and there were lots of options. Overall a great experience for a family stay. The location is great too....\n\n\nMore', u'We stayed while on a cross country trip based on trip advisor rave reviews. And spending a night in a new place while traveling is usually a no brainer.\nIf the place had had a passable bed, I would have given the place a three. Maybe.\nThis bed was very soft, and got deeper as night went on. My husband...\n\n\nMore', u'The hotel is about 15 minutes from the airport. It is near shopping and places to eat\nOur room was great, I think we may have been the first people to use the room. We had a problem with the bathroom door opening-it just needed someone to adjust it or plane it. We let management know. The hotel was quiet...\n\n\nMore', u'Wow what a great hotel. Close to everything including the mall, an IHOP within walking distance, Plaza Azteca right in the lot too. Chic Fil a and tons of other food within minutes. 10 minute drive to the airport which is right off the highway. Great rooms in this new hotel with great shower and a good size bathroom. Comfy...\n\n\nMore', u'My husband and I stayed here before we spent a day in Pittsburgh. It is in a convenient location and clean and new. The rooms are on the small size but well appointed with a fridge, microwave, coffee maker and nice bathroom. I guess there are suites in the hotel, but our room was just a smallish size normal hotel...\n\n\nMore', u'We stayed here because it was a new hotel, specifically because it is close to the airport. We had an early morning flight and wanted to be close. It was only about a 10-minute drive.\nThe rooms are beautiful. We had a king sized bed. The room was a little small but fine for our 2-night stay. There was a...\n\n\nMore', u"Great new property. Very clean, nicely decorated and comfortable. Breakfast was good (love oatmeal!) and there are outlets by the tables to make working easy. Didn't need to wear my earplugs to sleep, so that was a big plus!"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/09/19/72/9a/robinson-township.jpg'}
{'review_count': u'83', 'title': u'Hampton Inn & Suites Pittsburgh/Harmarville Hotel', 'rating_string': u'4.5', 'address': u'2805 Freeport Road, Pittsburgh, PA 15238', 'review_list': [u'Great hotel/ great staff / great breakfast / great pool and workout room. Very clean. Wonderful location easy to get to. Excellent all the way around. This was a trip for a family wedding. The staff did their best to keep us all together on the same floor and they allowed us to gather in the lobby during our stay...\n\n\nMore', u"This hotel has become one of our favorites. We were excited to find out they were building a new hotel just a couple of miles from my brother's house. We tried it after it opened and have gone back a few times. The staff is so friendly and has been a big help to us. It is well located around...\n\n\nMore", u"We recently stayed at this Hampton Inn for my brother's wedding. It was in a great location, the lobby was nice, the rooms were spacious, and the bed was so comfy! I loved the amount of pillows it had on it. The staff was very friendly and always complimented my little girl who was the flower girl in the wedding!...\n\n\nMore", u'This facility appears to be new and is convenient to the turnpike and the HealthSouth rehab hospital where we were visiting a relative. Our room was clean, comfortable, and attractive (though we had a king-sized bed rather than the queen we reserved). We appreciated the well-designed bathroom. The check-in person was friendly and offered restaurant advice. There are several places...\n\n\nMore', u'Rooms were clean and spacious. My only complaint is in the amneties of this hotel the say they have a spa and a bar and lounge to relax. There is no spa or bar and lounge. Other than that it is a great place to stay.', u'The room was very large. The breakfast was bigger and more varied than other hotels. The room was clean and newly refurbished or newly built. There was a lovely fire pit and even a putting green outside. The only issue is the terrible view... there is none. The only thing to look at is the new hotel being built next...\n\n\nMore', u'I had been to Pittsburgh for a couple of days with my family on a leisure trip. I had booked this hotel based on some search on Net and frankly I was happy to have done so. This is a nice hotel for leisure and business visitors to Pittsburgh. It is situated a little away from the downtown but there...\n\n\nMore', u'The Hampton Inn in Pittsburgh was a great choice for the families of the hockey players to stay for the weekend of our tournament. Our room was exceptionally large, it was clean, and the beds and pillows were very comfortable. There was a great selection offered at breakfast, and there was plenty of food. This was a "step up" compared...\n\n\nMore', u'An Amazing stay with impressive Northern Hospitality. We visited our relatives in the north and the location and excellence of the Hotel made it a memorable experience. It was around Thanksgiving and it was in a great location for eating and malls. I give it five ***** stars.', u'The hotel is great! Right off the turnpike, the room was amazing - the bed so comfortable, the breakfast just right and the staff are AMAZING! They have a pool - so bring your bathing suit! Next time I visit I will definitely book a room here. Also there is a Target right down the street!'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/07/d5/74/03/harmarville.jpg'}
{'review_count': u'19', 'title': u'Holiday Inn Express & Suites Pittsburgh North Shore Hotel', 'rating_string': u'4.5', 'address': u'228 Federal St, Pittsburgh, PA 15212', 'review_list': [u"I recently stayed at this property for new year's eve for two nights. We were greeted at the front desk by Natalia who provided a phenomenal first impression of the hotel staff. She immediately recognized me as a Gold/Elite member. In fact, I dealt with her again on another occasion and she was, once again, perfectly pleasant. She is to...\n\n\nMore", u'I booked this hotel for the family to stay at for our New Years vacation. As a travel agent, I am always looking for lodging that I can recommend my clients to stay at and this one is at the top of my list for this area. If you are attending a Pirates or Steelers game, or visiting the Science...\n\n\nMore', u'I have stayed in a lot of hotels and this hotel was brand-new and catty-corner to PNC Park yet they had a unbelievably low rate. The staff was extremely friendly and helpful, even walking down the street to guide me to the hotel lot since all of the surrounding streets were closed due to the Pirates home game. We decided...\n\n\nMore', u'I was so happy to find this new location on the North Shore as the options were limited. The property is brand new and the area nice and clean. Parking is a value at $20.00 ish and the staff more than friendly, Nicole was awesome at the front desk and the housekeeping staff smiling and friendly. Breakfast is great and...\n\n\nMore', u'Stayed here for 1 night to attend a Steelers game. I do not have any other hotels to compare this new hotel to in the area (this was my first overnight in Pittsburgh). Picked this hotel in particular due to price and location... here is a breakdown of the stay: We had a 3rd floor room. The room itself was...\n\n\nMore', u"Great location for the Steelers game, tailgaters all around us. But, if you want a good night sleep, do not come here. The bed and pillows were hard as a rock. I tossed and turned all night till I just stayed up at 7am. The breakfast is great and staff very nice. Just couldn't sleep well", u"Wow. Possibly one of the nicest hotels I've stayed at. Great place to stay if wanting to watch Steelers or Pirates. It's only 60 yards from PNC park. Rooms at mini fridge, coffee maker, and microwave. We had a great view of the city from our room. Standard style bathroom. Everything in room was modern style. Flat screen tv. Off...\n\n\nMore", u'First time staying here. Great location in the North Shore area near PNC Park and within a mile or so to Heinz Field. Very friendly front desk staff. Enjoyed their free hot breakfast! Within walking distance to a couple bars on Federal St. Definitely would stay again!', u'The hotel was very nice . Our room was clean and spacious . Breakfast was good . I was not expecting to pay for parking but I was fine ! Staff was excellent . The location was perfect for sightseeing .', u'This hotel has only been open for about 6 weeks and is in a great location downtown. We were able to walk to many great restaurants and bars just steps from our front door. PNC park and Heinz stadium are also within walking distance. The staff at the front desk were tremendous and gave many great recommendations. Coffee and tea...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-p/08/fb/13/cf/holiday-inn-express-suites.jpg'}
{'review_count': u'33', 'title': u'Hyatt House Pittsburgh / Bloomfield / Shadyside Hotel', 'rating_string': u'4.0', 'address': u'5335 Baum Boulevard, Pittsburgh, PA 15224', 'review_list': [u"So the place seems really new and clean when you first come in, but I wasn't immediately greeted at the desk employees were j u st kid of kicked back having a good ol conversation. Melissa finally greeted me with kind of a phony fake smile, she was talking really loud to me as if I were old, or deaf....\n\n\nMore", u'The area was easy to go anywhere. The staff was attentive and helpful. Everything was up to Hyatt standard and more. Good breakfast included and the rooms were good size and current. We will stay here again on our next Pittsburgh trip. Nothing more I can add', u"We arrived early, like 9 am and the concierge was happy to set us up in our room a full 6 hours before official check in, which was wonderful because we'd been awake for a full 24 hours and seriously needed naps. The room (a King Studio) is crazy nice and clean. The little kitchen has all the things you...\n\n\nMore", u"First off the place seems brand new. It is very clean, very modern, and the rooms are very spacious and full of emanates. Excellent location for business or going out in the East End of the City of Pittsburgh such as Shadyside, Bloomfield, Oakland. The service was lacking though. I don't know it it is because they just opened, but...\n\n\nMore", u'This was a great stay for us in Pittsburgh. The hotel is in a nice area near lots of restaurants and bars. We booked a king suite and you get a nice size room with couch/pullout bed and a fully equipped kitchen. You also get free breakfast every morning. The service was also great, everyone was very nice and when...\n\n\nMore', u'We stayed at this property over a weekend in December. This is a nice hotel. Clean with very nice staff. Free wi- fi. Very nice breakfast buffet. Ok location. Would return if we are in the area again. Pittsburgh is a nice city with friendly people and nice restaurants.', u"We stayed at several Hyatt properties over the Thanksgiving holidays and this was one of the favorites. Hyatt Houses are in general great properties for families as most rooms have a kitchenette, separate living room area, pools and hot breakfast included. But they aren't all created equal.\nStarting with check in, the front desk staff is fantastic - they listen...\n\n\nMore", u"Modern and nicely decorated, good location and good amenities. It is a bit noisy, perhaps the floors are thin because I could hear every step of my upstairs neighbors. Service quite good and friendly. Beware: there is a $15 charge per day for parking that is NOT shown on many booking websites, or is buried deep in the hotel's description....\n\n\nMore", u'This hotel is less than one year old. It is tastefully decorated, clean, and the staff was very pleasant (reception, housekeeping, chef, etc.) However, I was surprised that a newly constructed building would be so noisy. We stayed there four nights and each night, about 11 PM - midnight, I heard the person upstairs walking across his room. I nicknamed...\n\n\nMore', u'We stayed here 3 nights over a weekend end September. The staff was extremely cordial and tried to bend over backwards to say ( but maybe not do) the right things. I had the impression that they were responding to the pep talks they get from their higher ups to compensate for some of the deficiencies that are beyond their...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/08/c7/96/7f/shadyside.jpg'}
{'review_count': u'135', 'title': u'MainStay Suites Pittsburgh Airport Hotel', 'rating_string': u'3.5', 'address': u'1000 Park Lane Drive, Pittsburgh, PA 15275', 'review_list': [u'I had an early flight out, and decided to stay here the night before and catch the shuttle to the airport. On arrival, it was somewhat confusing, as the main entrance was under construction. Entry was thru a side door, and that could have been better marked.\nCheck-in was a breeze, and the desk staff was cheerful and pleasant. arrangements...\n\n\nMore', u"We were in town for only a couple days to see a game and connect with family - this hotel was ideally located near the airport, but still within a short ride of downtown Pittsburgh. The setting is quiet - there's not much around, so you either need to have a rented car, or do your dining before arriving! The...\n\n\nMore", u'We were four of us who stayed for 2 nights. We searched for a kitchenette containing room and this place was wonderful. Staff very pleasant. We enjoyed the complimentary breakfast and anytime tea, coffee facility. We heard about its recent renovation. We did get an online offer price for earlier booking. Good parking space. We would opt to re-stay here...\n\n\nMore', u'Stay here about 2x a year and am growing increasingly satisfied. staff has always been friendly, and now with hotel renovation it is really becoming a place that has very few things to complain about. breakfast has improved. remodeling has removed the bad (smoke?) smell from the hallways. very good stay, will be back again no doubt. Wifi strength was...\n\n\nMore', u'This is a great hotel that we ended up staying at only after Comfort Suites messed up my reservation. What a blessing in disguise! Clean, updated, and they had plenty out for us for breakfast as we had a 7:00 flight. Left my vehicle here for four days....no issues! Shuttle prompt, especially after we arrived at the airport last night!...\n\n\nMore', u'2 night stay at this Hotel. Suite was very nice and well equipped. Zero road or hallway noise. Queen bed was very comfortable - slept well. Access to I-376 was easy although traffic may be heavier during the week due to adjacent office buildings. Breakfast was "just OK" and the coffee was bland. I would stay here again when in...\n\n\nMore', u'This location also has Sleep Inn at same location but different floors or wings. Excellently maintained property with new furnishings in the rooms as well as freshly painted. Staff is very friendly- all staff greet you when they see you - maids, front desk, maintenance, kitchen manager. Outdoors has a patio area with a grill as well as a basketball...\n\n\nMore', u"I have stayed at this hotel several times for business in Pittsburgh. The location of the hotel is fantastic for having the ability to drive a very short distance to find very nice places to dine, eg., Quaker Steak and Lube, Max @ Erma's, Long Horn steak house. It is also close to shopping, eg., Walmart, Target and the shops...\n\n\nMore", u"I booked this hotel based on inability to be closer to my daughter's college due to a Steelers game and then on reviews. My daughter was sick and I was going to surprise her and take care of her for the night. Check in was easy. I ordered pizza delivery and went to the front desk to ask for change...\n\n\nMore", u'Stayed in the hotel for 2 nights. Excellent location right next to interstate 376 easy on and off to either the city or the airport. Maybe 12 minutes from hotel to rental car check in. The hotel is also very close to tons of shopping (including an IKEA) and restaurants. This hotel feels new but I think it is renovated....\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/09/f7/97/6e/exterior.jpg'}
{'review_count': u'5', 'title': u'Ace Hotel Pittsburgh Boutique Hotel', 'rating_string': u'4.5', 'address': u'120 S Whitfield St, Pittsburgh, PA 15206', 'review_list': [u'It was our first time staying in an Ace hotel and we arrived one week after the hotel opened. Mostly, we were impressed by the enthusiasm and helpfulness of the staff. They really tried to meet all of our needs. Even going so far to find a great live music venue on a Monday night at our request. We also...\n\n\nMore', u'The Ace hotel is a wonderful down to earth place to stay in East Liberty. It has recently opened and is still undergoing renovations to what was a former YMCA.\nWhen you enter you can see many antique looking furniture as well as a record player, board games, a lounge area, a restaurant and a bar on the other side....\n\n\nMore', u'Just went to the bar and plan on going to brunch. The hotel is a refurbished YMCA, surprisingly hip and current. Bar makes great cocktails and the atmosphere is energetic.\nCasual youthful professionals.', u"Take a near wreck of a YMCA in an area that suffered the most from urban renewal of the 60's - dump a ton of money into the infrastructure - create an environment that will continue to attract people to an area that 5 years ago was a wasteland and you have the Ace Hotel. Now add a craftsman based...\n\n\nMore", u'I visited the hotel the second day they were open and was taken aback by the unassuming charm that was obviously intended. This hotel is in the renovated old YMCA of East Liberty. I went for dinner and drinks, but was given a tour of one of the Jr. suites. Be forewarned! There was an old-fashioned claw foot tub right...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/09/d8/16/93/ace-hotel-pittsburgh.jpg'}
{'review_count': u'451', 'title': u'La Quinta Inn & Suites Pittsburgh North Hotel', 'rating_string': u'3.5', 'address': u'4859 McKnight Road, Pittsburgh, PA 15237 (Formerly Holiday Inn)', 'review_list': [u'My wife and I have stayed for 5 nights at this hotel. Front desk staff could be more welcoming. Breakfast team very good and the food option is huge with waffle, fruit, egg, yogurt, bread and many other. Cleanliness was ok the only thing is that rooms lacks maintenance and is very dark.', u'On 10 pm the day before my planned arrival I happened to look at my reservation and see that I had mistakenly reserved the room a day earlier than I intended. And it was 4 hours after the cancellation cutoff! I immediately called the hotel, and the general manager graciously agreed to revise my reservation and not charge for the...\n\n\nMore', u'Love la quinta for one night stays when travelling with our dog. They do not charge a pet fee that will kill ur night. This hotel is updated, beds are very comfortable and rooms are clean. Great location, there is a big mall near by with lots of popular stores and restaurants. Will definately be back.', u'We stayed at North Hills facility for 4 nights and got linens exchanged twice. Cleaning crew claimed our "Do Not Disturb\' was on door. Incorrect! It was inside the room right where we left it. Had to get towels at night, beds not made. I assume cleaning is part of the room rate, were not reimbursed for no service, manager...\n\n\nMore', u"My boyfriend and i had a staycation for 2 days. We arrived very late at night it was about 230 am and the woman at the front desk was cheerful and inviting. When we got to the room it was so nice and very clean. The location of the hotel is perfect, Ross park mall isn't too far and there...\n\n\nMore", u'Excellent service from all the staff. Especially the Breakfast bar lady. Full breakfast with eggs, Bacon,biscuits and all the usual breakfast fare. Even the coffee was good.The interior and dog areas are quite clean.', u'Every hotel staff member I encountered was very friendly and helpful. The quality of the hotel and my room were excellent, and I ran into zero problems. The food was good and there was a good variety. Bed was comfortable. I have no complaints.', u"Staff was very accommodating. Rooms were clean coffee was fresh. Short distance from downtown we will definitely stay again!!! Clean rooms, clean bathrooms, we loved it!!! Restaurants and shopping close by. Stayed 4 nights we'll be back!", u'This hotel is perfect, the people were so nice and the rooms were clean and updated, the breakfast was awesome, and very affordable!! So refreshing to see employees taking pride in the place of work!!! I would recommend this hotel to anyone and i also will frequent is again!!!'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/09/e3/11/e3/exterior-view.jpg'}
{'review_count': u'3231', 'title': u'Wyndham Grand Pittsburgh Downtown Hotel', 'rating_string': u'3.5', 'address': u'600 Commonwealth Place, Gateway Ctr, Pittsburgh, PA 15222', 'review_list': [u'Great place to stay! Clean room,, comfortable bed! Staff very helpful and pleasant! Stayed there for the Springsteen concert. Subway right across the street. Short walk to bars and restaurants.\nOnly negative thing was you could actually here conversations and "other" things in adjoining room. Awkward.', u"We were attending an event at the convention center the location was walking distance with the weather so mild but they have a shuttle van out front but don't provide shuttle service. On Saturday night after a long day we went to the pool area looking forward to relaxing in the hot tub. There was a rather rude and indignant...\n\n\nMore", u'First: I made reservation through they Wyndham central booking- who offered a very low rate- but did not provide all the information/direction- which was that I needed to go to the TravelZoo site to pay and get the voucher. Upon arrival they would not honor the price even with the email confirmation from Wyndham.\nSecond: The room was very worn,...\n\n\nMore', u"I was able to snag a deal on hotwire for this hotel for $80 a night. So with that in mind- I wouldn't have paid their $150 per night price tag. The location is great and if you get a river view room its even better. The important things- bed was comfortable, sheets were clean, room was clean. I did...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/01/a3/98/6e/standard-king-guest-room.jpg'}
{'review_count': u'92', 'title': u'Comfort Inn - Pittsburgh / Steubenville Pike Hotel', 'rating_string': u'3.5', 'address': u'4770 Steubenville Pike, Pittsburgh, PA 15205', 'review_list': [u"So glad we booked this hotel. Price was great, hotel and rooms were clean. Staff was so nice and friendly, large rooms. They have a breakfast but on the smaller side. They have soda, snack and ice machines. It's away from all the traffic but a cab ride to down town is quick. We would defiantly stay here again.", u"I've stayed at this hotel twice and will not stay again. In both cases I checked into a room that smelled like it had been smoked in many times. To make matters worse the windows are fixed and cannot be opened. I personally cannot stand any room that has been smoked in, it always gives me slight headache. When I...\n\n\nMore", u'We were in Pittsburgh for Baseball at PNC Park and chose this hotel due to its location. It is located about 10-miles from downtown and there are several routes to take depending on traffic and construction. The Interstate and Fort Pitt Tunnel is most always crowded especially during the work week and rush hour. There are a couple of route...\n\n\nMore', u'Close to everything yet away from the congestion. Incredible staff - polite and very helpful. They take care of this hotel - recently renovated and clean, clean, clean. Would recommend anyone going through the area to spend the evening here.', u"Nice hotel. Rooms look like recently renovated. Good beds. I've had better comfort Inn breakfasts. Waffles were good other stuff not great. Getting in and our were tough due to median. Drive to pittsburgh not too bad. Followed 60 in and out. Staff nice. Close to mall the other way.", u'the room was clean, well maintained. the bed was one of the most comfortable beds i have ever slept on! the breakfast had something for everyone, waffles, eggs, sausage, fresh fruit, cereals, bagels, juice, coffee, tea, muffins, nothing fancy. the staff at the desk were super friendly and helpful.the air conditioner took a while to really cool the room, it...\n\n\nMore', u"The hotel is nice enough if you are just passing through, however the bedspread & the blanket both had stains on them. Shower wasn't the cleanest either, I have stayed here before and was pleased with previous stays however I don' think I will be going back any time soon.", u'I stayed here two nights while in town for a concert with 3 friends and was very impressed! Clean, updated, comfortable with great staff and nice rooms. Our room had two double beds and to my surprise a pull out sofa bed. Great shower pressure as well! The free breakfast was great. Eggs, sausage, waffles, etc. Way more than you...\n\n\nMore', u'This was the 5th or 6th time we have stayed at this Comfort Inn. It has improved each time. It was very clean. Halls, elevator and room all smelled fresh. Extremely friendly and courteous at check-in. The room was very quiet considering the location on busy traveled Stuebenville Pike. Very good options at breakfast. We will be back in the...\n\n\nMore', u"Stayed at this hotel memorial weekend for my husband and mine one year anniversary. It was away from the city which was a bummer for us, but the hotel itself was perfectly fine. I would stay there again and recommend family and friends. Super small, but that was one of the nice things about it. The quietest hotel I've ever...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/07/7f/72/69/exterior.jpg'}
{'review_count': u'216', 'title': u'Comfort Inn Conference Center Hotel, Pittsburgh', 'rating_string': u'3.0', 'address': u'699 Rodi Road, Pittsburgh, PA 15235', 'review_list': [u'We stopped here for an overnight stay after finding a coupon in travel magazine. We had no reservation but were greeted by the friendly desk clerk and given a wonderful room. The room was clean and bed nice.\nBeing after 8pm we had dinner in the resturant/bar/lounge on site. Dinner was very good and beer was cold. Waitress young lady...\n\n\nMore', u"My son attends Carnegie Mellon so we often need a hotel, but can't really afford to spend a lot. This Comfort Inn is awesome! They are pet friendly, which means I don't need to kennel my dog. Breakfast is included and includes a waffle station, eggs, meats, yogurt, cereal and pastries. Service is always great at the desk and in...\n\n\nMore", u'We go Christmas shopping every year and we always spend the night and this was the first trip that we stayed here and we really enjoyed it! The staff was friendly and helpful and we were the guests of the day as well so we got some cookies and water etc. which was nice. Our room was nice and comfy...\n\n\nMore', u"We come to Penn Hills frequently to visit an elderly relative. This place is frequently booked up and we have to venture further away to find a room. We were in luck this time and I'm happy we were able to stay here. The layout of the motel is confusing but once we found our room, we were very pleased....\n\n\nMore", u"I was in the Pittsburgh area for a family member's funeral this past week. The location of this Comfort Inn was great for my purposes. My husband and I had stayed at this same Comfort Inn five years ago and weren't impressed. When I saw that the hotel's website indicated the facility had been updated, I thought okay, maybe. I...\n\n\nMore", u'We just arbitrarily stopped here for an overnight stay on the way to a family wedding in Stroudsburg, PA. We had no reservation but were cordially greeted by the desk clerk and given a very nice room. The room was clean and well lit. We were very tired so rather than go out for dinner we ate at the "In...\n\n\nMore', u'I have stayed at this hotel many times over many years and I must say that the service is declining. We reserved our room online and got into town around noon. We were unable to check in until 3pm and the hotel would not hold our luggage for us. We were charged half the room rate for 2 hours past...\n\n\nMore', u'My husband and I just spent two l-o-n-g nights at this hotel. I usually avoid Comfort Inns, however, this one had been rated with 4-stars on a different website and due to a shortage of hotel rooms in the Pittsburgh area this weekend (10/9-10/11/15), we took a chance. My impression? One word: Ugh. Despite having some obvious updates (flat screen...\n\n\nMore', u'The first thing we saw was a big dark spot on the bed covering. There was hair on the shower wall and hair on the bathroom floor. There were food crumbs in the refrigerator. There was a blob of sticky stuff on the inside of the Comfort Inn notebook. The chair had spots on it so that we did not...\n\n\nMore', u'The hotel is located just a 20 minute drive away from downtown Pittsburgh and right by the exit along the highway 376. It is quite the picturesque location, situated at the top of a hill. Check-in was smooth, rooms were nice and clean though the bathroom seemed a little dated. They had a decent spread for breakfast and very friendly...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/06/fe/1f/02/exterior.jpg'}
{'review_count': u'266', 'title': u'Quality Inn University Center Hotel, Pittsburgh', 'rating_string': u'3.0', 'address': u'3401 Boulevard of the Allies, Pittsburgh, PA 15213', 'review_list': [u'This is a great hotel in a great location! All of the staff were very pleasant and helpful, and it was very easy to get to any location in Pittsburgh in an easy and timely manner. This hotel was a tremendous value for the price.', u'My kids have dubbed this one as "the best hotel ever"! When we checked in just a couple of days after Christmas, my kids were allowed to pick presents from under the tree. It was not an extravagant gift, some small things to occupy them but you would have thought they had been given something huge! The ladies at the...\n\n\nMore', u'Emily (and a guy who looked like Josh Groban) greeted us and both were friendly, quick to register and willing to assist. Emily was awesome.When she learned of health issues, she offered and went to my car, placed the parking pass, returned keys to me and also brought goodie snack items(because we moved to a different room that would accommodate...\n\n\nMore', u'This is a great economical hotel, with free parking, wifi, newspapers and coffee. This is the perfect hotel for families, students who are checking out the University or if you just arrived in town to check out the Stealers game. The hotel is close to downtown Pittsburgh, steps away from the University and a short distance to Mount Washington which...\n\n\nMore', u'Stayed two nights for some medical appointments. We had a great stay. The courtesy shuttle drivers were so nice and helpful and full of great information. The front desk staff were friendly. Plenty of parking.\nOur room had some cosmetic maintenance issues such as small cracks in drywall, poor workmanship around the air/heating unit and the balcony door was bent...\n\n\nMore', u'This hotel "motel" was one of the dirtiest places I have ever stayed. My door was left open by housekeeping staff. We were staying there while my husband was at UPMC. The staff were rude. There was one nice older lady who was at desk and drove the shuttle van. The price is cheap and that is because this is...\n\n\nMore', u"I really just expected an average experience for the one night I stayed here but, as it is many times when you travel, it's the kindness and service of the staff that really make the difference. When I asked for a quiet room, even though they were going to be full that evening, they delivered with a corner room on...\n\n\nMore", u'Having only stayed here for just one night to be able to see the Montreal Canadiens play the local Penguins at the Consol Energy Center, I have nothing but compliments to the staff for providing excellent service and a fine room which suited my needs.\nRecent reviews comment on the helpfulness of the reception staff who go out of their...\n\n\nMore', u'I stayed in this hotel for 6 nights because I was there to oversee care of my sister at UPMC Montefiore. The room was basic for me to sleep there (and not even all of the nights as I stayed at the hospital for 2 nights). The reception staff was most hospitable and accommodating. Having Panera right there was a...\n\n\nMore', u"Needing an economical place to stay to watch the Steelers play at Heinz field we thought this was the right choice. However within a few minutes we realized we'd sacrificed certain comforts for a cheaper rate. When we arrived we were given a key to a room that was already occupied. The bathroom had mold. The door to the balcony...\n\n\nMore"], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-p/01/c6/1c/33/quality-inn-university.jpg'}
{'review_count': u'44', 'title': u'Econo Lodge Motel, Pittsburgh', 'rating_string': u'3.5', 'address': u'4800 Steubenville Pike, Pittsburgh, PA 15205', 'review_list': [u"Fairly clean..friendly staff....less than 1000 feet from the highway and gas station with a store so request a room on the back if you're a light sleeper. My cousin liked the breakfast, it has fresh fruit and danishes and coffee.", u'We were just looking for an inexpensive place for a weekend trip. The Econo Lodge is older but the rooms have been updated some. There is nothing fancy but our room was clean and the bed was comfortable. There is a mini fridge and microwave in the room. The front desk was friendly and the free breakfast was fine. I...\n\n\nMore', u'stayed here for two nights, while in the area for a MLB game. the gentleman at check in was very friendly and helpful. we had a room with a king size bed and couch. bathroom was a little small, but clean. plenty of water pressure in the shower. the room was very clean, and the bed was just right (not...\n\n\nMore', u"When I pulled up to this motel, I was concerned. It was late, it looked like it was not kept up and the guest signing up in front of me was a little disconcerting. When I walked into the room, the style was outdated. I didn't even know if I would stay the second night. However, it was a super...\n\n\nMore", u'I was extremely satisfied with my stay here! The staff was pleasant, the room was very clean, the internet was fast, the location was great to Pittsburgh, and the price was awesome! I would no doubt stay here again!', u"I'm Diamond with Both Choice and Best Western. I've Never stayed at an Econo Lodge before. It was Late, I was Exhausted and it was right off the Highway. I Pulled up, checked my I phone and saw an 81% Recommended. I said it's Only to Rest, I'll Get a Real hotel in the Morning. Needless to say, I'm Staying...\n\n\nMore", u'Showed up really late - almost midnight - so was not sure what we were really getting into. Huge potholes in lot - found them bu surprise. The rooms were very, very, very outdated. If you need a place just to lay your head for one night - and one night only, you should be ok.\nWe had a good...\n\n\nMore', u'very nice rooms, and the staff was friendly, not a very good location or parking if you are moving with a truck and trailer, there is no room to turn around. found parking and had a very nice night breakfast was great, I would stay here again', u"I'm assuming that for those who decided to stay in this motel, you are not looking for an extravagant experience. The place is just like the picture from some previous reviews. Very 50s feel. The location is roughly 15-20 mins between airport and the city. Although it is very close to a large shopping area if anybody cares. Staff is...\n\n\nMore", u'I am a Choice Hotel employee, and when I had to make an emergency trip to Pittsburgh from Nashville TN, I checked into the Econo Lodge, expecting the worst, and was pleasantly surprised. The room was clean, nice big television, and the staff was friendly. Would stay here again.'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/09/e5/84/1a/exterior.jpg'}
{'review_count': u'531', 'title': u'Microtel Inn & Suites by Wyndham Pittsburgh Hotel', 'rating_string': u'3.0', 'address': u'900 Chauvet Drive, Pittsburgh, PA 15275', 'review_list': [u'I am truly thankful unto the Lord for affording me such a wonderful trip to "Steeler Nation". Heinz field is now my favorite stadium. I had a blast! The viator tour was amazing!!! I stayed at the Microtel Eco lodge Inn and suites. My room was clean. The staff were friendly and professional. It was affordable and had breakfast every...\n\n\nMore', u'Very average hotel but served our purposes. We stayed there the night before we departed for Cozumel, Mexico. I could use some renovation and it looks like they are trying to do this. Price was great, shuttle to and from airport and included parking.', u"stayed here late night (2am) in november. was greeting by a sleeping desk clerk (h3ll, i don't blame her) on two roller chairs in the office behind the desk. asked for a quiet room facing the back. got a quiet room facing the front. room was as teeny as in nyc but it did the trick. got a solid quiet...\n\n\nMore", u'Some Microtel Inns are great. This is bit one if then. The room was in need of upgrading and better maintenance. The staff was. It particularly welcoming. Once was enough. I found better places to stay in the area.', u"If you want a lot of amenities then this is not the place to stay. The rooms are very small and compact. Not good for families unless you have a suite and then I wouldn't recommend for families. Clean and decently priced. No pool. A average stop and go, not a park and stay.", u"Clean sheets and towels in an otherwise wornout hotel. This is no longer a Microtel but is now an Econolodge. It is overdue for a renovation and a deep cleaning in the common areas. It is OK for a quick stay before or after a flight but don't expect much.", u'Well I booked the room because I traveled with my children and POOL was one of the amenities. when I checked in I asked what time does the pool close and she told me that there was no pool. I was pissed. Never again!!!!!', u'Have been here before and received a great deal from booking.com Would probably not return as the bed was one of the most uncomfortable beds ever. Wonderful and very helpful staff. clean room. less than average continental breakfast with waffles.convenient location in Robinson township.', u'I have stayed here before but this is the last time. When we got to our room I found that there was not an iron. We stopped at the front desk to ask the clerk for an iron and she said the only way to do that was to change rooms. I told her I just needed one for 10...\n\n\nMore', u"We booked through an online site. When we arrived the front desk clerk acted as if we were a bother. Barely an audible greeting, if one at all. She had no smile on her face or even in her body language. I am a people person, so I pick up quickly on others! If it weren't for the price &...\n\n\nMore"], 'img_url': u'http://static.tacdn.com/img2/x.gif'}
{'review_count': u'439', 'title': u'Days Inn Pittsburgh Motel', 'rating_string': u'2.5', 'address': u'1150 Banksville Road, Pittsburgh, PA 15216', 'review_list': [u'We stayed there for one night. Our room was last in the hall, no windows visible to outside. It was like staying in a basement.. Very outdated..\nBut the girl at the front desk was so incredibly helpful, kind and welcoming.\nHowever everyone in the area knew how "sketchy" this place was. The pizza delivery person even said "you\'re stayin...\n\n\nMore', u"I actually only live about 60 miles from this hotel, but I frequently entertain customers in the downtown Pittsburgh area, and choose not to drive when I've been drinking. I've only recently found this property, and have stayed at all the budget to mid range hotels in the area. The hotel is a short and inexpensive cab ride across the...\n\n\nMore", u'Upon checking into room we went immediately to sleep as it was late and we had an apt at UPMC the following morning for my daughters surgery. Upon waking up at 430 am I was eaten up with Bed Bug bites from head to toe with welps all over my body. When I checked out at 530 am the clerk...\n\n\nMore', u"I don't have a lot of nice things to say about this property. Boogers on the sheets. Need I say more?", u'I checked in for a 3 night stay while touring Pittsburgh. Getting to the motel was a pain with construction and unclearly marked Y in the construction. Check in went smoothly and hoped for a smoking room on the ground floor, what I got was an underground smoking room. This hotel has 3 levels and all have stairs the ‘ground...\n\n\nMore'], 'img_url': u'http://static.tacdn.com/img2/x.gif'}
{'review_count': u'240', 'title': u'Days Inn Pittsburgh-Harmarville Motel', 'rating_string': u'2.5', 'address': u'6 Landings Drive, Route 28 & Pennsylvania Turnpike, Pittsburgh, PA 15238', 'review_list': [u'I considered\nI will rate this property (guest room) as average. The room (217) was clean but the furnishings dated and the towel rack in the bathroom was unstable to the touch falling when a towel was removed. Floor tiles around the wall and tub had considerable water damage and needed to be replaced. The bed was comfortable, pillows were...\n\n\nMore', u'I stayed here with a friend following a sporting event. It is inexpensive, easy to find and convenient to service stations, convenience stores and the PA Tpk interchange. We arrived about 9 PM and were gone by 6 AM. It fulfilled our needs', u'Upon check in we requested a non-smoking room and upon entering our room it smelled of smoke. The one bed had been laid on as the comforter and pillows were out of place. Made a complaint and was assigned another room. Second room smell was better but small. Had to step up into the shower and step down. The front...\n\n\nMore', u"The experience was very bad due to the 1st room had human stuff on the toilet seat and rim, 2nd rm full off mold and mildew in the shower and carpeting was very dirty. The rm security very poor and see thru door. I steam cleaned the room carpet myself due to bad odor. If my company didn't pay for...\n\n\nMore", u'We usually stay here when we go to a Pirates game. Don\'t normally have complaints, but this time we got the only room left unoccupied and it was the "handicap" room. I\'d feel very sorry if an actual handicap person had to stay here. It was cramped, bathoom was moldy. Not the most pleasant stay we\'ve had here, but will...\n\n\nMore'], 'img_url': u'http://static.tacdn.com/img2/x.gif'}
{'review_count': 'Unknown', 'title': u'Embassy Suites by Hilton Pittsburgh Downtown Hotel', 'rating_string': 'Unknown', 'address': u'535 Smithfield Street, Pittsburgh, PA 15222', 'review_list': [], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-w/09/a6/6b/f2/embassy-suites-by-hilton.jpg'}
{'review_count': u'109', 'title': u'Hilltop Inn PIttsburgh Motel', 'rating_string': u'2.5', 'address': u'100 Kisow Dr., Pittsburgh, PA 15205 (Formerly Travelodge Pittsburgh)', 'review_list': [u'My previous review of this property was not posted- not sure why. I provided a very detailed and truthful chronicle of the worst hotel stay of my life. This hotel is filthy and in disrepair. the room I had was infested by bugs. Do not stay here.', u"Had this hotel not been pre booked (cancellation window passed) we would have walked to one of the neighboring hotels after smelling our room's sour moisture aroma.\nMy first concern was watching someone in front of us check in without reservation or credit card. Indicator they don't hold their own property in high regard.\nAt first glance the room seemed...\n\n\nMore", u"Where to begin...\nThe purpose of the trip was a last minute football venture where a friend of mine and I drove from Toronto to Pittsburgh for the evening.\nWe used hotels.com to book, which will be the last time using that website, and let's just say, you definitely pay for what you get, and get scammed while you're doing...\n\n\nMore", u'My husband\'s sister passed away suddenly and we were looking for a reasonable motel to stay in close to the airport. When we got into our room it was hot and stuffy. The carpet is covered in stains, appears to be black grease. Black paint was also splattered on the wall near the "air conditioner" which I use the words...\n\n\nMore', u'I stayed at this hotel while on my way home from Philadelphia, just to sleep for the night before finishing our drive home. The inn is more of a motel where each room has a door leading out to the parking lot and its own box air conditioner in the window. Upon first entering the room, we noticed a strange,...\n\n\nMore', u'We arrived at this dive at 3am. They made us pay for the room as soon as we arrived instead of the usual payment at checkout. Right then I knew something was up. Checkout is 11am, keep in mind that we are the only car in the lot and only couple staying in this motel. We traveled over 6 hours...\n\n\nMore', u'I\'ve remained neutral in any hotel I\'ve ever stayed. This one took the cake.I pulled up to this "hotel". Very bare (for lack of a better word) and hidden from any signs of life.(It was next to another hotel and a huge corporation and just parking lots). I usually like to grab something to eat near a hotel I\'m staying......\n\n\nMore', u"The staff at this hotel act like you are bothering them when you interact with them in any way from checking in, to asking questions, to checking out. The rooms themselves are horrible, many items in the rooms are either poorly repaired or altogether broken. the first room they assigned us to, the lights over the sink didn't work and...\n\n\nMore", u'Don\'t beleive the "free breakfast"; a trip advisor post warned me it would be just white toast and reconstituted orange juice, but when I went the toaster was broken and they wee out of OJ. No glassware in the room; ever try to make hot coffee in a styrofoam cup? And the slowest wifi I have ever encountered; reminded me...\n\n\nMore', u'I went to stay there with my family and had one if the worst experiences there. The staff are not friendly and one of the staff guys accused us of stealing their towels ( in broken English with an accent ).\nThe lady at the main lobby kept spying on us when we went to have breakfast.\nThe rooms are...\n\n\nMore'], 'img_url': u'http://media-cdn.tripadvisor.com/media/photo-o/07/7b/97/0e/guest-room.jpg'}
{'review_count': 'Unknown', 'title': u'Hilton Garden Inn Pittsburgh Airport South / Robinson Township Hotel', 'rating_string': 'Unknown', 'address': u'303 Park Manor Drive, Pittsburgh, PA 15205', 'review_list': [], 'img_url': ''}
{'review_count': 'Unknown', 'title': u'Hilton Garden Inn Pittsburgh Downtown Hotel', 'rating_string': 'Unknown', 'address': u'250 Forbes Avenue, Pittsburgh, PA 15222', 'review_list': [], 'img_url': u'http://static.tacdn.com/img2/x.gif'}
{'review_count': u'30', 'title': u'Motel 6 Pittsburgh', 'rating_string': u'2.5', 'address': u'2834 Banksville Rd., Pittsburgh, PA 15216 (Formerly Pittsburgh Inn)', 'review_list': [u"I don't expect to be treated like royalty when staying in an inexpensive hotel. However, when I come to the front desk I do expect to be treated professionally. The girl at the front desk was face timing her friends who were swearing and talking about their evening plans. After I checked in I turned around to see that some...\n\n\nMore", u"We stayed 3 nights there recently. Having asked for a quiet room in my reservation I was given the room right off the lobby with the central stairwell just behind our bed. We checked in late and I was tired so didn't change figuring things would quiet down. The front desk noise did around 11pm, but people were banging on...\n\n\nMore", u'Showers were hot, room was clean, staff was nice. Close proximity to Allegheny General Hospital (about 20 minutes). This hotel was significantly cheaper than others in the area. Would definitely stay again.', u'We stayed at this Motel 6 last weekend. There was no question about where to stay since we stayed there in December 2014 for a family affair. It is a nice place, is pet friendly, has a nice location and is economical. Recommend it for staying and visiting the city.', u"A real DUMP.. Ceiling dripped on the bed and on the floor. Toilet ran every 10 minutes all night long. All ice machines broken.. Hand held shower didn't fit the clip and ran all over the bathroom floor. Doors banged all night long. Shady characters outside our window most of the night. A/C noisy off and on all night. Heard...\n\n\nMore", u'We had stayed here previously when it was the Comfort Inn, about 3 years ago. Not a high-polish, high-end place, but no notable problems with it. The going rate is $60 (the cheapest price is accessed direct through their site) and noticed you can get another 10% off if you are AARP. If the front parking lot is filled there...\n\n\nMore', u'This hotel should not offer non-smoking rooms if they aren\'t available. Our "non-smoking" room required us to walk through a very smelly smoking hallway (tobacco and *other*). When we got to our room, there were two ash trays by the beds and one in the bathroom. A call to the front desk and we were told that our room was...\n\n\nMore', u'Stayed for two nights while in town for a Steelers game. Got a great rate but the room was to be non-smoking and the smell hit you as you walked in the door. I called to change but got the "were full" line. Opened window, washed a/ c screens in the bathtub and lite a candle. Few hours later it...\n\n\nMore', u'This motel 6 was filthy and poorly maintained. upon arriving to our room we found it was in the smoking section when we specifically requested nonsmoking, and they were unwilling to change us to a nonsmoking room because they were booked. The room was visibly dirty with an unswept carpet, dirty mirror, smudges on the furniture and window and even...\n\n\nMore', u"This facility became a Motel 6 only about a year ago. So you can understand why it doesn't look like the typical shabby Motel 6 and why it offers much more comfort. We found the rooms to be sizeable, the bathroom to work well (as another reviewer mentioned, they don't provide shampoo - so bring your own), the television and...\n\n\nMore"], 'img_url': u'http://static.tacdn.com/img2/x.gif'}
